const weaponCap = [
    {
        "category": "單手劍(片手剣)",
        "tab": "sword",
        "active": true,
        "list": [
            {
                "name": "長劍 (ブロードソード)",
                "attr": "-",
                "atk": "5",
                "sp": "-",
                "se": "",
                "buy": "630",
                "sell": "60"
            },
            {
                "name": "鐵劍 (スティールソード)",
                "attr": "-",
                "atk": "10",
                "sp": "-",
                "se": "",
                "buy": "1010",
                "sell": "210"
            },
            {
                "name": "鐵劍改 (スティールソード改)",
                "attr": "-",
                "atk": "21",
                "sp": "魔攻+5",
                "se": "",
                "buy": "2910",
                "sell": "340"
            },
            {
                "name": "彎刀 (カトラス)",
                "attr": "-",
                "atk": "32",
                "sp": "魔攻+48",
                "se": "",
                "buy": "3560",
                "sell": "480"
            },
            {
                "name": "瘙癢撓 (まごの手)",
                "attr": "-",
                "atk": "27",
                "sp": "-",
                "se": "",
                "buy": "2000",
                "sell": "30"
            },
            {
                "name": "水之劍 (アクアソード)",
                "attr": "水",
                "atk": "41",
                "sp": "魔攻+24",
                "se": "",
                "buy": "4700",
                "sell": "590"
            },
            {
                "name": "風之劍 (ウインドソード)",
                "attr": "風",
                "atk": "56",
                "sp": "魔攻+28",
                "se": "",
                "buy": "8400",
                "sell": "900"
            },
            {
                "name": "防禦之劍 (ディフェンダー)",
                "attr": "-",
                "atk": "63",
                "sp": "防+15",
                "se": "",
                "buy": "10040",
                "sell": "1020"
            },
            {
                "name": "燃燒之劍 (バーニングソード)",
                "attr": "火",
                "atk": "78",
                "sp": "魔攻+35",
                "se": "",
                "buy": "12400",
                "sell": "2500"
            },
            {
                "name": "大地之劍 (ガイアソード)",
                "attr": "地",
                "atk": "80",
                "sp": "魔攻+40",
                "se": "",
                "buy": "12900",
                "sell": "2040"
            },
            {
                "name": "勺子 (スプーン)",
                "attr": "-",
                "atk": "50",
                "sp": "魔攻+98",
                "se": "",
                "buy": "10140",
                "sell": "440"
            },
            {
                "name": "紅櫻 (紅桜)",
                "attr": "暗",
                "atk": "89",
                "sp": "-",
                "se": "",
                "buy": "15200",
                "sell": "3300"
            },
            {
                "name": "幸運之劍 (ラックブレード)",
                "attr": "-",
                "atk": "97",
                "sp": "-",
                "se": "容易使出會心一擊，容易令對方氣絕",
                "buy": "18990",
                "sell": "3340"
            },
            {
                "name": "空舞之劍 (エリアルブレード)",
                "attr": "風",
                "atk": "115",
                "sp": "魔攻+60",
                "se": "",
                "buy": "23580",
                "sell": "3650"
            },
            {
                "name": "太陽劍 (サンスパーダ)",
                "attr": "火",
                "atk": "126",
                "sp": "魔攻+65",
                "se": "",
                "buy": "24520",
                "sell": "4750"
            },
            {
                "name": "迪蘭達爾 (デュランダル)",
                "attr": "-",
                "atk": "133",
                "sp": "防+30",
                "se": "",
                "buy": "27720",
                "sell": "6120"
            },
            {
                "name": "格蘭蒂爾 (グランテール)",
                "attr": "地",
                "atk": "145",
                "sp": "魔攻+70",
                "se": "",
                "buy": "35000",
                "sell": "6900"
            },
            {
                "name": "蔬菜劍 (ベジタブレード)",
                "attr": "地",
                "atk": "0",
                "sp": "魔攻+155",
                "se": "",
                "buy": "30980",
                "sell": "2260"
            },
            {
                "name": "致命之劍 (スマッシュブレード)",
                "attr": "-",
                "atk": "148",
                "sp": "-",
                "se": "",
                "buy": "35500",
                "sell": "7000"
            },
            {
                "name": "混沌之劍 (カオスブレード)",
                "attr": "暗",
                "atk": "152",
                "sp": "魔攻+75",
                "se": "附帶麻痹效果",
                "buy": "36160",
                "sell": "7100"
            },
            {
                "name": "死亡之劍 (デスジュラード)",
                "attr": "水",
                "atk": "157",
                "sp": "魔攻+80",
                "se": "",
                "buy": "43420",
                "sell": "8290"
            },
            {
                "name": "星辰之劍 (スターセイバー)",
                "attr": "風",
                "atk": "172",
                "sp": "魔攻+85",
                "se": "",
                "buy": "48000",
                "sell": "8500"
            },
            {
                "name": "奪魂者 (ソウルイーター)",
                "attr": "-",
                "atk": "166",
                "sp": "-",
                "se": "",
                "buy": "51200",
                "sell": "8620"
            },
            {
                "name": "豪華之劍 (ゴージャスソード)",
                "attr": "-",
                "atk": "187",
                "sp": "-",
                "se": "",
                "buy": "60600",
                "sell": "10000"
            },
            {
                "name": "蛇劍 (スネークソード)",
                "attr": "-",
                "atk": "198",
                "sp": "-",
                "se": "",
                "buy": "99700",
                "sell": "9110"
            },
            {
                "name": "災難之劍 (レーヴァンテイン)",
                "attr": "火",
                "atk": "221",
                "sp": "魔攻+90",
                "se": "",
                "buy": "163350",
                "sell": "9920"
            },
            {
                "name": "龍劍 (ドラグスレイヤー)",
                "attr": "-",
                "atk": "233",
                "sp": "-",
                "se": "",
                "buy": "264900",
                "sell": "10600"
            },
            {
                "name": "白金之劍 (プラチナソード)",
                "attr": "-",
                "atk": "246",
                "sp": "-",
                "se": "",
                "buy": "314400",
                "sell": "12050"
            },
            {
                "name": "白金之劍改 (プラチナソード改)",
                "attr": "-",
                "atk": "258",
                "sp": "魔攻+30",
                "se": "",
                "buy": "489360",
                "sell": "14820"
            },
            {
                "name": "隱形之劍 (インビジブレード)",
                "attr": "-",
                "atk": "270",
                "sp": "魔攻+160",
                "se": "",
                "buy": "550000",
                "sell": "18000"
            },
            {
                "name": "符文之劍 (ルーンブレード)",
                "attr": "光",
                "atk": "277",
                "sp": "魔攻+180",
                "se": "",
                "buy": "582260",
                "sell": "22000"
            },
            {
                "name": "格拉迪烏斯 (グラディウス)",
                "attr": "-",
                "atk": "284",
                "sp": "魔攻+100",
                "se": "容易使出會心一擊，容易令對方氣絕",
                "buy": "626500",
                "sell": "32000"
            },
            {
                "name": "符文傳說 (レジェンドオブルーン)",
                "attr": "-",
                "atk": "293",
                "sp": "魔攻+200",
                "se": "",
                "buy": "846940",
                "sell": "41410"
            }
        ]
    },
    {
        "category": "雙劍(雙剣)",
        "tab": "doublesword",
        "list": [
            {
                "name": "短劍 (ショート)",
                "attr": "-",
                "atk": "6",
                "sp": "-",
                "se": "",
                "buy": "950",
                "sell": "110"
            },
            {
                "name": "鋼鐵雙刃 (スティールエッジ)",
                "attr": "-",
                "atk": "13",
                "sp": "-",
                "se": "",
                "buy": "1510",
                "sell": "340"
            },
            {
                "name": "鋼鐵之刃 (アイアンエッジ)",
                "attr": "-",
                "atk": "24",
                "sp": "魔攻+5",
                "se": "",
                "buy": "2980",
                "sell": "750"
            },
            {
                "name": "盜賊匕首 (シーフナイフ)",
                "attr": "-",
                "atk": "35",
                "sp": "-",
                "se": "",
                "buy": "3670",
                "sell": "960"
            },
            {
                "name": "冰之刃 (フロストエッジ)",
                "attr": "水",
                "atk": "46",
                "sp": "魔攻+20",
                "se": "",
                "buy": "4630",
                "sell": "1020"
            },
            {
                "name": "雙瘙癢撓 (ダブルまごの手)",
                "attr": "-",
                "atk": "42",
                "sp": "魔攻+49",
                "se": "",
                "buy": "4160",
                "sell": "190"
            },
            {
                "name": "斬鋼刃 (斬鋼刃)",
                "attr": "-",
                "atk": "57",
                "sp": "-",
                "se": "",
                "buy": "8484",
                "sell": "980"
            },
            {
                "name": "風之刃 (ウィンドエッジ)",
                "attr": "風",
                "atk": "66",
                "sp": "魔攻+30",
                "se": "",
                "buy": "9260",
                "sell": "1160"
            },
            {
                "name": "毀滅之墻 (ブロークンウォール)",
                "attr": "地",
                "atk": "75",
                "sp": "魔攻+40",
                "se": "",
                "buy": "10440",
                "sell": "2300"
            },
            {
                "name": "蠑螈雙劍 (サラマンダー)",
                "attr": "火",
                "atk": "88",
                "sp": "魔攻+45",
                "se": "",
                "buy": "11100",
                "sell": "2820"
            },
            {
                "name": "雙勺 (アクトリマッセ)",
                "attr": "-",
                "atk": "72",
                "sp": "魔攻+80",
                "se": "",
                "buy": "10300",
                "sell": "640"
            },
            {
                "name": "狂暴雙刃 (ランペイジ)",
                "attr": "-",
                "atk": "96",
                "sp": "-",
                "se": "",
                "buy": "13000",
                "sell": "3020"
            },
            {
                "name": "音速短劍 (ソニックダガー)",
                "attr": "風",
                "atk": "104",
                "sp": "魔攻+55",
                "se": "",
                "buy": "17630",
                "sell": "3380"
            },
            {
                "name": "甜美之風 (デザートウィンド)",
                "attr": "地風",
                "atk": "115",
                "sp": "魔攻+75",
                "se": "",
                "buy": "18880",
                "sell": "3840"
            },
            {
                "name": "雙蔥 (ツインネッギ)",
                "attr": "-",
                "atk": "39",
                "sp": "魔攻+39，力量+39，體力+39，智力+39",
                "se": "容易使對方氣絕",
                "buy": "30939",
                "sell": "3939"
            },
            {
                "name": "雙鬼丸 (雙鬼丸)",
                "attr": "-",
                "atk": "126",
                "sp": "-",
                "se": "",
                "buy": "19950",
                "sell": "4510"
            },
            {
                "name": "火焰心 (ハートオブファイア)",
                "attr": "火",
                "atk": "136",
                "sp": "魔攻+80",
                "se": "",
                "buy": "23310",
                "sell": "5060"
            },
            {
                "name": "原力分割 (フォースディバイド)",
                "attr": "火水",
                "atk": "145",
                "sp": "魔攻+90",
                "se": "",
                "buy": "25000",
                "sell": "5200"
            },
            {
                "name": "冥王之劍 (オルクスソード)",
                "attr": "-",
                "atk": "150",
                "sp": "-",
                "se": "",
                "buy": "34560",
                "sell": "5280"
            },
            {
                "name": "暴風雪 (ディープブリザード)",
                "attr": "水",
                "atk": "167",
                "sp": "魔攻+100",
                "se": "",
                "buy": "40240",
                "sell": "8480"
            },
            {
                "name": "混沌之刃 (カオスエッジ)",
                "attr": "暗",
                "atk": "172",
                "sp": "魔攻+85",
                "se": "攻擊時有麻痹效果",
                "buy": "45000",
                "sell": "9500"
            },
            {
                "name": "噬魂者 (インバイトダクネス)",
                "attr": "暗",
                "atk": "181",
                "sp": "魔攻+90 HP吸收5%",
                "se": "",
                "buy": "50800",
                "sell": "9900"
            },
            {
                "name": "聖職之劍 (プリーストセイバー)",
                "attr": "-",
                "atk": "195",
                "sp": "魔攻+100 魔防+40",
                "se": "",
                "buy": "57600",
                "sell": "10050"
            },
            {
                "name": "巨豪華之劍 (ベリーゴージャス)",
                "attr": "-",
                "atk": "207",
                "sp": "-",
                "se": "",
                "buy": "72440",
                "sell": "25000"
            },
            {
                "name": "火焰暴君 (イフリート)",
                "attr": "火",
                "atk": "217",
                "sp": "魔攻+60",
                "se": "",
                "buy": "102350",
                "sell": "10380"
            },
            {
                "name": "龍爪 (ドラグーンクロー)",
                "attr": "-",
                "atk": "243",
                "sp": "-",
                "se": "",
                "buy": "285850",
                "sell": "11000"
            },
            {
                "name": "白金雙刃 (プラチナエッジ)",
                "attr": "-",
                "atk": "256",
                "sp": "-",
                "se": "",
                "buy": "355600",
                "sell": "13920"
            },
            {
                "name": "綠寶石之刃 (エメラルドエッジ)",
                "attr": "風",
                "atk": "270",
                "sp": "魔攻+110",
                "se": "",
                "buy": "517800",
                "sell": "30240"
            },
            {
                "name": "符文之刃 (ルーンエッジ)",
                "attr": "光",
                "atk": "285",
                "sp": "魔攻+200",
                "se": "",
                "buy": "626880",
                "sell": "29840"
            },
            {
                "name": "狂熱之刃 (アーネストエッジ)",
                "attr": "-",
                "atk": "301",
                "sp": "魔攻+100",
                "se": "容易使出會心一擊，給予對方致命一擊",
                "buy": "704940",
                "sell": "31940"
            },
            {
                "name": "雙正義之刃 (ツインジャスティス)",
                "attr": "-",
                "atk": "322",
                "sp": "魔攻+160",
                "se": "",
                "buy": "947260",
                "sell": "41950"
            }
        ]
    },
    {
        "category": "雙手劍(両手剣)",
        "tab": "twosword",
        "list": [
            {
                "name": "雙手劍 (クレイモア)",
                "attr": "-",
                "atk": "11",
                "sp": "-",
                "se": "",
                "buy": "960",
                "sell": "190"
            },
            {
                "name": "雙手大劍 (ツーハンドソード)",
                "attr": "-",
                "atk": "22",
                "sp": "-",
                "se": "",
                "buy": "1800",
                "sell": "460"
            },
            {
                "name": "雙手大劍改 (ツーハンドソード改)",
                "attr": "-",
                "atk": "36",
                "sp": "魔攻+5",
                "se": "",
                "buy": "3020",
                "sell": "840"
            },
            {
                "name": "改良長劍 (グレートソード)",
                "attr": "-",
                "atk": "52",
                "sp": "-",
                "se": "",
                "buy": "4270",
                "sell": "1010"
            },
            {
                "name": "裂海者 (シーカッター)",
                "attr": "水",
                "atk": "58",
                "sp": "魔攻+25",
                "se": "",
                "buy": "4880",
                "sell": "1620"
            },
            {
                "name": "火焰之劍 (フレイムセイバー)",
                "attr": "火",
                "atk": "75",
                "sp": "魔攻+35",
                "se": "",
                "buy": "9120",
                "sell": "2520"
            },
            {
                "name": "旋風之劍 (サイクロンブレード)",
                "attr": "風",
                "atk": "83",
                "sp": "魔攻+40",
                "se": "",
                "buy": "10840",
                "sell": "2880"
            },
            {
                "name": "大魚 (デカッシュ)",
                "attr": "水",
                "atk": "76",
                "sp": "魔攻+72",
                "se": "",
                "buy": "11360",
                "sell": "4000"
            },
            {
                "name": "大地之影 (アースシェイド)",
                "attr": "地",
                "atk": "97",
                "sp": "-",
                "se": "",
                "buy": "11120",
                "sell": "3010"
            },
            {
                "name": "熔巖之刃 (ボルカノン)",
                "attr": "火",
                "atk": "110",
                "sp": "魔攻+50",
                "se": "",
                "buy": "12320",
                "sell": "3300"
            },
            {
                "name": "劇毒之刃 (ポイズンブレード)",
                "attr": "-",
                "atk": "124",
                "sp": "-",
                "se": "",
                "buy": "12940",
                "sell": "2880"
            },
            {
                "name": "大匕首 (ビッグナイフ)",
                "attr": "-",
                "atk": "139",
                "sp": "-",
                "se": "",
                "buy": "13720",
                "sell": "3520"
            },
            {
                "name": "波形劍 (フランベルジュ)",
                "attr": "-",
                "atk": "147",
                "sp": "-",
                "se": "",
                "buy": "19660",
                "sell": "3890"
            },
            {
                "name": "大蘿蔔 (ダーイコーン)",
                "attr": "地",
                "atk": "165",
                "sp": "魔攻+120",
                "se": "容易吹飛對方",
                "buy": "24240",
                "sell": "2110"
            },
            {
                "name": "波形劍改 (フランベルジュ改)",
                "attr": "-",
                "atk": "171",
                "sp": "-",
                "se": "",
                "buy": "21390",
                "sell": "4200"
            },
            {
                "name": "精神之刃 (サイコ)",
                "attr": "暗",
                "atk": "168",
                "sp": "魔攻+60",
                "se": "",
                "buy": "22320",
                "sell": "3460"
            },
            {
                "name": "冰雪之刃 (スノークラウン)",
                "attr": "水",
                "atk": "181",
                "sp": "魔攻+80",
                "se": "",
                "buy": "25420",
                "sell": "5000"
            },
            {
                "name": "太刀 (太刀)",
                "attr": "-",
                "atk": "192",
                "sp": "-",
                "se": "有時給予對方致命一擊",
                "buy": "26620",
                "sell": "6580"
            },
            {
                "name": "閃光之劍 (シャインブレード)",
                "attr": "火",
                "atk": "201",
                "sp": "魔攻+90",
                "se": "",
                "buy": "29290",
                "sell": "6600"
            },
            {
                "name": "輕便雙手劍 (カッツバルケル)",
                "attr": "-",
                "atk": "216",
                "sp": "-",
                "se": "",
                "buy": "33400",
                "sell": "4800"
            },
            {
                "name": "大地粉碎者 (グランドスマッシャー)",
                "attr": "地",
                "atk": "232",
                "sp": "魔攻+95",
                "se": "",
                "buy": "38280",
                "sell": "7230"
            },
            {
                "name": "生物粉碎者 (バイオスマッシャー)",
                "attr": "-",
                "atk": "243",
                "sp": "-",
                "se": "容易給予對方中毒效果",
                "buy": "40360",
                "sell": "7830"
            },
            {
                "name": "希伯萊 (ベルゼビュート)",
                "attr": "暗",
                "atk": "252",
                "sp": "魔攻+175",
                "se": "吸收對方HP，容易使出會心一擊",
                "buy": "44444",
                "sell": "8888"
            },
            {
                "name": "斬舞 (斬々舞)",
                "attr": "-",
                "atk": "265",
                "sp": "-",
                "se": "偶爾會給予對方致命一擊",
                "buy": "50760",
                "sell": "10890"
            },
            {
                "name": "大蛇 (オロチ)",
                "attr": "-",
                "atk": "272",
                "sp": "-",
                "se": "",
                "buy": "69000",
                "sell": "10090"
            },
            {
                "name": "斷罪者 (パニッシャー)",
                "attr": "-",
                "atk": "289",
                "sp": "-",
                "se": "",
                "buy": "78900",
                "sell": "14730"
            },
            {
                "name": "名刀之刃 (名刀達刃)",
                "attr": "-",
                "atk": "320",
                "sp": "-",
                "se": "",
                "buy": "99850",
                "sell": "17080"
            },
            {
                "name": "月影 (月影)",
                "attr": "-",
                "atk": "353",
                "sp": "魔攻+120",
                "se": "能夠給予對方致命一擊",
                "buy": "165600",
                "sell": "22000"
            },
            {
                "name": "巴爾蒙之劍 (バルムンク)",
                "attr": "-",
                "atk": "372",
                "sp": "-",
                "se": "",
                "buy": "282500",
                "sell": "23800"
            },
            {
                "name": "蒼眼太刀 (蒼眼ノ太刀)",
                "attr": "-",
                "atk": "393",
                "sp": "魔攻+125",
                "se": "",
                "buy": "492920",
                "sell": "24000"
            },
            {
                "name": "勇者心 (ブレイブハート)",
                "attr": "光",
                "atk": "412",
                "sp": "魔攻+120",
                "se": "",
                "buy": "500580",
                "sell": "28000"
            },
            {
                "name": "天叢云劍 (天ノ村雲ノ剣)",
                "attr": "風",
                "atk": "444",
                "sp": "魔攻+150",
                "se": "容易使出會心一擊，給予對方致命一擊",
                "buy": "822180",
                "sell": "31000"
            },
            {
                "name": "元素之刃 (フォースエレメント)",
                "attr": "光",
                "atk": "427",
                "sp": "魔攻+235 魔防+10",
                "se": "",
                "buy": "835000",
                "sell": "30000"
            },
            {
                "name": "石中劍 (カリバーン)",
                "attr": "地",
                "atk": "468",
                "sp": "魔攻+128",
                "se": "容易使對方氣絕",
                "buy": "925240",
                "sell": "38000"
            }
        ]
    },
    {
        "category": "槍(槍)",
        "tab": "longgun",
        "list": [
            {
                "name": "長槍 (スピア)",
                "attr": "-",
                "atk": "7",
                "sp": "防禦+2",
                "se": "",
                "buy": "900",
                "sell": "110"
            },
            {
                "name": "騎士長槍 (ランス)",
                "attr": "-",
                "atk": "14",
                "sp": "防禦+5",
                "se": "",
                "buy": "1480",
                "sell": "320"
            },
            {
                "name": "木棒 (こんぼう)",
                "attr": "-",
                "atk": "19",
                "sp": "防禦+8",
                "se": "",
                "buy": "3030",
                "sell": "750"
            },
            {
                "name": "騎士長槍改 (ランス改)",
                "attr": "-",
                "atk": "27",
                "sp": "防禦+10 魔攻+5",
                "se": "",
                "buy": "3850",
                "sell": "810"
            },
            {
                "name": "針槍 (ニードルスピア)",
                "attr": "-",
                "atk": "41",
                "sp": "防禦+8",
                "se": "",
                "buy": "4460",
                "sell": "900"
            },
            {
                "name": "水之槍 (ウォータースピア)",
                "attr": "水",
                "atk": "52",
                "sp": "魔攻+30 魔防+5",
                "se": "",
                "buy": "5770",
                "sell": "1010"
            },
            {
                "name": "斬斧 (ハルバード)",
                "attr": "-",
                "atk": "61",
                "sp": "防禦+12",
                "se": "",
                "buy": "7440",
                "sell": "1540"
            },
            {
                "name": "投擲叉子 (ピッチフォーク)",
                "attr": "-",
                "atk": "68",
                "sp": "防禦+18",
                "se": "",
                "buy": "8280",
                "sell": "780"
            },
            {
                "name": "三刃長槍 (コルセスカ)",
                "attr": "-",
                "atk": "79",
                "sp": "防禦+15",
                "se": "",
                "buy": "9080",
                "sell": "2680"
            },
            {
                "name": "劇毒長槍 (ポイズンスピア)",
                "attr": "-",
                "atk": "88",
                "sp": "防禦+5",
                "se": "",
                "buy": "9800",
                "sell": "2820"
            },
            {
                "name": "三刃長槍改 (コルセルカ改)",
                "attr": "-",
                "atk": "105",
                "sp": "防禦+20 魔攻+25",
                "se": "",
                "buy": "11000",
                "sell": "2800"
            },
            {
                "name": "看起來不痛的槍 (痛くなさそうな槍)",
                "attr": "-",
                "atk": "105",
                "sp": "防禦+25 魔攻+25",
                "se": "",
                "buy": "10560",
                "sell": "2000"
            },
            {
                "name": "重騎士槍 (ヘヴィランス)",
                "attr": "-",
                "atk": "113",
                "sp": "防禦+25",
                "se": "",
                "buy": "12700",
                "sell": "3160"
            },
            {
                "name": "魔法長槍 (マジカルランス)",
                "attr": "-",
                "atk": "123",
                "sp": "魔攻+120 魔防+15",
                "se": "",
                "buy": "16720",
                "sell": "7400"
            },
            {
                "name": "羽毛長槍 (フェザーランス)",
                "attr": "風",
                "atk": "129",
                "sp": "防禦+25 魔攻+60",
                "se": "",
                "buy": "20970",
                "sell": "5570"
            },
            {
                "name": "火焰長槍 (フレアランス)",
                "attr": "火",
                "atk": "140",
                "sp": "防禦+25 魔攻+70",
                "se": "",
                "buy": "21640",
                "sell": "5500"
            },
            {
                "name": "猛毒女王 (ポイズンクイーン)",
                "attr": "-",
                "atk": "148",
                "sp": "防禦+5",
                "se": "",
                "buy": "22850",
                "sell": "5800"
            },
            {
                "name": "伊賽貝克 (イセベルク)",
                "attr": "水",
                "atk": "159",
                "sp": "防禦+25 魔攻+80",
                "se": "",
                "buy": "25110",
                "sell": "6650"
            },
            {
                "name": "貫穿者 (ブリューナク)",
                "attr": "光",
                "atk": "172",
                "sp": "防禦+25 魔攻+85",
                "se": "",
                "buy": "27670",
                "sell": "6870"
            },
            {
                "name": "菠蘿棒 (パイナ棒)",
                "attr": "地",
                "atk": "160",
                "sp": "魔攻+80",
                "se": "容易令對手氣絕",
                "buy": "21840",
                "sell": "4450"
            },
            {
                "name": "五節棍 (五節昆)",
                "attr": "-",
                "atk": "180",
                "sp": "防禦+30",
                "se": "攻擊射程長",
                "buy": "31660",
                "sell": "7670"
            },
            {
                "name": "血之長槍 (ブラッドランス)",
                "attr": "暗",
                "atk": "192",
                "sp": "防禦+25 魔攻+120",
                "se": "",
                "buy": "36860",
                "sell": "7880"
            },
            {
                "name": "金箍棒 (如意棒)/如意棒",
                "attr": "地",
                "atk": "198",
                "sp": "防禦+25 魔攻+100",
                "se": "",
                "buy": "41400",
                "sell": "8970"
            },
            {
                "name": "三叉戟 (トライデント)",
                "attr": "-",
                "atk": "215",
                "sp": "防禦+30",
                "se": "",
                "buy": "52660",
                "sell": "12450"
            },
            {
                "name": "梅托斯 (メトゥス)",
                "attr": "暗",
                "atk": "235",
                "sp": "魔攻+130",
                "se": "",
                "buy": "125500",
                "sell": "13490"
            },
            {
                "name": "沉默墓碑 (サイレントグレイブ)",
                "attr": "-",
                "atk": "258",
                "sp": "防禦+35",
                "se": "攻擊時，附加封印效果",
                "buy": "170200",
                "sell": "14270"
            },
            {
                "name": "破壞之王 (オーバーブレイク)",
                "attr": "-",
                "atk": "287",
                "sp": "防禦+50 魔攻+120",
                "se": "",
                "buy": "270350",
                "sell": "15410"
            },
            {
                "name": "猛毒長槍 (ピオール)",
                "attr": "暗",
                "atk": "302",
                "sp": "防禦+25 魔攻+150",
                "se": "各種效果(毒、麻痹、病)",
                "buy": "322000",
                "sell": "17400"
            },
            {
                "name": "貝爾巴羅斯 (ベルヴァロース)",
                "attr": "-",
                "atk": "319",
                "sp": "防禦+60 魔攻+75",
                "se": "運用自如的話容易令對手氣絕",
                "buy": "399500",
                "sell": "19840"
            },
            {
                "name": "死翔槍 (ゲイボルグ)",
                "attr": "-",
                "atk": "335",
                "sp": "防禦+85 魔攻+120",
                "se": "",
                "buy": "502200",
                "sell": "20160"
            },
            {
                "name": "龍牙 (竜の牙)",
                "attr": "-",
                "atk": "347",
                "sp": "防禦+50 魔攻+140 魔防+50",
                "se": "容易使出會心一擊",
                "buy": "607840",
                "sell": "22050"
            },
            {
                "name": "奧丁神槍 (グングニル)",
                "attr": "風",
                "atk": "361",
                "sp": "防禦+75 魔攻+215",
                "se": "",
                "buy": "797300",
                "sell": "32500"
            },
            {
                "name": "刃靈 (レギオン)",
                "attr": "-",
                "atk": "380",
                "sp": "防禦+30 魔攻+180",
                "se": "",
                "buy": "920380",
                "sell": "37000"
            }
        ]
    },
    {
        "category": "斧(オノ)",
        "tab": "tomahawk",
        "list": [
            {
                "name": "戰斧 (バトルアックス)",
                "attr": "-",
                "atk": "10",
                "sp": "",
                "se": "",
                "buy": "1300",
                "sell": "280"
            },
            {
                "name": "戰鬥鐮刀 (バトルサイズ)",
                "attr": "-",
                "atk": "19",
                "sp": "",
                "se": "",
                "buy": "1800",
                "sell": "440"
            },
            {
                "name": "認真的破斧子 (本気なボロのオノ)",
                "attr": "-",
                "atk": "28",
                "sp": "魔攻+20",
                "se": "",
                "buy": "2100",
                "sell": "400"
            },
            {
                "name": "刺斧 (ポールアックス)",
                "attr": "-",
                "atk": "47",
                "sp": "",
                "se": "",
                "buy": "3750",
                "sell": "1530"
            },
            {
                "name": "刺斧改 (ポールアックス改)",
                "attr": "-",
                "atk": "63",
                "sp": "魔攻+15",
                "se": "",
                "buy": "7800",
                "sell": "3100"
            },
            {
                "name": "改良斧 (グレートアックス)",
                "attr": "-",
                "atk": "73",
                "sp": "",
                "se": "",
                "buy": "10000",
                "sell": "3300"
            },
            {
                "name": "毒蜥之牙 (バジリスクファング)",
                "attr": "-",
                "atk": "98",
                "sp": "",
                "se": "攻擊時，附加麻痹效果",
                "buy": "11940",
                "sell": "3440"
            },
            {
                "name": "砍斧 (トマホーク)",
                "attr": "風",
                "atk": "130",
                "sp": "魔攻+60",
                "se": "",
                "buy": "13060",
                "sell": "4100"
            },
            {
                "name": "月牙斧 (クレセントアックス)",
                "attr": "-",
                "atk": "143",
                "sp": "",
                "se": "",
                "buy": "14740",
                "sell": "4800"
            },
            {
                "name": "熾熱戰斧 (ヒートアックス)",
                "attr": "火",
                "atk": "157",
                "sp": "魔攻+75",
                "se": "",
                "buy": "24660",
                "sell": "6650"
            },
            {
                "name": "巖斧 (ロックアックス)",
                "attr": "地",
                "atk": "172",
                "sp": "魔攻+80",
                "se": "",
                "buy": "25800",
                "sell": "6850"
            },
            {
                "name": "月牙斧改 (クレセントアックス改)",
                "attr": "-",
                "atk": "212",
                "sp": "魔攻+50",
                "se": "",
                "buy": "35340",
                "sell": "7500"
            },
            {
                "name": "凍結戰斧 (フロストアックス)",
                "attr": "水",
                "atk": "224",
                "sp": "魔攻+95",
                "se": "",
                "buy": "38740",
                "sell": "7620"
            },
            {
                "name": "棒棒糖 (ぺろぺろキャンディー)",
                "attr": "-",
                "atk": "192",
                "sp": "體力+50",
                "se": "容易令對方氣絕",
                "buy": "32000",
                "sell": "7800"
            },
            {
                "name": "惡魔之斧 (デモンズアックス)",
                "attr": "暗",
                "atk": "240",
                "sp": "魔攻+110",
                "se": "",
                "buy": "49180",
                "sell": "10200"
            },
            {
                "name": "雙刃戰斧 (ダブルエッジ)",
                "attr": "-",
                "atk": "260",
                "sp": "",
                "se": "",
                "buy": "73200",
                "sell": "18360"
            },
            {
                "name": "奧魯迪爾 (オールデール)",
                "attr": "-",
                "atk": "302",
                "sp": "",
                "se": "",
                "buy": "135000",
                "sell": "17000"
            },
            {
                "name": "惡魔手指 (デビルフィンガー)",
                "attr": "-",
                "atk": "351",
                "sp": "魔攻+150",
                "se": "",
                "buy": "434450",
                "sell": "18400"
            },
            {
                "name": "劊子手 (エクスキューショナー)",
                "attr": "暗",
                "atk": "388",
                "sp": "魔攻+180",
                "se": "",
                "buy": "651860",
                "sell": "29900"
            },
            {
                "name": "聖斧 (セイントアックス)",
                "attr": "光",
                "atk": "438",
                "sp": "魔攻+225",
                "se": "",
                "buy": "1019720",
                "sell": "32570"
            }
        ]
    },
    {
        "category": "錘(ハンマー)",
        "tab": "warhammer",
        "list": [
            {
                "name": "戰鬥錘 (バトルハンマー)",
                "attr": "-",
                "atk": "10",
                "sp": "",
                "se": "",
                "buy": "1400",
                "sell": "380"
            },
            {
                "name": "球棒 (カッキーン)",
                "attr": "-",
                "atk": "36",
                "sp": "",
                "se": "容易垂飛對手",
                "buy": "2750",
                "sell": "410"
            },
            {
                "name": "重錘 (ウォーハンマー)",
                "attr": "-",
                "atk": "46",
                "sp": "",
                "se": "",
                "buy": "3720",
                "sell": "1680"
            },
            {
                "name": "力石 (力石)",
                "attr": "-",
                "atk": "58",
                "sp": "",
                "se": "",
                "buy": "5210",
                "sell": "2120"
            },
            {
                "name": "重錘改 (ウォーハンマー改)",
                "attr": "-",
                "atk": "62",
                "sp": "魔攻+15",
                "se": "",
                "buy": "7600",
                "sell": "3000"
            },
            {
                "name": "改良錘 (グレートハンマー)",
                "attr": "-",
                "atk": "82",
                "sp": "",
                "se": "",
                "buy": "11500",
                "sell": "3420"
            },
            {
                "name": "金屬球棒 (アイアンカッキーン)",
                "attr": "-",
                "atk": "110",
                "sp": "",
                "se": "",
                "buy": "12460",
                "sell": "3840"
            },
            {
                "name": "覺醒的破錘子 (目覚めたボロハンマー)",
                "attr": "-",
                "atk": "140",
                "sp": "魔攻+90",
                "se": "",
                "buy": "18600",
                "sell": "4800"
            },
            {
                "name": "火之錘 (フレイムハンマー)",
                "attr": "-",
                "atk": "153",
                "sp": "魔攻+70",
                "se": "",
                "buy": "21360",
                "sell": "4970"
            },
            {
                "name": "玩具錘 (ピコピコハンマー)",
                "attr": "-",
                "atk": "80",
                "sp": "魔攻+160",
                "se": "非常容易令對手氣絕",
                "buy": "25200",
                "sell": "1530"
            },
            {
                "name": "天空錘 (スカイハンマー)",
                "attr": "風",
                "atk": "179",
                "sp": "魔攻+90",
                "se": "",
                "buy": "26360",
                "sell": "7370"
            },
            {
                "name": "巨錘 (ギガントハンマー)",
                "attr": "-",
                "atk": "204",
                "sp": "",
                "se": "",
                "buy": "28870",
                "sell": "7420"
            },
            {
                "name": "冰之錘 (アイスハンマー)",
                "attr": "水",
                "atk": "226",
                "sp": "魔攻+100",
                "se": "",
                "buy": "39700",
                "sell": "9570"
            },
            {
                "name": "骨錘 (ボーンハンマー)",
                "attr": "暗",
                "atk": "232",
                "sp": "魔攻+105",
                "se": "",
                "buy": "44420",
                "sell": "9930"
            },
            {
                "name": "大地之錘 (グラヴィトンハンマー)",
                "attr": "地",
                "atk": "243",
                "sp": "魔攻+120",
                "se": "",
                "buy": "59440",
                "sell": "11130"
            },
            {
                "name": "輕錘 (シュナーベル)",
                "attr": "-",
                "atk": "255",
                "sp": "",
                "se": "",
                "buy": "62000",
                "sell": "18000"
            },
            {
                "name": "尖刺鐵錘 (スパイクハンマー)",
                "attr": "-",
                "atk": "276",
                "sp": "",
                "se": "",
                "buy": "87600",
                "sell": "13560"
            },
            {
                "name": "水晶錘 (クリスタルハンマー)",
                "attr": "水",
                "atk": "290",
                "sp": "魔攻+130",
                "se": "",
                "buy": "99900",
                "sell": "16620"
            },
            {
                "name": "巨錘改 (ギガントハンマー改)",
                "attr": "-",
                "atk": "320",
                "sp": "魔攻+75",
                "se": "",
                "buy": "176000",
                "sell": "12000"
            },
            {
                "name": "金剛 (金剛)",
                "attr": "-",
                "atk": "368",
                "sp": "",
                "se": "攻擊範圍廣",
                "buy": "503600",
                "sell": "28770"
            },
            {
                "name": "粉碎之錘 (ミョルニル)",
                "attr": "地",
                "atk": "399",
                "sp": "魔攻+190",
                "se": "",
                "buy": "706420",
                "sell": "29800"
            },
            {
                "name": "命運粉碎者 (フェイタルクラッシュ)",
                "attr": "-",
                "atk": "425",
                "sp": "魔攻+150",
                "se": "容易使出會心一擊，攻擊範圍廣",
                "buy": "816300",
                "sell": "30330"
            },
            {
                "name": "飛濺之星 (スプラッシュスター)",
                "attr": "光",
                "atk": "448",
                "sp": "魔攻+220",
                "se": "",
                "buy": "1210980",
                "sell": "34980"
            }
        ]
    },
    {
        "category": "法杖(杖)",
        "tab": "staff",
        "list": [
            {
                "name": "法杖 (ロッド)",
                "attr": "火",
                "atk": "-",
                "matk": "18",
                "sp": "",
                "buy": "1080",
                "sell": "390"
            },
            {
                "name": "魔法杖 (スタッフ)",
                "attr": "地",
                "atk": "6",
                "matk": "32",
                "sp": "",
                "buy": "3580",
                "sell": "1120"
            },
            {
                "name": "冰之杖 (アイスロッド)",
                "attr": "水",
                "atk": "7",
                "matk": "60",
                "sp": "",
                "buy": "8000",
                "sell": "2800"
            },
            {
                "name": "雷霆法杖 (ライトニングワンド)",
                "attr": "風",
                "atk": "14",
                "matk": "88",
                "sp": "",
                "buy": "13200",
                "sell": "3200"
            },
            {
                "name": "火之杖 (フレアロッド)",
                "attr": "火",
                "atk": "21",
                "matk": "112",
                "sp": "",
                "buy": "29800",
                "sell": "4920"
            },
            {
                "name": "籃子 (バスケット)",
                "attr": "地",
                "atk": "50",
                "matk": "102",
                "sp": "體力+20",
                "buy": "19800",
                "sell": "2780"
            },
            {
                "name": "銀仗 (シルバーロッド)",
                "attr": "暗",
                "atk": "38",
                "matk": "138",
                "sp": "",
                "buy": "35260",
                "sell": "5100"
            },
            {
                "name": "大地法杖 (アースワンド)",
                "attr": "地",
                "atk": "48",
                "matk": "176",
                "sp": "",
                "buy": "44500",
                "sell": "5400"
            },
            {
                "name": "賢者之仗 (ウィザードスタッフ)",
                "attr": "光",
                "atk": "62",
                "matk": "205",
                "sp": "",
                "buy": "61560",
                "sell": "12440"
            },
            {
                "name": "魔術手杖 (マジックステッキ)",
                "attr": "地",
                "atk": "89",
                "matk": "232",
                "sp": "",
                "buy": "73720",
                "sell": "13780"
            },
            {
                "name": "魔法注射器 (魔法の注射器)",
                "attr": "火",
                "atk": "198",
                "matk": "150",
                "sp": "魔防+50",
                "buy": "82400",
                "sell": "14700"
            },
            {
                "name": "符文之仗 (ルーンスタッフ)",
                "attr": "光",
                "atk": "93",
                "matk": "270",
                "sp": "",
                "buy": "90060",
                "sell": "18010"
            },
            {
                "name": "魔法手杖 (マジカルステッキ)",
                "attr": "暗",
                "atk": "125",
                "matk": "301",
                "sp": "體力+60",
                "buy": "577100",
                "sell": "28000"
            },
            {
                "name": "魔法掃帚 (魔法のほうき)",
                "attr": "風",
                "atk": "174",
                "matk": "340",
                "sp": "",
                "buy": "986500",
                "sell": "41890"
            }
        ]
    }
];
const weaponRec = [
    {
        "category": "單手劍(片手剣)",
        "tab": "sword",
        "active": true,
        "list": [
            {
                "name": "長劍 (ブロードソード)",
                "skillLv": "4",
                "item1": "鐵",
                "item2": "",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "鐵劍 (スティールソード)",
                "skillLv": "8",
                "item1": "長劍",
                "item2": "鐵",
                "item3": "鐵",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "鐵劍改 (スティールソード改)",
                "skillLv": "12",
                "item1": "鐵劍",
                "item2": "鐵",
                "item3": "鐵",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "彎刀 (カトラス)",
                "skillLv": "16",
                "item1": "長劍",
                "item2": "銅",
                "item3": "哥布林海盜的布",
                "item4": "哥布林海盜的布",
                "item5": "",
                "item6": ""
            },
            {
                "name": "瘙癢撓 (まごの手)",
                "skillLv": "20",
                "item1": "樹枝",
                "item2": "",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "水之劍 (アクアソード)",
                "skillLv": "22",
                "item1": "長劍",
                "item2": "銅",
                "item3": "哥布林海盜的布",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "風之劍 (ウインドソード)",
                "skillLv": "26",
                "item1": "長劍",
                "item2": "鐵",
                "item3": "蝎子的鉗子",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "防禦之劍 (ディフェンダー)",
                "skillLv": "29",
                "item1": "長劍",
                "item2": "銅",
                "item3": "銅",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "燃燒之劍 (バーニングソード)",
                "skillLv": "30",
                "item1": "長劍",
                "item2": "銀",
                "item3": "生鏽的箭頭",
                "item4": "火之結晶",
                "item5": "",
                "item6": ""
            },
            {
                "name": "大地之劍 (ガイアソード)",
                "skillLv": "31",
                "item1": "長劍",
                "item2": "銀",
                "item3": "地之結晶",
                "item4": "錘子的碎片",
                "item5": "",
                "item6": ""
            },
            {
                "name": "勺子 (スプーン)",
                "skillLv": "34",
                "item1": "鐵",
                "item2": "漂亮的蜘蛛絲",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "紅櫻 (紅桜)",
                "skillLv": "36",
                "item1": "長劍",
                "item2": "銀",
                "item3": "蘑菇孢子",
                "item4": "蝎子的尾巴",
                "item5": "蘑菇孢子",
                "item6": ""
            },
            {
                "name": "幸運之劍 (ラックブレード)",
                "skillLv": "41",
                "item1": "長劍",
                "item2": "金",
                "item3": "蝎子的鉗子",
                "item4": "豹爪",
                "item5": "",
                "item6": ""
            },
            {
                "name": "空舞之劍 (エリアルブレード)",
                "skillLv": "44",
                "item1": "長劍",
                "item2": "金",
                "item3": "風之結晶",
                "item4": "鳥之羽",
                "item5": "",
                "item6": ""
            },
            {
                "name": "太陽劍 (サンスパーダ)",
                "skillLv": "48",
                "item1": "長劍",
                "item2": "鐵",
                "item3": "金",
                "item4": "射手的火藥",
                "item5": "射手的火藥",
                "item6": ""
            },
            {
                "name": "迪蘭達爾 (デュランダル)",
                "skillLv": "51",
                "item1": "長劍",
                "item2": "白金",
                "item3": "戰士之證",
                "item4": "戰士之證",
                "item5": "哥布林的繃帶",
                "item6": "貍貓樹葉"
            },
            {
                "name": "格蘭蒂爾 (グランテール)",
                "skillLv": "55",
                "item1": "長劍",
                "item2": "白金",
                "item3": "戰士之證",
                "item4": "戰士之證",
                "item5": "",
                "item6": ""
            },
            {
                "name": "蔬菜劍 (ベジタブレード)",
                "skillLv": "58",
                "item1": "胡蘿蔔",
                "item2": "",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "致命之劍 (スマッシュブレード)",
                "skillLv": "59",
                "item1": "長劍",
                "item2": "銀",
                "item3": "銀",
                "item4": "銀",
                "item5": "",
                "item6": ""
            },
            {
                "name": "混沌之劍 (カオスブレード)",
                "skillLv": "61",
                "item1": "長劍",
                "item2": "蝎子的尾巴",
                "item3": "金",
                "item4": "植物莖",
                "item5": "維京護肩",
                "item6": ""
            },
            {
                "name": "死亡之劍 (デスジュラード)",
                "skillLv": "65",
                "item1": "長劍",
                "item2": "白金",
                "item3": "水之結晶",
                "item4": "龜殼",
                "item5": "龜殼",
                "item6": ""
            },
            {
                "name": "星辰之劍 (スターセイバー)",
                "skillLv": "68",
                "item1": "長劍",
                "item2": "白金",
                "item3": "風之結晶",
                "item4": "豹爪",
                "item5": "鳥之羽",
                "item6": ""
            },
            {
                "name": "奪魂者 (ソウルイーター)",
                "skillLv": "70",
                "item1": "長劍",
                "item2": "白金",
                "item3": "綠寶石",
                "item4": "植物根",
                "item5": "幽浮霊的頭巾",
                "item6": ""
            },
            {
                "name": "豪華之劍 (ゴージャスソード)",
                "skillLv": "74",
                "item1": "長劍",
                "item2": "銀",
                "item3": "銀",
                "item4": "金",
                "item5": "金",
                "item6": "白金"
            },
            {
                "name": "蛇劍 (スネークソード)",
                "skillLv": "77",
                "item1": "長劍",
                "item2": "金",
                "item3": "植物根",
                "item4": "維京護肩",
                "item5": "絲綢",
                "item6": ""
            },
            {
                "name": "災難之劍 (レーヴァンテイン)",
                "skillLv": "79",
                "item1": "長劍",
                "item2": "金",
                "item3": "火之結晶",
                "item4": "魔力結晶",
                "item5": "魔力結晶",
                "item6": "獅子的紅毛"
            },
            {
                "name": "龍劍 (ドラグスレイヤー)",
                "skillLv": "82",
                "item1": "長劍",
                "item2": "白金",
                "item3": "豹爪",
                "item4": "鬥牛之角",
                "item5": "狼牙",
                "item6": ""
            },
            {
                "name": "白金之劍 (プラチナソード)",
                "skillLv": "85",
                "item1": "長劍",
                "item2": "銀",
                "item3": "白金",
                "item4": "白金",
                "item5": "昆蟲下顎",
                "item6": "魔人之角"
            },
            {
                "name": "白金之劍改 (プラチナソード改)",
                "skillLv": "88",
                "item1": "白金之劍",
                "item2": "銀",
                "item3": "白金",
                "item4": "白金",
                "item5": "昆蟲下顎",
                "item6": "魔人之角"
            },
            {
                "name": "隱形之劍 (インビジブレード)",
                "skillLv": "90",
                "item1": "長劍",
                "item2": "銅錘子",
                "item3": "火之結晶",
                "item4": "水之結晶",
                "item5": "地之結晶",
                "item6": "風之結晶"
            },
            {
                "name": "符文之劍 (ルーンブレード)",
                "skillLv": "92",
                "item1": "長劍",
                "item2": "白金",
                "item3": "白金",
                "item4": "白金",
                "item5": "鑽石",
                "item6": "妖精之粉"
            },
            {
                "name": "格拉迪烏斯 (グラディウス)",
                "skillLv": "95",
                "item1": "長劍",
                "item2": "龍牙",
                "item3": "白金",
                "item4": "鑽石",
                "item5": "壞掉的柄",
                "item6": "壞掉的柄"
            },
            {
                "name": "符文傳說 (レジェンドオブルーン)",
                "skillLv": "99",
                "item1": "長劍",
                "item2": "鑽石",
                "item3": "鑽石",
                "item4": "龍牙",
                "item5": "龍牙",
                "item6": "妖精之粉"
            }
        ]
    },
    {
        "category": "雙劍(雙剣)",
        "tab": "doublesword",
        "list": [
            {
                "name": "短劍 (ショート)",
                "skillLv": "5",
                "item1": "鐵",
                "item2": "鐵",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "鋼鐵雙刃 (スティールエッジ)",
                "skillLv": "9",
                "item1": "短劍",
                "item2": "鐵",
                "item3": "鐵",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "鋼鐵之刃 (アイアンエッジ)",
                "skillLv": "13",
                "item1": "鋼鐵雙刃",
                "item2": "鐵",
                "item3": "鐵",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "盜賊匕首 (シーフナイフ)",
                "skillLv": "16",
                "item1": "短劍",
                "item2": "銅",
                "item3": "海盜哥布林的布",
                "item4": "海盜哥布林的布",
                "item5": "",
                "item6": ""
            },
            {
                "name": "冰之刃 (フロストエッジ)",
                "skillLv": "21",
                "item1": "短劍",
                "item2": "銅",
                "item3": "海盜哥布林的布",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "雙瘙癢撓 (ダブルまごの手)",
                "skillLv": "24",
                "item1": "樹枝",
                "item2": "樹枝",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "斬鋼刃 (斬鋼刃)",
                "skillLv": "25",
                "item1": "短劍",
                "item2": "銅",
                "item3": "銅",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "風之刃 (ウィンドエッジ)",
                "skillLv": "28",
                "item1": "短劍",
                "item2": "鐵",
                "item3": "蝎子的鉗子",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "毀滅之墻 (ブロークンウォール)",
                "skillLv": "30",
                "item1": "短劍",
                "item2": "銀",
                "item3": "地之結晶",
                "item4": "錘子的碎片",
                "item5": "",
                "item6": ""
            },
            {
                "name": "蠑螈雙劍 (サラマンダー)",
                "skillLv": "32",
                "item1": "短劍",
                "item2": "金",
                "item3": "生鏽的箭頭",
                "item4": "火之結晶",
                "item5": "",
                "item6": ""
            },
            {
                "name": "雙勺 (アクトリマッセ)",
                "skillLv": "33",
                "item1": "鐵",
                "item2": "鐵",
                "item3": "漂亮的蜘蛛絲",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "狂暴雙刃 (ランペイジ)",
                "skillLv": "35",
                "item1": "短劍",
                "item2": "金",
                "item3": "蝎子的鉗子",
                "item4": "豹爪",
                "item5": "",
                "item6": ""
            },
            {
                "name": "音速短劍 (ソニックダガー)",
                "skillLv": "36",
                "item1": "短劍",
                "item2": "銀",
                "item3": "風之結晶",
                "item4": "鳥之羽",
                "item5": "",
                "item6": ""
            },
            {
                "name": "甜美之風 (デザートウィンド)",
                "skillLv": "37",
                "item1": "短劍",
                "item2": "地之結晶",
                "item3": "風之結晶",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "雙蔥 (ツインネッギ)",
                "skillLv": "39",
                "item1": "大蔥",
                "item2": "大蔥",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "雙鬼丸 (雙鬼丸)",
                "skillLv": "42",
                "item1": "短劍",
                "item2": "銀",
                "item3": "蘑菇孢子",
                "item4": "蘑菇孢子",
                "item5": "蝎子的尾巴",
                "item6": ""
            },
            {
                "name": "火焰心 (ハートオブファイア)",
                "skillLv": "45",
                "item1": "短劍",
                "item2": "鐵",
                "item3": "金",
                "item4": "射手的火藥",
                "item5": "射手的火藥",
                "item6": ""
            },
            {
                "name": "原力分割 (フォースディバイド)",
                "skillLv": "49",
                "item1": "短劍",
                "item2": "銀",
                "item3": "火之結晶",
                "item4": "水之結晶",
                "item5": "",
                "item6": ""
            },
            {
                "name": "冥王之劍 (オルクスソード)",
                "skillLv": "52",
                "item1": "短劍",
                "item2": "白金",
                "item3": "戰士之證",
                "item4": "戰士之證",
                "item5": "",
                "item6": ""
            },
            {
                "name": "暴風雪 (ディープブリザード)",
                "skillLv": "56",
                "item1": "短劍",
                "item2": "白金",
                "item3": "水之結晶",
                "item4": "龜殼",
                "item5": "龜殼",
                "item6": ""
            },
            {
                "name": "混沌之刃 (カオスエッジ)",
                "skillLv": "65",
                "item1": "短劍",
                "item2": "金",
                "item3": "植物莖",
                "item4": "蝎子的尾巴",
                "item5": "維京護肩",
                "item6": ""
            },
            {
                "name": "噬魂者 (インバイトダクネス)",
                "skillLv": "68",
                "item1": "短劍",
                "item2": "白金",
                "item3": "綠寶石",
                "item4": "植物根",
                "item5": "浮游靈的頭巾",
                "item6": ""
            },
            {
                "name": "聖職之劍 (プリーストセイバー)",
                "skillLv": "72",
                "item1": "短劍",
                "item2": "白金",
                "item3": "戰士之證",
                "item4": "戰士之證",
                "item5": "哥布林繃帶",
                "item6": "貍貓樹葉"
            },
            {
                "name": "巨豪華之劍 (ベリーゴージャス)",
                "skillLv": "74",
                "item1": "豪華之劍",
                "item2": "豪華之劍",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "火焰暴君 (イフリート)",
                "skillLv": "76",
                "item1": "短劍",
                "item2": "金",
                "item3": "火之結晶",
                "item4": "魔力結晶",
                "item5": "魔力結晶",
                "item6": "獅子的紅毛"
            },
            {
                "name": "龍爪 (ドラグーンクロー)",
                "skillLv": "82",
                "item1": "短劍",
                "item2": "白金",
                "item3": "豹爪",
                "item4": "狼牙",
                "item5": "鬥牛之角",
                "item6": ""
            },
            {
                "name": "白金雙刃 (プラチナエッジ)",
                "skillLv": "87",
                "item1": "短劍",
                "item2": "銀",
                "item3": "白金",
                "item4": "白金",
                "item5": "昆蟲的下顎",
                "item6": "魔人之角"
            },
            {
                "name": "綠寶石之刃 (エメラルドエッジ)",
                "skillLv": "90",
                "item1": "白金雙刃",
                "item2": "銀",
                "item3": "綠寶石",
                "item4": "綠寶石",
                "item5": "昆蟲的下顎",
                "item6": "魔人之角"
            },
            {
                "name": "符文之刃 (ルーンエッジ)",
                "skillLv": "94",
                "item1": "短劍",
                "item2": "白金",
                "item3": "白金",
                "item4": "白金",
                "item5": "鑽石",
                "item6": "妖精之粉"
            },
            {
                "name": "狂熱之刃 (アーネストエッジ)",
                "skillLv": "95",
                "item1": "短劍",
                "item2": "白金",
                "item3": "鑽石",
                "item4": "龍牙",
                "item5": "壞掉的柄",
                "item6": "壞掉的柄"
            },
            {
                "name": "雙正義之刃 (ツインジャスティス)",
                "skillLv": "98",
                "item1": "短劍",
                "item2": "鑽石",
                "item3": "鑽石",
                "item4": "龍牙",
                "item5": "龍牙",
                "item6": "水龍的羽鰭"
            }
        ]
    },
    {
        "category": "雙手劍(両手剣)",
        "tab": "twosword",
        "list": [
            {
                "name": "雙手劍 (クレイモア)",
                "skillLv": "5",
                "item1": "鐵",
                "item2": "鐵",
                "item3": "鐵",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "雙手大劍 (ツーハンドソード)",
                "skillLv": "8",
                "item1": "雙手劍",
                "item2": "鐵",
                "item3": "鐵",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "雙手大劍改 (ツーハンドソード改)",
                "skillLv": "15",
                "item1": "雙手大劍",
                "item2": "鐵",
                "item3": "鐵",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "改良長劍 (グレートソード)",
                "skillLv": "18",
                "item1": "雙手劍",
                "item2": "鐵",
                "item3": "鐵",
                "item4": "銅",
                "item5": "",
                "item6": ""
            },
            {
                "name": "裂海者 (シーカッター)",
                "skillLv": "21",
                "item1": "雙手劍",
                "item2": "鐵",
                "item3": "海盜哥布林的布",
                "item4": "巨人之爪",
                "item5": "",
                "item6": ""
            },
            {
                "name": "火焰之劍 (フレイムセイバー)",
                "skillLv": "25",
                "item1": "雙手劍",
                "item2": "銅",
                "item3": "銀",
                "item4": "火之結晶",
                "item5": "",
                "item6": ""
            },
            {
                "name": "旋風之劍 (サイクロンブレード)",
                "skillLv": "27",
                "item1": "雙手劍",
                "item2": "銀",
                "item3": "銀",
                "item4": "豹爪",
                "item5": "",
                "item6": ""
            },
            {
                "name": "大魚 (デカッシュ)",
                "skillLv": "29",
                "item1": "金槍魚",
                "item2": "",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "大地之影 (アースシェイド)",
                "skillLv": "30",
                "item1": "雙手劍",
                "item2": "銀",
                "item3": "結實的藤",
                "item4": "結實的藤",
                "item5": "",
                "item6": ""
            },
            {
                "name": "熔巖之刃 (ボルカノン)",
                "skillLv": "32",
                "item1": "雙手劍",
                "item2": "銀",
                "item3": "射手的火藥",
                "item4": "射手的火藥",
                "item5": "",
                "item6": ""
            },
            {
                "name": "劇毒之刃 (ポイズンブレード)",
                "skillLv": "35",
                "item1": "雙手劍",
                "item2": "銀",
                "item3": "蘑菇孢子",
                "item4": "骨膠",
                "item5": "",
                "item6": ""
            },
            {
                "name": "大匕首 (ビッグナイフ)",
                "skillLv": "36",
                "item1": "雙手劍",
                "item2": "古代魚之骨",
                "item3": "古代魚之骨",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "波形劍 (フランベルジュ)",
                "skillLv": "37",
                "item1": "雙手劍",
                "item2": "銀",
                "item3": "銀",
                "item4": "鬥牛之角",
                "item5": "",
                "item6": ""
            },
            {
                "name": "大蘿蔔 (ダーイコーン)",
                "skillLv": "42",
                "item1": "蘿蔔",
                "item2": "",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "波形劍改 (フランベルジュ改)",
                "skillLv": "43",
                "item1": "波形劍",
                "item2": "金",
                "item3": "金",
                "item4": "鬥牛之角",
                "item5": "",
                "item6": ""
            },
            {
                "name": "精神之刃 (サイコ)",
                "skillLv": "45",
                "item1": "雙手劍",
                "item2": "鬥牛之角",
                "item3": "鬥牛之角",
                "item4": "鬥牛之角",
                "item5": "",
                "item6": ""
            },
            {
                "name": "冰雪之刃 (スノークラウン)",
                "skillLv": "46",
                "item1": "雙手劍",
                "item2": "金",
                "item3": "水之結晶",
                "item4": "水之結晶",
                "item5": "",
                "item6": ""
            },
            {
                "name": "太刀 (太刀)",
                "skillLv": "48",
                "item1": "雙手劍",
                "item2": "銀",
                "item3": "銀",
                "item4": "銀",
                "item5": "金",
                "item6": ""
            },
            {
                "name": "閃光之劍 (シャインブレード)",
                "skillLv": "50",
                "item1": "雙手劍",
                "item2": "金",
                "item3": "射手的火藥",
                "item4": "火之結晶",
                "item5": "",
                "item6": ""
            },
            {
                "name": "輕便雙手劍 (カッツバルケル)",
                "skillLv": "52",
                "item1": "雙手劍",
                "item2": "銀",
                "item3": "銀",
                "item4": "金",
                "item5": "金",
                "item6": ""
            },
            {
                "name": "大地粉碎者 (グランドスマッシャー)",
                "skillLv": "55",
                "item1": "雙手劍",
                "item2": "金",
                "item3": "地之結晶",
                "item4": "狼牙",
                "item5": "狼牙",
                "item6": ""
            },
            {
                "name": "生物粉碎者 (バイオスマッシャー)",
                "skillLv": "58",
                "item1": "雙手劍",
                "item2": "金",
                "item3": "巨人之爪",
                "item4": "毒粉",
                "item5": "蟲皮",
                "item6": "劇毒之刃"
            },
            {
                "name": "希伯萊 (ベルゼビュート)",
                "skillLv": "63",
                "item1": "雙手劍",
                "item2": "小結晶",
                "item3": "小結晶",
                "item4": "魔力結晶",
                "item5": "",
                "item6": ""
            },
            {
                "name": "斬舞 (斬々舞)",
                "skillLv": "68",
                "item1": "雙手劍",
                "item2": "銀",
                "item3": "金",
                "item4": "白金",
                "item5": "狼牙",
                "item6": ""
            },
            {
                "name": "大蛇 (オロチ)",
                "skillLv": "73",
                "item1": "雙手劍",
                "item2": "植物根",
                "item3": "維京護肩",
                "item4": "狼牙",
                "item5": "狼牙",
                "item6": "狼牙"
            },
            {
                "name": "斷罪者 (パニッシャー)",
                "skillLv": "76",
                "item1": "雙手劍",
                "item2": "金",
                "item3": "白金",
                "item4": "古代魚之骨",
                "item5": "浮游靈的頭巾",
                "item6": ""
            },
            {
                "name": "名刀之刃 (名刀達刃)",
                "skillLv": "82",
                "item1": "雙手劍",
                "item2": "白金",
                "item3": "白金",
                "item4": "浮游靈的頭巾",
                "item5": "小結晶",
                "item6": "妖精之粉"
            },
            {
                "name": "月影 (月影)",
                "skillLv": "84",
                "item1": "雙手劍",
                "item2": "銀",
                "item3": "銀",
                "item4": "銀",
                "item5": "銀",
                "item6": "銀"
            },
            {
                "name": "巴爾蒙之劍 (バルムンク)",
                "skillLv": "89",
                "item1": "雙手劍",
                "item2": "銀",
                "item3": "金",
                "item4": "白金",
                "item5": "白金",
                "item6": "龍骨"
            },
            {
                "name": "蒼眼太刀 (蒼眼ノ太刀)",
                "skillLv": "89",
                "item1": "雙手劍",
                "item2": "白金",
                "item3": "狼牙",
                "item4": "狼牙",
                "item5": "骷髏",
                "item6": "上質的毛皮"
            },
            {
                "name": "勇者心 (ブレイブハート)",
                "skillLv": "92",
                "item1": "雙手劍",
                "item2": "白金",
                "item3": "鑽石",
                "item4": "小結晶",
                "item5": "妖精之粉",
                "item6": "妖精之粉"
            },
            {
                "name": "天叢云劍 (天ノ村雲ノ剣)",
                "skillLv": "94",
                "item1": "雙手劍",
                "item2": "金",
                "item3": "白金",
                "item4": "白金",
                "item5": "絲綢",
                "item6": "魔人之角"
            },
            {
                "name": "元素之刃 (フォースエレメント)",
                "skillLv": "95",
                "item1": "雙手劍",
                "item2": "白金",
                "item3": "白金",
                "item4": "光之結晶",
                "item5": "光之結晶",
                "item6": "光之結晶"
            },
            {
                "name": "石中劍 (カリバーン)",
                "skillLv": "98",
                "item1": "雙手劍",
                "item2": "金",
                "item3": "白金",
                "item4": "鑽石",
                "item5": "龍牙",
                "item6": "水龍的羽鰭"
            }
        ]
    },
    {
        "category": "槍(槍)",
        "tab": "longgun",
        "list": [
            {
                "name": "長槍 (スピア)",
                "skillLv": "6",
                "item1": "鐵",
                "item2": "木材",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "騎士長槍 (ランス)",
                "skillLv": "8",
                "item1": "長槍",
                "item2": "鐵",
                "item3": "鐵",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "木棒 (こんぼう)",
                "skillLv": "14",
                "item1": "木材",
                "item2": "木材",
                "item3": "結實的藤",
                "item4": "結實的藤",
                "item5": "",
                "item6": ""
            },
            {
                "name": "騎士長槍改 (ランス改)",
                "skillLv": "17",
                "item1": "騎士長槍",
                "item2": "銅",
                "item3": "銅",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "針槍 (ニードルスピア)",
                "skillLv": "20",
                "item1": "長槍",
                "item2": "銅",
                "item3": "豹爪",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "水之槍 (ウォータースピア)",
                "skillLv": "21",
                "item1": "長槍",
                "item2": "銅",
                "item3": "銅",
                "item4": "海盜哥布林的布",
                "item5": "",
                "item6": ""
            },
            {
                "name": "斬斧 (ハルバード)",
                "skillLv": "23",
                "item1": "長槍",
                "item2": "鐵",
                "item3": "鐵",
                "item4": "銀",
                "item5": "",
                "item6": ""
            },
            {
                "name": "投擲叉子 (ピッチフォーク)",
                "skillLv": "25",
                "item1": "長槍",
                "item2": "牧草",
                "item3": "牧草",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "三刃長槍 (コルセスカ)",
                "skillLv": "27",
                "item1": "長槍",
                "item2": "銀",
                "item3": "銀",
                "item4": "鬥牛之角",
                "item5": "",
                "item6": ""
            },
            {
                "name": "劇毒長槍 (ポイズンスピア)",
                "skillLv": "29",
                "item1": "長槍",
                "item2": "銀",
                "item3": "蘑菇孢子",
                "item4": "骨膠",
                "item5": "",
                "item6": ""
            },
            {
                "name": "三刃長槍改 (コルセルカ改)",
                "skillLv": "32",
                "item1": "三刃長槍",
                "item2": "銀",
                "item3": "銀",
                "item4": "鬥牛之角",
                "item5": "",
                "item6": ""
            },
            {
                "name": "看起來不痛的槍 (痛くなさそうな槍)",
                "skillLv": "32",
                "item1": "木棒",
                "item2": "軟綿綿綿",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "重騎士槍 (ヘヴィランス)",
                "skillLv": "34",
                "item1": "長槍",
                "item2": "銀",
                "item3": "龜殼",
                "item4": "龜殼",
                "item5": "",
                "item6": ""
            },
            {
                "name": "魔法長槍 (マジカルランス)",
                "skillLv": "36",
                "item1": "長槍",
                "item2": "銀",
                "item3": "紫水晶",
                "item4": "綠寶石",
                "item5": "海藍寶石",
                "item6": "紅寶石"
            },
            {
                "name": "羽毛長槍 (フェザーランス)",
                "skillLv": "39",
                "item1": "長槍",
                "item2": "金",
                "item3": "鳥之羽",
                "item4": "鳥之羽",
                "item5": "鳥之羽",
                "item6": ""
            },
            {
                "name": "火焰長槍 (フレアランス)",
                "skillLv": "43",
                "item1": "長槍",
                "item2": "銀",
                "item3": "火之結晶",
                "item4": "射手的火藥",
                "item5": "",
                "item6": ""
            },
            {
                "name": "猛毒女王 (ポイズンクイーン)",
                "skillLv": "45",
                "item1": "長槍",
                "item2": "蘑菇孢子",
                "item3": "植物莖",
                "item4": "蝎子的鉗子",
                "item5": "植物根",
                "item6": "魔法師之粉"
            },
            {
                "name": "伊賽貝克 (イセベルク)",
                "skillLv": "47",
                "item1": "長槍",
                "item2": "金",
                "item3": "金",
                "item4": "水之結晶",
                "item5": "龜殼",
                "item6": ""
            },
            {
                "name": "貫穿者 (ブリューナク)",
                "skillLv": "49",
                "item1": "長槍",
                "item2": "銀",
                "item3": "金",
                "item4": "光之結晶",
                "item5": "鬥牛之角",
                "item6": ""
            },
            {
                "name": "菠蘿棒 (パイナ棒)",
                "skillLv": "50",
                "item1": "菠蘿",
                "item2": "",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "五節棍 (五節昆)",
                "skillLv": "53",
                "item1": "長槍",
                "item2": "植物根",
                "item3": "維京護肩",
                "item4": "狼牙",
                "item5": "狼牙",
                "item6": "狼牙"
            },
            {
                "name": "血之長槍 (ブラッドランス)",
                "skillLv": "55",
                "item1": "長槍",
                "item2": "金",
                "item3": "蘑菇孢子",
                "item4": "浮游靈的頭巾",
                "item5": "魔法師之粉",
                "item6": "魔法師之粉"
            },
            {
                "name": "金箍棒 (如意棒)",
                "skillLv": "62",
                "item1": "木棒",
                "item2": "戰士之證",
                "item3": "壞掉的木箱",
                "item4": "上質的毛皮",
                "item5": "",
                "item6": ""
            },
            {
                "name": "三叉戟 (トライデント)",
                "skillLv": "67",
                "item1": "長槍",
                "item2": "銀",
                "item3": "金",
                "item4": "白金",
                "item5": "白金",
                "item6": ""
            },
            {
                "name": "梅托斯 (メトゥス)",
                "skillLv": "74",
                "item1": "長槍",
                "item2": "金",
                "item3": "白金",
                "item4": "維京護肩",
                "item5": "浮游靈的頭巾",
                "item6": ""
            },
            {
                "name": "沉默墓碑 (サイレントグレイブ)",
                "skillLv": "76",
                "item1": "長槍",
                "item2": "白金",
                "item3": "白金",
                "item4": "狼牙",
                "item5": "狼牙",
                "item6": ""
            },
            {
                "name": "破壞之王 (オーバーブレイク)",
                "skillLv": "81",
                "item1": "長槍",
                "item2": "金",
                "item3": "金",
                "item4": "白金",
                "item5": "戰士之證",
                "item6": "絲綢"
            },
            {
                "name": "猛毒長槍 (ピオール)",
                "skillLv": "86",
                "item1": "長槍",
                "item2": "針槍",
                "item3": "射手的火藥",
                "item4": "蝎子的尾巴",
                "item5": "昆蟲的下顎",
                "item6": "毒粉"
            },
            {
                "name": "貝爾巴羅斯 (ベルヴァロース)",
                "skillLv": "89",
                "item1": "長槍",
                "item2": "金",
                "item3": "白金",
                "item4": "白金",
                "item5": "魔人之角",
                "item6": "骷髏"
            },
            {
                "name": "死翔槍 (ゲイボルグ)",
                "skillLv": "92",
                "item1": "長槍",
                "item2": "白金",
                "item3": "白金",
                "item4": "鬥牛之角",
                "item5": "龍牙",
                "item6": "龍骨"
            },
            {
                "name": "龍牙 (竜の牙)",
                "skillLv": "95",
                "item1": "長槍",
                "item2": "絲綢",
                "item3": "龍牙",
                "item4": "龍牙",
                "item5": "龍牙",
                "item6": "龍牙"
            },
            {
                "name": "奧丁神槍 (グングニル)",
                "skillLv": "97",
                "item1": "魔人之角",
                "item2": "白金",
                "item3": "結實的藤",
                "item4": "蝎子的鉗子",
                "item5": "惡魔之血",
                "item6": "毒粉"
            },
            {
                "name": "刃靈 (レギオン)",
                "skillLv": "98",
                "item1": "長槍",
                "item2": "鑽石",
                "item3": "浮游靈的頭巾",
                "item4": "浮游靈的頭巾",
                "item5": "龍牙",
                "item6": "水龍的羽鰭"
            }
        ]
    },
    {
        "category": "斧(オノ)",
        "tab": "tomahawk",
        "list": [
            {
                "name": "戰斧 (バトルアックス)",
                "skillLv": "6",
                "item1": "鐵",
                "item2": "鐵",
                "item3": "鐵",
                "item4": "鐵",
                "item5": "",
                "item6": ""
            },
            {
                "name": "戰鬥鐮刀 (バトルサイズ)",
                "skillLv": "9",
                "item1": "木材",
                "item2": "生鏽的箭頭",
                "item3": "堅固的角",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "認真的破斧子 (本気なボロのオノ)",
                "skillLv": "12",
                "item1": "破斧子",
                "item2": "生鏽的箭頭",
                "item3": "生鏽的箭頭",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "刺斧 (ポールアックス)",
                "skillLv": "16",
                "item1": "戰斧",
                "item2": "銅",
                "item3": "巨人之爪",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "刺斧改 (ポールアックス改)",
                "skillLv": "24",
                "item1": "刺斧",
                "item2": "銅",
                "item3": "巨人之爪",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "改良斧 (グレートアックス)",
                "skillLv": "26",
                "item1": "戰斧",
                "item2": "銀",
                "item3": "銀",
                "item4": "豹爪",
                "item5": "",
                "item6": ""
            },
            {
                "name": "毒蜥之牙 (バジリスクファング)",
                "skillLv": "30",
                "item1": "戰鬥鐮刀",
                "item2": "漂亮的蜘蛛絲",
                "item3": "蝎子的鉗子",
                "item4": "豹爪",
                "item5": "",
                "item6": ""
            },
            {
                "name": "砍斧 (トマホーク)",
                "skillLv": "34",
                "item1": "戰斧",
                "item2": "獸人的破布",
                "item3": "巨人手套",
                "item4": "昆蟲下顎",
                "item5": "",
                "item6": ""
            },
            {
                "name": "月牙斧 (クレセントアックス)",
                "skillLv": "36",
                "item1": "戰斧",
                "item2": "銀",
                "item3": "金",
                "item4": "骨膠",
                "item5": "",
                "item6": ""
            },
            {
                "name": "熾熱戰斧 (ヒートアックス)",
                "skillLv": "43",
                "item1": "戰斧",
                "item2": "金",
                "item3": "射手的火藥",
                "item4": "射手的火藥",
                "item5": "火之結晶",
                "item6": ""
            },
            {
                "name": "巖斧 (ロックアックス)",
                "skillLv": "45",
                "item1": "戰斧",
                "item2": "銀",
                "item3": "金",
                "item4": "戰士之證",
                "item5": "鬥牛之角",
                "item6": ""
            },
            {
                "name": "月牙斧改 (クレセントアックス改)",
                "skillLv": "50",
                "item1": "月牙斧",
                "item2": "銀",
                "item3": "金",
                "item4": "骨膠",
                "item5": "",
                "item6": ""
            },
            {
                "name": "凍結戰斧 (フロストアックス)",
                "skillLv": "53",
                "item1": "戰斧",
                "item2": "金",
                "item3": "絲綢",
                "item4": "水之結晶",
                "item5": "水之結晶",
                "item6": ""
            },
            {
                "name": "棒棒糖 (ぺろぺろキャンディー)",
                "skillLv": "60",
                "item1": "蘋果",
                "item2": "蘋果",
                "item3": "黃油",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "惡魔之斧 (デモンズアックス)",
                "skillLv": "62",
                "item1": "戰斧",
                "item2": "戰士之證",
                "item3": "戰士之證",
                "item4": "魔人之角",
                "item5": "魔人之角",
                "item6": ""
            },
            {
                "name": "雙刃戰斧 (ダブルエッジ)",
                "skillLv": "71",
                "item1": "戰斧",
                "item2": "白金",
                "item3": "生鏽的箭頭",
                "item4": "古代魚骨",
                "item5": "古代魚骨",
                "item6": ""
            },
            {
                "name": "奧魯迪爾 (オールデール)",
                "skillLv": "79",
                "item1": "戰斧",
                "item2": "白金",
                "item3": "白金",
                "item4": "白金",
                "item5": "昆蟲的下顎",
                "item6": ""
            },
            {
                "name": "惡魔手指 (デビルフィンガー)",
                "skillLv": "83",
                "item1": "毒蜥之牙",
                "item2": "豹爪",
                "item3": "狼牙",
                "item4": "龍牙",
                "item5": "魔人之角",
                "item6": ""
            },
            {
                "name": "劊子手 (エクスキューショナー)",
                "skillLv": "87",
                "item1": "戰斧",
                "item2": "白金",
                "item3": "生鏽的箭頭",
                "item4": "惡魔之血",
                "item5": "骷髏",
                "item6": "豪邁的胸毛"
            },
            {
                "name": "聖斧 (セイントアックス)",
                "skillLv": "96",
                "item1": "戰斧",
                "item2": "白金",
                "item3": "鑽石",
                "item4": "光之結晶",
                "item5": "小結晶",
                "item6": "水龍的羽鰭"
            }
        ]
    },
    {
        "category": "錘(ハンマー)",
        "tab": "warhammer",
        "list": [
            {
                "name": "戰鬥錘 (バトルハンマー)",
                "skillLv": "7",
                "item1": "鐵",
                "item2": "鐵",
                "item3": "鐵",
                "item4": "鐵",
                "item5": "鐵",
                "item6": ""
            },
            {
                "name": "球棒 (カッキーン)",
                "skillLv": "13",
                "item1": "獸人的破布",
                "item2": "海盜哥布林的布",
                "item3": "木材",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "重錘 (ウォーハンマー)",
                "skillLv": "15",
                "item1": "戰鬥錘",
                "item2": "鐵",
                "item3": "銅",
                "item4": "銅",
                "item5": "",
                "item6": ""
            },
            {
                "name": "力石 (力石)",
                "skillLv": "19",
                "item1": "戰鬥錘",
                "item2": "鐵",
                "item3": "鐵",
                "item4": "銅",
                "item5": "銅",
                "item6": "銅"
            },
            {
                "name": "重錘改 (ウォーハンマー改)",
                "skillLv": "22",
                "item1": "重錘",
                "item2": "鐵",
                "item3": "銅",
                "item4": "銅",
                "item5": "",
                "item6": ""
            },
            {
                "name": "改良錘 (グレートハンマー)",
                "skillLv": "28",
                "item1": "戰鬥錘",
                "item2": "銅",
                "item3": "銀",
                "item4": "錘子的碎片",
                "item5": "",
                "item6": ""
            },
            {
                "name": "金屬球棒 (アイアンカッキーン)",
                "skillLv": "32",
                "item1": "球棒",
                "item2": "鐵",
                "item3": "鐵",
                "item4": "鐵",
                "item5": "",
                "item6": ""
            },
            {
                "name": "覺醒的破錘子 (目覚めたボロハンマー)",
                "skillLv": "38",
                "item1": "破錘子",
                "item2": "獸人的破布",
                "item3": "獸人的破布",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "火之錘 (フレイムハンマー)",
                "skillLv": "39",
                "item1": "戰鬥錘",
                "item2": "金",
                "item3": "軟綿綿綿",
                "item4": "射手的火藥",
                "item5": "",
                "item6": ""
            },
            {
                "name": "玩具錘 (ピコピコハンマー)",
                "skillLv": "46",
                "item1": "蟲皮",
                "item2": "蟲皮",
                "item3": "蛋",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "天空錘 (スカイハンマー)",
                "skillLv": "47",
                "item1": "戰鬥錘",
                "item2": "金",
                "item3": "鳥之羽",
                "item4": "鳥之羽",
                "item5": "鳥之羽",
                "item6": ""
            },
            {
                "name": "巨錘 (ギガントハンマー)",
                "skillLv": "48",
                "item1": "戰鬥錘",
                "item2": "鐵",
                "item3": "金",
                "item4": "金",
                "item5": "鬥牛之角",
                "item6": ""
            },
            {
                "name": "冰之錘 (アイスハンマー)",
                "skillLv": "55",
                "item1": "戰鬥錘",
                "item2": "金",
                "item3": "金",
                "item4": "龜殼",
                "item5": "植物根",
                "item6": ""
            },
            {
                "name": "骨錘 (ボーンハンマー)",
                "skillLv": "58",
                "item1": "戰鬥錘",
                "item2": "白金",
                "item3": "蝎子的尾巴",
                "item4": "鬥牛之角",
                "item5": "鬥牛之角",
                "item6": ""
            },
            {
                "name": "大地之錘 (グラヴィトンハンマー)",
                "skillLv": "66",
                "item1": "戰鬥錘",
                "item2": "白金",
                "item3": "結實的藤",
                "item4": "龜殼",
                "item5": "上質的毛皮",
                "item6": ""
            },
            {
                "name": "輕錘 (シュナーベル)",
                "skillLv": "69",
                "item1": "戰鬥錘",
                "item2": "銀",
                "item3": "白金",
                "item4": "豹爪",
                "item5": "戰鬥之證",
                "item6": ""
            },
            {
                "name": "尖刺鐵錘 (スパイクハンマー)",
                "skillLv": "73",
                "item1": "戰鬥錘",
                "item2": "白金",
                "item3": "白金",
                "item4": "狼牙",
                "item5": "狼牙",
                "item6": "狼牙"
            },
            {
                "name": "水晶錘 (クリスタルハンマー)",
                "skillLv": "75",
                "item1": "戰鬥錘",
                "item2": "金",
                "item3": "白金",
                "item4": "白金",
                "item5": "狼牙",
                "item6": ""
            },
            {
                "name": "巨錘改 (ギガントハンマー改)",
                "skillLv": "81",
                "item1": "巨錘",
                "item2": "銅",
                "item3": "白金",
                "item4": "白金",
                "item5": "昆蟲的下顎",
                "item6": ""
            },
            {
                "name": "金剛 (金剛)",
                "skillLv": "84",
                "item1": "力石",
                "item2": "魔人之角",
                "item3": "魔人之角",
                "item4": "魔人之角",
                "item5": "魔人之角",
                "item6": "魔人之角"
            },
            {
                "name": "粉碎之錘 (ミョルニル)",
                "skillLv": "94",
                "item1": "戰鬥錘",
                "item2": "白金",
                "item3": "白金",
                "item4": "巨人手套",
                "item5": "錘子的碎片",
                "item6": "上質的毛皮"
            },
            {
                "name": "命運粉碎者 (フェイタルクラッシュ)",
                "skillLv": "95",
                "item1": "戰鬥錘",
                "item2": "白金",
                "item3": "龍牙",
                "item4": "龍牙",
                "item5": "壞掉的木箱",
                "item6": "壞掉的木箱"
            },
            {
                "name": "飛濺之星 (スプラッシュスター)",
                "skillLv": "97",
                "item1": "戰鬥錘",
                "item2": "白金",
                "item3": "鑽石",
                "item4": "惡魔之血",
                "item5": "妖精之粉",
                "item6": "水龍的羽鰭"
            }
        ]
    },
    {
        "category": "法杖(杖)",
        "tab": "staff",
        "list": [
            {
                "name": "法杖 (ロッド)",
                "skillLv": "4",
                "item1": "鐵",
                "item2": "紫水晶",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "魔法杖 (スタッフ)",
                "skillLv": "10",
                "item1": "法杖",
                "item2": "鐵",
                "item3": "結實的藤",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "冰之杖 (アイスロッド)",
                "skillLv": "16",
                "item1": "法杖",
                "item2": "銅",
                "item3": "綠寶石",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "雷霆法杖 (ライトニングワンド)",
                "skillLv": "21",
                "item1": "法杖",
                "item2": "銅",
                "item3": "昆蟲的下顎",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "火之杖 (フレアロッド)",
                "skillLv": "24",
                "item1": "法杖",
                "item2": "銀",
                "item3": "火之結晶",
                "item4": "紅寶石",
                "item5": "",
                "item6": ""
            },
            {
                "name": "籃子 (バスケット)",
                "skillLv": "29",
                "item1": "結實的蜘蛛絲",
                "item2": "漂亮的蟲皮",
                "item3": "結實的藤",
                "item4": "結實的藤",
                "item5": "",
                "item6": ""
            },
            {
                "name": "銀仗 (シルバーロッド)",
                "skillLv": "36",
                "item1": "法杖",
                "item2": "銀",
                "item3": "海藍寶石",
                "item4": "植物根",
                "item5": "",
                "item6": ""
            },
            {
                "name": "大地法杖 (アースワンド)",
                "skillLv": "41",
                "item1": "法杖",
                "item2": "銀",
                "item3": "地之結晶",
                "item4": "骨膠",
                "item5": "",
                "item6": ""
            },
            {
                "name": "賢者之仗 (ウィザードスタッフ)",
                "skillLv": "48",
                "item1": "法杖",
                "item2": "金",
                "item3": "藍寶石",
                "item4": "魔法師之粉",
                "item5": "",
                "item6": ""
            },
            {
                "name": "魔術手杖 (マジックステッキ)",
                "skillLv": "54",
                "item1": "法杖",
                "item2": "白金",
                "item3": "魔法師之粉",
                "item4": "魔力結晶",
                "item5": "魔力結晶",
                "item6": ""
            },
            {
                "name": "魔法注射器 (魔法の注射器)",
                "skillLv": "60",
                "item1": "生鏽的箭頭",
                "item2": "漂亮的蟲皮",
                "item3": "蘑菇孢子",
                "item4": "植物莖",
                "item5": "結實的藤",
                "item6": ""
            },
            {
                "name": "符文之仗 (ルーンスタッフ)",
                "skillLv": "67",
                "item1": "法杖",
                "item2": "白金",
                "item3": "藍寶石",
                "item4": "光之結晶",
                "item5": "魔法師之粉",
                "item6": "魔力結晶"
            },
            {
                "name": "魔法手杖 (マジカルステッキ)",
                "skillLv": "78",
                "item1": "法杖",
                "item2": "金",
                "item3": "白金",
                "item4": "惡魔之血",
                "item5": "小結晶",
                "item6": ""
            },
            {
                "name": "魔法掃帚 (魔法のほうき)",
                "skillLv": "86",
                "item1": "法杖",
                "item2": "壞掉的木箱",
                "item3": "牧草",
                "item4": "絲綢",
                "item5": "獅子的藍毛",
                "item6": "水龍的魚鰭"
            }
        ]
    }
];
const staffMater = [
    {
        "category": "屬性結晶",
        "tab": "attrcrystal",
        "active": true,
        "list": [
            {
                "name": "火の結晶(火之結晶)",
                "data": {
                    "Lv1attr": "火",
                    "Lv1": "前方2個方向火球",
                    "Lv2attr": "火",
                    "Lv2": "前方3個方向火球",
                    "Lv3attr": "火",
                    "Lv3": "前方4個方向火球",
                    "speed": "一般",
                    "notion": ""
                }
            },
            {
                "name": "水の結晶(水之結晶)",
                "data": {
                    "Lv1attr": "水",
                    "Lv1": "周圍90度水雷射",
                    "Lv2attr": "水",
                    "Lv2": "周圍180度水雷射",
                    "Lv3attr": "水",
                    "Lv3": "周圍270度水雷射",
                    "speed": "一般",
                    "notion": ""
                }
            },
            {
                "name": "地の結晶(地之結晶)",
                "data": {
                    "Lv1attr": "地",
                    "Lv1": "前方5個巖石柱",
                    "Lv2attr": "地",
                    "Lv2": "前方範圍7個巖石柱",
                    "Lv3attr": "地",
                    "Lv3": "前方廣範圍9個巖石柱",
                    "speed": "一般",
                    "notion": "Lv1單體多段HIT"
                }
            },
            {
                "name": "風の結晶(風之結晶)",
                "data": {
                    "Lv1attr": "風",
                    "Lv1": "2個追尾風刃",
                    "Lv2attr": "風",
                    "Lv2": "4個追尾風刃",
                    "Lv3attr": "風",
                    "Lv3": "6個追尾風刃",
                    "speed": "一般",
                    "notion": ""
                }
            },
            {
                "name": "光の結晶(光之結晶)",
                "data": {
                    "Lv1attr": "光",
                    "Lv1": "向周圍擴充套件2個光球",
                    "Lv2attr": "光",
                    "Lv2": "向周圍擴充套件4個光球",
                    "Lv3attr": "光",
                    "Lv3": "向周圍擴充套件6個光球",
                    "speed": "一般",
                    "notion": "全方位廣範圍攻擊"
                }
            },
            {
                "name": "闇の結晶(暗之結晶)",
                "data": {
                    "Lv1attr": "暗",
                    "Lv1": "對前方釋放短時間緩慢前進暗球",
                    "Lv2attr": "暗",
                    "Lv2": "對前方釋放中時間緩慢前進暗球",
                    "Lv3attr": "暗",
                    "Lv3": "對前方釋放長時間緩慢前進暗球",
                    "speed": "一般",
                    "notion": "穿透敵人"
                }
            }
        ]
    },
    {
        "category": "通常敵人掉落素材",
        "tab": "basedrop",
        "list": [
            {
                "name": "さびた矢尻(生鏽的箭頭)",
                "data": {
                    "Lv1attr": "無",
                    "Lv1": "箭",
                    "Lv2attr": "無",
                    "Lv2": "2個方向的箭",
                    "Lv3attr": "無",
                    "Lv3": "3個方向的箭",
                    "speed": "很快",
                    "notion": "物理攻擊"
                }
            },
            {
                "name": "戦士の証(戰士之證)",
                "data": {
                    "Lv1attr": "",
                    "Lv1": "",
                    "Lv2attr": "無",
                    "Lv2": "前方投擲匕首",
                    "Lv3attr": "無",
                    "Lv3": "前方投擲斧子",
                    "speed": "一般",
                    "notion": "物理攻擊"
                }
            },
            {
                "name": "射手の発火薬(射手的火藥)",
                "data": {
                    "Lv1attr": "",
                    "Lv1": "",
                    "Lv2attr": "火",
                    "Lv2": "前方小火炎",
                    "Lv3attr": "火",
                    "Lv3": "前方大火炎",
                    "speed": "一般",
                    "notion": ""
                }
            },
            {
                "name": "丈夫なツル(結識的藤)",
                "data": {
                    "Lv1attr": "",
                    "Lv1": "",
                    "Lv2attr": "",
                    "Lv2": "",
                    "Lv3attr": "水",
                    "Lv3": "前方放射狀撒種子5個",
                    "speed": "一般",
                    "notion": ""
                }
            },
            {
                "name": "植物の莖(植物的莖)",
                "data": {
                    "Lv1attr": "",
                    "Lv1": "",
                    "Lv2attr": "",
                    "Lv2": "",
                    "Lv3attr": "風",
                    "Lv3": "彎取前進種子2個",
                    "speed": "一般",
                    "notion": ""
                }
            },
            {
                "name": "毒の粉(毒粉)",
                "data": {
                    "Lv1attr": "",
                    "Lv1": "",
                    "Lv2attr": "",
                    "Lv2": "",
                    "Lv3attr": "地",
                    "Lv3": "周圍發散毒粉",
                    "speed": "一般",
                    "notion": "追加毒效果"
                }
            },
            {
                "name": "キノコの胞子(蘑菇孢子)",
                "data": {
                    "Lv1attr": "",
                    "Lv1": "",
                    "Lv2attr": "",
                    "Lv2": "",
                    "Lv3attr": "地",
                    "Lv3": "周圍發散孢子",
                    "speed": "一般",
                    "notion": "追加麻痹效果"
                }
            },
            {
                "name": "鳥の羽(鳥之羽)",
                "data": {
                    "Lv1attr": "",
                    "Lv1": "",
                    "Lv2attr": "",
                    "Lv2": "",
                    "Lv3attr": "無",
                    "Lv3": "吹風",
                    "speed": "快",
                    "notion": ""
                }
            },
            {
                "name": "ドラゴンの牙(龍之牙)",
                "data": {
                    "Lv1attr": "",
                    "Lv1": "",
                    "Lv2attr": "",
                    "Lv2": "",
                    "Lv3attr": "火",
                    "Lv3": "多段火焰吐息",
                    "speed": "一般",
                    "notion": ""
                }
            },
            {
                "name": "豹の爪(豹爪)",
                "data": {
                    "Lv1attr": "",
                    "Lv1": "",
                    "Lv2attr": "",
                    "Lv2": "",
                    "Lv3attr": "無",
                    "Lv3": "多段爪柱",
                    "speed": "一般",
                    "notion": "物理攻擊、拳技能上升、追加麻痹效果"
                }
            },
            {
                "name": "妖精の粉(妖精之粉)",
                "data": {
                    "Lv1attr": "",
                    "Lv1": "",
                    "Lv2attr": "",
                    "Lv2": "",
                    "Lv3attr": "地",
                    "Lv3": "周圍發散鱗粉",
                    "speed": "一般",
                    "notion": "追加睡眠效果"
                }
            },
            {
                "name": "小さな結晶(小結晶)",
                "data": {
                    "Lv1attr": "",
                    "Lv1": "",
                    "Lv2attr": "",
                    "Lv2": "",
                    "Lv3attr": "地",
                    "Lv3": "周圍發散煙霧",
                    "speed": "慢",
                    "notion": "追加封印效果"
                }
            }
        ]
    },
    {
        "category": "BOSS掉落素材",
        "tab": "bossdrop",
        "list": [
            {
                "name": "たぬきの葉っぱ(貍貓樹葉)",
                "data": {
                    "Lv1attr": "風",
                    "Lv1": "向4個方向發射風彈",
                    "Lv2attr": "風",
                    "Lv2": "向5個方向發射風彈",
                    "Lv3attr": "風",
                    "Lv3": "發射風的迴旋鏢",
                    "speed": "快",
                    "notion": ""
                }
            },
            {
                "name": "竜の骨(龍骨)",
                "data": {
                    "Lv1attr": "",
                    "Lv1": "",
                    "Lv2attr": "",
                    "Lv2": "",
                    "Lv3attr": "光",
                    "Lv3": "追尾巨大光球",
                    "speed": "很慢",
                    "notion": ""
                }
            },
            {
                "name": "獅子の赤毛(獅子的紅毛)",
                "data": {
                    "Lv1attr": "",
                    "Lv1": "",
                    "Lv2attr": "",
                    "Lv2": "",
                    "Lv3attr": "風",
                    "Lv3": "咆吼攻擊",
                    "speed": "一般",
                    "notion": "追加麻痹效果"
                }
            },
            {
                "name": "獅子の青毛(獅子的藍毛)",
                "data": {
                    "Lv1attr": "",
                    "Lv1": "",
                    "Lv2attr": "風",
                    "Lv2": "周圍4個方向緩慢的龍捲風",
                    "Lv3attr": "風",
                    "Lv3": "正面3個快速的龍捲風",
                    "speed": "慢",
                    "notion": ""
                }
            },
            {
                "name": "氷の壁のかけら(冰壁的碎片)",
                "data": {
                    "Lv1attr": "水",
                    "Lv1": "周圍擴充套件的冰柱",
                    "Lv2attr": "水",
                    "Lv2": "敵人單體周圍8個冰柱",
                    "Lv3attr": "水",
                    "Lv3": "飛出巨大冰柱",
                    "speed": "很慢",
                    "notion": "Lv2自動命中"
                }
            },
            {
                "name": "アンモナイト(鸚鵡螺化石)",
                "data": {
                    "Lv1attr": "無",
                    "Lv1": "滾出桶",
                    "Lv2attr": "無",
                    "Lv2": "爆炸桶散開，爆炸火屬性",
                    "Lv3attr": "愛",
                    "Lv3": "扔出刺海膽並持續一段時間",
                    "speed": "慢",
                    "notion": "全物理攻擊，Lv1 2無上升技能"
                }
            },
            {
                "name": "氷の鼻(冰之鼻)",
                "data": {
                    "Lv1attr": "",
                    "Lv1": "",
                    "Lv2attr": "",
                    "Lv2": "",
                    "Lv3attr": "水",
                    "Lv3": "廣範圍冰山",
                    "speed": "很慢",
                    "notion": "威力高，RP消耗大"
                }
            },
            {
                "name": "グレートな胸毛(豪邁胸毛)",
                "data": {
                    "Lv1attr": "無",
                    "Lv1": "力量波動",
                    "Lv2attr": "無",
                    "Lv2": "3向力量波動",
                    "Lv3attr": "無",
                    "Lv3": "8向放射力量波動",
                    "speed": "一般",
                    "notion": "物理攻擊，單手劍技能提高"
                }
            },
            {
                "name": "キメラのしっぽ(奇美拉之尾)",
                "data": {
                    "Lv1attr": "",
                    "Lv1": "",
                    "Lv2attr": "",
                    "Lv2": "",
                    "Lv3attr": "水",
                    "Lv3": "水泡吐息",
                    "speed": "很慢",
                    "notion": "追加麻痹效果"
                }
            },
            {
                "name": "グリモアのうろこ(格利莫亞之鱗)",
                "data": {
                    "Lv1attr": "",
                    "Lv1": "",
                    "Lv2attr": "地",
                    "Lv2": "前方全屏風暴夾雜著3個石塊",
                    "Lv3attr": "風",
                    "Lv3": "放出滯留的龍捲風",
                    "speed": "很慢",
                    "notion": "Lv3威力高"
                }
            },
            {
                "name": "水竜の羽ビレ(水龍的羽鰭)",
                "data": {
                    "Lv1attr": "無",
                    "Lv1": "發射4個水翼攻擊地圖內的敵人",
                    "Lv2attr": "水",
                    "Lv2": "發射4個水雷射攻擊地圖內的敵人",
                    "Lv3attr": "水",
                    "Lv3": "向自己後方發射2個水翼，跟隨自己長時間與敵人對抗發射水雷射",
                    "speed": "慢",
                    "notion": "Lv1~3水翼攻擊時判斷為無屬性物理攻擊、提升水技能、水翼受到攻擊後消失。"
                }
            },
            {
                "name": "動く枝(動枝)",
                "data": {
                    "Lv1attr": "地",
                    "Lv1": "地面伸出樹枝攻擊最近敵人",
                    "Lv2attr": "愛",
                    "Lv2": "在周圍迴旋8個蘋果",
                    "Lv3attr": "愛",
                    "Lv3": "全畫面蘋果落下",
                    "speed": "很慢",
                    "notion": ""
                }
            },
            {
                "name": "電気の結晶(電氣結晶)",
                "data": {
                    "Lv1attr": "風",
                    "Lv1": "發射追蹤最近的1個敵人的雷彈，附加麻痹效果",
                    "Lv2attr": "風",
                    "Lv2": "超高速的光彈，撞擊后炸裂成碎片，附加麻痹效果",
                    "Lv3attr": "風",
                    "Lv3": "超巨大雷彈快速全畫面Z行，RP消耗大",
                    "speed": "很慢",
                    "notion": "蓄力特別慢"
                }
            },
            {
                "name": "歌の小ビン(歌之小瓶)",
                "data": {
                    "Lv1attr": "",
                    "Lv1": "",
                    "Lv2attr": "水",
                    "Lv2": "向前方發出4條水雷射",
                    "Lv3attr": "?",
                    "Lv3": "向周圍發散任何屬性、任何異常狀態的音符",
                    "speed": "很慢",
                    "notion": ""
                }
            },
            {
                "name": "ゴーレムの石版(怪力石版)",
                "data": {
                    "Lv1attr": "無",
                    "Lv1": "自己正面左側火箭拳",
                    "Lv2attr": "無",
                    "Lv2": "自己正面右側火箭拳",
                    "Lv3attr": "火",
                    "Lv3": "發射放射狀火球10發",
                    "speed": "很慢",
                    "notion": "Lv1 2提升拳技能"
                }
            },
            {
                "name": "地竜のうろこ(地龍之鱗)",
                "data": {
                    "Lv1attr": "風",
                    "Lv1": "向最近的1個敵人連續丟5個落雷",
                    "Lv2attr": "地",
                    "Lv2": "在自身周圍逆時針一邊轉一邊放出巖石柱",
                    "Lv3attr": "地",
                    "Lv3": "全屏落下巨大隕石雨",
                    "speed": "很慢",
                    "notion": "Lv1追加麻痹效果"
                }
            },
            {
                "name": "火竜のうろこ(火龍之鱗)",
                "data": {
                    "Lv1attr": "火",
                    "Lv1": "對前方放出巨大的火焰球",
                    "Lv2attr": "火",
                    "Lv2": "從周圍向自己吸收火球",
                    "Lv3attr": "火",
                    "Lv3": "以自己為中心釋放全屏火柱",
                    "speed": "很慢",
                    "notion": "Lv2吸收BOSS屬性以外的敵人"
                }
            }
        ]
    }
];
const farmRec = [
    {
        "category": "錘子(ハンマー)",
        "active": true,
        "tab": "hammer",
        "list": [
            {
                "name": "破爛的錘子 (ボロのハンマー)",
                "skillLv": "5",
                "item1": "鐵屑",
                "item2": "鐵屑",
                "item3": "鐵",
                "item4": "鐵",
                "item5": "鐵",
                "item6": ""
            },
            {
                "name": "銅錘子 (ブロンズハンマー)",
                "skillLv": "15",
                "item1": "破錘子",
                "item2": "銅",
                "item3": "銅",
                "item4": "銅",
                "item5": "",
                "item6": ""
            },
            {
                "name": "銀錘子 (シルバーハンマー)",
                "skillLv": "30",
                "item1": "銅錘子",
                "item2": "銀",
                "item3": "銀",
                "item4": "銀",
                "item5": "",
                "item6": ""
            },
            {
                "name": "金錘子 (ゴールデンハンマー)",
                "skillLv": "60",
                "item1": "銀錘子",
                "item2": "金",
                "item3": "金",
                "item4": "金",
                "item5": "金",
                "item6": ""
            },
            {
                "name": "白金錘子 (プラチナム)",
                "skillLv": "80",
                "item1": "金錘子",
                "item2": "白金",
                "item3": "白金",
                "item4": "白金",
                "item5": "白金",
                "item6": "白金"
            }
        ]
    },
    {
        "category": "斧頭(オノ)",
        "tab": "axe",
        "list": [
            {
                "name": "破爛的斧子 (ボロのオノ)",
                "skillLv": "5",
                "item1": "鐵屑",
                "item2": "鐵屑",
                "item3": "鐵",
                "item4": "鐵",
                "item5": "",
                "item6": ""
            },
            {
                "name": "砍柴的斧子 (まき割りのオノ)",
                "skillLv": "15",
                "item1": "破斧子",
                "item2": "銅",
                "item3": "銅",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "砍伐的斧子 (伐採のオノ)",
                "skillLv": "30",
                "item1": "砍柴之斧",
                "item2": "銀",
                "item3": "銀",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "守山的斧子 (山守のオノ)",
                "skillLv": "60",
                "item1": "砍樹之斧",
                "item2": "金",
                "item3": "金",
                "item4": "金",
                "item5": "",
                "item6": ""
            },
            {
                "name": "奇蹟的斧子 (奇跡のオノ)",
                "skillLv": "80",
                "item1": "守山之斧",
                "item2": "白金",
                "item3": "白金",
                "item4": "白金",
                "item5": "白金",
                "item6": ""
            }
        ]
    },
    {
        "category": "鐮刀(カマ)",
        "tab": "sickle",
        "list": [
            {
                "name": "破爛的鐮刀 (ボロのカマ)",
                "skillLv": "5",
                "item1": "鐵屑",
                "item2": "鐵屑",
                "item3": "鐵",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "鐵鐮刀 (鉄のカマ)",
                "skillLv": "15",
                "item1": "破鐮刀",
                "item2": "銅",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "商品的鐮刀 (上物のカマ)",
                "skillLv": "30",
                "item1": "鐵鐮刀",
                "item2": "銀",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "鋒利的鐮刀 (業物のカマ)",
                "skillLv": "60",
                "item1": "商品鐮刀",
                "item2": "金",
                "item3": "金",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "名匠的鐮刀 (名工のカマイタチ)",
                "skillLv": "80",
                "item1": "鋒利的鐮刀",
                "item2": "白金",
                "item3": "白金",
                "item4": "",
                "item5": "",
                "item6": ""
            }
        ]
    },
    {
        "category": "灑水壺(じょうろ)",
        "tab": "wateringcan",
        "list": [
            {
                "name": "破爛的灑水壺 (ボロのじょうろ)",
                "skillLv": "5",
                "item1": "鐵屑",
                "item2": "鐵",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "鐵皮灑水壺 (ブリキのじょうろ)",
                "skillLv": "15",
                "item1": "破灑水壺",
                "item2": "銅",
                "item3": "銅",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "獅子灑水壺 (獅子のじょうろ)",
                "skillLv": "30",
                "item1": "鐵皮灑水壺",
                "item2": "銀",
                "item3": "銀",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "彩虹灑水壺 (虹のじょうろ)",
                "skillLv": "60",
                "item1": "獅子灑水壺",
                "item2": "金",
                "item3": "金",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "幸福灑水壺 (幸せのじょうろ)",
                "skillLv": "80",
                "item1": "彩虹灑水壺",
                "item2": "白金",
                "item3": "白金",
                "item4": "",
                "item5": "",
                "item6": ""
            }
        ]
    },
    {
        "category": "鋤頭(クワ)",
        "tab": "hoe",
        "list": [
            {
                "name": "破爛的鋤頭 (ボロのクワ)",
                "skillLv": "5",
                "item1": "鐵屑",
                "item2": "鐵",
                "item3": "鐵",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "結實的鋤頭 (丈夫なクワ)",
                "skillLv": "15",
                "item1": "破鋤頭",
                "item2": "銅",
                "item3": "銅",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "熟練的鋤頭 (熟練のクワ)",
                "skillLv": "30",
                "item1": "結實的鋤頭",
                "item2": "銀",
                "item3": "銀",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "光輝的鋤頭 (輝きのクワ)",
                "skillLv": "60",
                "item1": "熟練的鋤頭",
                "item2": "金",
                "item3": "金",
                "item4": "金",
                "item5": "",
                "item6": ""
            },
            {
                "name": "喜悅的鋤頭 (喜びのクワ)",
                "skillLv": "80",
                "item1": "光輝的鋤頭",
                "item2": "白金",
                "item3": "白金",
                "item4": "白金",
                "item5": "白金",
                "item6": ""
            }
        ]
    },
    {
        "category": "釣竿(釣竿)",
        "tab": "fishingrod",
        "list": [
            {
                "name": "破爛的釣竿 (ボロの釣竿)",
                "skillLv": "5",
                "item1": "木材",
                "item2": "結實的蜘蛛絲",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "初心者的釣竿 (初心者の釣竿)",
                "skillLv": "15",
                "item1": "破釣竿",
                "item2": "漂亮的蜘蛛絲",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "中級者的釣竿 (中級者の釣竿)",
                "skillLv": "30",
                "item1": "初心者釣竿",
                "item2": "海盜哥布林的布",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "名人的釣竿 (名人の釣竿)",
                "skillLv": "60",
                "item1": "中級者釣竿",
                "item2": "龜殼",
                "item3": "龜殼",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "御神木的釣竿 (御神木の釣竿)",
                "skillLv": "80",
                "item1": "名人釣竿",
                "item2": "古代魚之骨",
                "item3": "古代魚之骨",
                "item4": "古代魚之骨",
                "item5": "",
                "item6": ""
            }
        ]
    }
];
const equiMater = [
    {
        "name": "木材(木材)",
        "get": [
            "樹枝",
            "樹樁"
        ],
        "difficulty": "-",
        "attr": "-",
        "atk": "-",
        "def": "-",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "枝(樹枝)",
        "get": [
            "田地"
        ],
        "difficulty": "-",
        "attr": "-",
        "atk": "-",
        "def": "-",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "石(石頭)",
        "get": [
            "田地"
        ],
        "difficulty": "-",
        "attr": "-",
        "atk": "-",
        "def": "-",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "クズ鉄(鐵屑)",
        "get": [
            "迷宮中巖石"
        ],
        "difficulty": "62",
        "attr": "-",
        "atk": "-4",
        "def": "-2",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "鉄(鐵)",
        "get": [
            "迷宮中巖石 [春] [夏] "
        ],
        "difficulty": "14",
        "attr": "-",
        "atk": "2",
        "def": "1",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "銅(銅)",
        "get": [
            "迷宮中巖石 [春] [夏] [秋] "
        ],
        "difficulty": "19",
        "attr": "-",
        "atk": "3",
        "def": "1",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "銀(銀)",
        "get": [
            "迷宮中巖石 [夏] [秋] [冬] [龍] "
        ],
        "difficulty": "30",
        "attr": "-",
        "atk": "4",
        "def": "2",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "金(金)",
        "get": [
            "迷宮中巖石 [秋] [冬] [龍] "
        ],
        "difficulty": "52",
        "attr": "-",
        "atk": "6",
        "def": "4",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "プラチナ(白金)",
        "get": [
            "迷宮中巖石 [冬] [龍] "
        ],
        "difficulty": "83",
        "attr": "-",
        "atk": "7",
        "def": "5",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "アメジスト(紫水晶)",
        "get": [
            "迷宮中巖石 [春] "
        ],
        "difficulty": "11",
        "attr": "-",
        "atk": "-",
        "def": "-",
        "matk": "2",
        "mdef": "1",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "ルビー(紅寶石)",
        "get": [
            "史萊姆",
            "迷宮中巖石 [夏] "
        ],
        "difficulty": "22",
        "attr": "-",
        "atk": "-",
        "def": "-",
        "matk": "4",
        "mdef": "1",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "エメラルド(綠寶石)",
        "get": [
            "史萊姆",
            "迷宮中巖石 [夏] "
        ],
        "difficulty": "22",
        "attr": "-",
        "atk": "-",
        "def": "-",
        "matk": "2",
        "mdef": "3",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "アクアマリン(海藍寶石)",
        "get": [
            "黑暗史萊姆",
            "迷宮中巖石 [秋] "
        ],
        "difficulty": "40",
        "attr": "-",
        "atk": "-",
        "def": "-",
        "matk": "5",
        "mdef": "3",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "サファイア(藍寶石)",
        "get": [
            "迷宮中巖石 [冬] "
        ],
        "difficulty": "56",
        "attr": "-",
        "atk": "-",
        "def": "-",
        "matk": "6",
        "mdef": "5",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "ダイヤモンド(鑽石)",
        "get": [
            "迷你哥勒姆",
            "迷宮中巖石 [龍] "
        ],
        "difficulty": "72",
        "attr": "-",
        "atk": "-",
        "def": "-",
        "matk": "7",
        "mdef": "5",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "火の結晶(火之結晶)",
        "get": [
            "傳送門",
            "迷宮中巖石 [夏] "
        ],
        "difficulty": "28",
        "attr": "火",
        "atk": "-",
        "def": "-",
        "matk": "-",
        "mdef": "-",
        "str": "5",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "水の結晶(水之結晶)",
        "get": [
            "傳送門",
            "迷宮中巖石 [冬] "
        ],
        "difficulty": "28",
        "attr": "水",
        "atk": "-",
        "def": "-",
        "matk": "5",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "地の結晶(地之結晶)",
        "get": [
            "傳送門",
            "迷宮中巖石 [春] "
        ],
        "difficulty": "28",
        "attr": "地",
        "atk": "-",
        "def": "-",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "5",
        "int": "-",
        "sp": ""
    },
    {
        "name": "風の結晶(風之結晶)",
        "get": [
            "傳送門",
            "迷宮中巖石 [秋] "
        ],
        "difficulty": "28",
        "attr": "風",
        "atk": "-",
        "def": "-",
        "matk": "-",
        "mdef": "5",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "光の結晶(光之結晶)",
        "get": [
            "傳送門"
        ],
        "difficulty": "28",
        "attr": "光",
        "atk": "-",
        "def": "-",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "3",
        "int": "3",
        "sp": ""
    },
    {
        "name": "闇の結晶(暗之結晶)",
        "get": [
            "傳送門"
        ],
        "difficulty": "28",
        "attr": "暗",
        "atk": "-",
        "def": "-",
        "matk": "-",
        "mdef": "-",
        "str": "3",
        "vit": "-",
        "int": "3",
        "sp": ""
    },
    {
        "name": "愛の結晶(愛之結晶)",
        "get": [
            "傳送門"
        ],
        "difficulty": "28",
        "attr": "愛",
        "atk": "-",
        "def": "-",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": "吸收HP約5%"
    },
    {
        "name": "莫可棉棉(モコ綿)",
        "get": [
            "莫可莫可"
        ],
        "difficulty": "15",
        "attr": "-",
        "atk": "-",
        "def": "2",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": "誘入睡眠"
    },
    {
        "name": "軟毛(ふわ毛)",
        "get": [
            "莫可莫可"
        ],
        "difficulty": "4",
        "attr": "-",
        "atk": "-",
        "def": "1",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "軟軟的毛(ふわふわ毛)",
        "get": [
            "莫可莫可"
        ],
        "difficulty": "18",
        "attr": "-",
        "atk": "-",
        "def": "3",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "軟軟綿綿的毛(ふわふわモフモフ毛)",
        "get": [
            "莫可莫可"
        ],
        "difficulty": "32",
        "attr": "-",
        "atk": "-",
        "def": "5",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "毛線球(毛糸玉)",
        "get": [
            "裝飾臺合成製作"
        ],
        "difficulty": "22",
        "attr": "-",
        "atk": "-",
        "def": "3",
        "matk": "-",
        "mdef": "2",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "妖精之粉(妖精の粉)",
        "get": [
            "小妖精/小仙女",
            "哈迪斯"
        ],
        "difficulty": "78",
        "attr": "-",
        "atk": "-",
        "def": "-",
        "matk": "-",
        "mdef": "7",
        "str": "-",
        "vit": "-",
        "int": "3",
        "sp": ""
    },
    {
        "name": "骷髏(ドクロ)",
        "get": [
            "流氓哥布林",
            "鬼魂",
            "浮士德"
        ],
        "difficulty": "70",
        "attr": "-",
        "atk": "-",
        "def": "-",
        "matk": "-",
        "mdef": "-",
        "str": "-4",
        "vit": "-4",
        "int": "-4",
        "sp": "一擊即死率稍提高"
    },
    {
        "name": "浮幽靈的頭巾(浮幽霊の頭巾)",
        "get": [
            "洋蔥幽靈",
            "番茄幽靈",
            "青椒幽靈",
            "蕪菁幽靈"
        ],
        "difficulty": "61",
        "attr": "-",
        "atk": "5",
        "def": "-",
        "matk": "4",
        "mdef": "2",
        "str": "-",
        "vit": "-",
        "int": "1",
        "sp": "HP吸收，受到會心一擊率上升"
    },
    {
        "name": "龜殼(カメのこうら)",
        "get": [
            "陸龜"
        ],
        "difficulty": "61",
        "attr": "-",
        "atk": "-",
        "def": "7",
        "matk": "-",
        "mdef": "-2",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": "會心一擊和吹飛抗性大幅提升"
    },
    {
        "name": "古代魚之骨(古代魚の骨)",
        "get": [
            "空魚",
            "希拉魚"
        ],
        "difficulty": "52",
        "attr": "-",
        "atk": "-",
        "def": "-",
        "matk": "7",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "1",
        "sp": ""
    },
    {
        "name": "植物的莖(植物の莖)",
        "get": [
            "果樹花/怪花",
            "獅子花",
            "百合花"
        ],
        "difficulty": "19",
        "attr": "-",
        "atk": "-",
        "def": "-",
        "matk": "4",
        "mdef": "1",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "結實的藤(丈夫なツル)",
        "get": [
            "果樹花/怪花",
            "獅子花",
            "百合花"
        ],
        "difficulty": "14",
        "attr": "-",
        "atk": "-",
        "def": "2",
        "matk": "-",
        "mdef": "3",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "植物的根(植物の根)",
        "get": [
            "果樹花/怪花",
            "獅子花",
            "百合花"
        ],
        "difficulty": "22",
        "attr": "-",
        "atk": "-",
        "def": "-",
        "matk": "2",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "1",
        "sp": "對毒、麻痹、封印的抗性少許提升"
    },
    {
        "name": "毒粉(毒の粉)",
        "get": [
            "大毒笑菇",
            "狡猾蘑菇",
            "死亡真菌"
        ],
        "difficulty": "70",
        "attr": "毒",
        "atk": "-",
        "def": "-",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": "攻擊時毒發生率提升"
    },
    {
        "name": "蘑菇孢子(キノコの胞子)",
        "get": [
            "大毒笑菇",
            "狡猾蘑菇",
            "死亡真菌"
        ],
        "difficulty": "26",
        "attr": "-",
        "atk": "-",
        "def": "2",
        "matk": "2",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": "攻擊時毒發生率少許提升"
    },
    {
        "name": "毛皮(毛皮)",
        "get": [
            "奇羅利"
        ],
        "difficulty": "17",
        "attr": "-",
        "atk": "-",
        "def": "3",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": "稍難受到氣絕"
    },
    {
        "name": "上質的毛皮(上質な毛皮)",
        "get": [
            "企鵝"
        ],
        "difficulty": "43",
        "attr": "-",
        "atk": "-",
        "def": "4",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": "提升對氣絕的抗性"
    },
    {
        "name": "鳥之羽(鳥の羽)",
        "get": [
            "風鳥"
        ],
        "difficulty": "48",
        "attr": "-",
        "atk": "-",
        "def": "-",
        "matk": "3",
        "mdef": "6",
        "str": "-",
        "vit": "-",
        "int": "1",
        "sp": "少許提升對疲勞的抗性"
    },
    {
        "name": "鬥牛之角(闘牛の角)",
        "get": [
            "野牛"
        ],
        "difficulty": "51",
        "attr": "-",
        "atk": "5",
        "def": "-1",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": "更容易吹飛對手"
    },
    {
        "name": "豹爪(豹の爪)",
        "get": [
            "影豹"
        ],
        "difficulty": "67",
        "attr": "-",
        "atk": "-",
        "def": "-3",
        "matk": "-",
        "mdef": "-",
        "str": "1",
        "vit": "-",
        "int": "-",
        "sp": "會心一擊率大幅提升"
    },
    {
        "name": "狼牙(狼の牙)",
        "get": [
            "銀狼"
        ],
        "difficulty": "61",
        "attr": "-",
        "atk": "4",
        "def": "-",
        "matk": "4",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "龍牙(ドラゴンの牙)",
        "get": [
            "迷你龍/小龍"
        ],
        "difficulty": "85",
        "attr": "-",
        "atk": "8",
        "def": "-",
        "matk": "8",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "蝎子的鉗(サソリのはさみ)",
        "get": [
            "蝎子"
        ],
        "difficulty": "40",
        "attr": "-",
        "atk": "5",
        "def": "-",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": "容易使出會心一擊"
    },
    {
        "name": "蝎子的尾巴(サソリの尻尾)",
        "get": [
            "蝎子"
        ],
        "difficulty": "29",
        "attr": "-",
        "atk": "-",
        "def": "-",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": "容易使出毒與會心一擊"
    },
    {
        "name": "堅固的角(強固な角)",
        "get": [
            "甲蟲"
        ],
        "difficulty": "22",
        "attr": "-",
        "atk": "2",
        "def": "4",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": "氣絕率稍提升"
    },
    {
        "name": "結實的蜘蛛絲(丈夫なクモ糸)",
        "get": [
            "蜘蛛"
        ],
        "difficulty": "21",
        "attr": "-",
        "atk": "-",
        "def": "1",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": "會心一擊耐性稍提升"
    },
    {
        "name": "漂亮的蜘蛛絲(キレイなクモ糸)",
        "get": [
            "蜘蛛"
        ],
        "difficulty": "25",
        "attr": "-",
        "atk": "-",
        "def": "2",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": "會心一擊耐性提升"
    },
    {
        "name": "昆蟲的下顎(昆蟲のアゴ)",
        "get": [
            "蜘蛛"
        ],
        "difficulty": "30",
        "attr": "-",
        "atk": "1",
        "def": "-",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": "稍微容易使出會心一擊"
    },
    {
        "name": "蟲皮(蟲の皮)",
        "get": [
            "螞蟻"
        ],
        "difficulty": "17",
        "attr": "-",
        "atk": "-",
        "def": "1",
        "matk": "-",
        "mdef": "2",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": "對毒的抗性少許變強"
    },
    {
        "name": "漂亮的蟲皮(キレイな蟲の皮)",
        "get": [
            "工蜂",
            "甲蟲",
            "螞蟻",
            "殺人螞蟻",
            "蝎子"
        ],
        "difficulty": "34",
        "attr": "-",
        "atk": "-",
        "def": "1",
        "matk": "-",
        "mdef": "4",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": "對毒的抗性提升"
    },
    {
        "name": "錘子的碎片(ハンマーの破片)",
        "get": [
            "牛頭怪"
        ],
        "difficulty": "36",
        "attr": "-",
        "atk": "-",
        "def": "-",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": "容易使對手氣絕、僵直時間變長"
    },
    {
        "name": "巨人的手套(巨人の手袋)",
        "get": [
            "食人魔"
        ],
        "difficulty": "33",
        "attr": "",
        "atk": "1",
        "def": "3",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": "稍微容易使對手氣絕"
    },
    {
        "name": "巨人之爪(巨人の爪)",
        "get": [
            "食人魔"
        ],
        "difficulty": "40",
        "attr": "",
        "atk": "3",
        "def": "1",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": "稍微容易使對手氣絕"
    },
    {
        "name": "維京護肩(バイキングの肩當て)",
        "get": [
            "維京獸人"
        ],
        "difficulty": "62",
        "attr": "-",
        "atk": "-",
        "def": "5",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": "氣絕與會心一擊耐性提升"
    },
    {
        "name": "小結晶(小さな結晶)",
        "get": [
            "史萊姆",
            "黑暗史萊姆"
        ],
        "difficulty": "73",
        "attr": "-",
        "atk": "-",
        "def": "-",
        "matk": "8",
        "mdef": "2",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "魔力之結晶(魔力の結晶)",
        "get": [
            "凍晶",
            "小賢者",
            "小法師",
            "小皇帝",
            "風精靈",
            "火精靈"
        ],
        "difficulty": "81",
        "attr": "-",
        "atk": "-",
        "def": "-",
        "matk": "6",
        "mdef": "7",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": "封印耐性變得非常強"
    },
    {
        "name": "魔法師之粉(魔法使いの粉)",
        "get": [
            "小賢者",
            "小法師",
            "小皇帝"
        ],
        "difficulty": "58",
        "attr": "-",
        "atk": "-",
        "def": "-",
        "matk": "8",
        "mdef": "6",
        "str": "-",
        "vit": "-",
        "int": "3",
        "sp": "封印耐性提升"
    },
    {
        "name": "魔人之角(魔人の角)",
        "get": [
            "牛頭怪",
            "惡魔"
        ],
        "difficulty": "74",
        "attr": "-",
        "atk": "4",
        "def": "-",
        "matk": "5",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "射手的火藥(射手の発火薬)",
        "get": [
            "獸人射手",
            "獸人獵手",
            "哥布林射手",
            "哥布林狙擊手"
        ],
        "difficulty": "39",
        "attr": "-",
        "atk": "-",
        "def": "-",
        "matk": "5",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "哥布林的繃帶(ゴブリンの包帯)",
        "get": [
            "哥布林系列"
        ],
        "difficulty": "45",
        "attr": "-",
        "atk": "-",
        "def": "5",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "骨膠(にかわ)",
        "get": [
            "哥布林系列",
            "獸人系列",
            "維京系列"
        ],
        "difficulty": "48",
        "attr": "-",
        "atk": "-",
        "def": "3",
        "matk": "-",
        "mdef": "2",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": "會心一擊耐性提升，對毒的耐性稍變弱"
    },
    {
        "name": "戰士之證(戦士の証)",
        "get": [
            "獸人騎兵",
            "哥布林"
        ],
        "difficulty": "52",
        "attr": "-",
        "atk": "-",
        "def": "-",
        "matk": "-",
        "mdef": "-",
        "str": "6",
        "vit": "-",
        "int": "-4",
        "sp": ""
    },
    {
        "name": "生鏽的箭頭(さびた矢尻)",
        "get": [
            "哥布林系列",
            "獸人系列"
        ],
        "difficulty": "22",
        "attr": "-",
        "atk": "1",
        "def": "1",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "絲綢(シルクの布)",
        "get": [
            "哥布林海盜",
            "哥布林船長"
        ],
        "difficulty": "66",
        "attr": "-",
        "atk": "-",
        "def": "3",
        "matk": "-",
        "mdef": "2",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": "對毒、麻痹、封印的抗性少許提升"
    },
    {
        "name": "海盜哥布林的布(海賊ゴブリンの布)",
        "get": [
            "哥布林海盜",
            "暴力/流氓哥布林",
            "哥布林船長",
            "哥布林頓"
        ],
        "difficulty": "30",
        "attr": "-",
        "atk": "-",
        "def": "2",
        "matk": "-",
        "mdef": "1",
        "str": "1",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "獸人的破布(オークのボロ布)",
        "get": [
            "獸人"
        ],
        "difficulty": "18",
        "attr": "-",
        "atk": "-",
        "def": "1",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "惡魔之血(悪魔の血)",
        "get": [
            "惡魔",
            "血豹",
            "大惡魔"
        ],
        "difficulty": "65",
        "attr": "-",
        "atk": "-",
        "def": "-",
        "matk": "3",
        "mdef": "4",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": "吸收HP約5%"
    },
    {
        "name": "壞掉的柄(壊れた柄)",
        "get": [
            "怪物箱",
            "貪吃箱"
        ],
        "difficulty": "48",
        "attr": "-",
        "atk": "4",
        "def": "-",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": "攻擊時封印發生率少許提升"
    },
    {
        "name": "壞掉的木箱(壊れた木箱)",
        "get": [
            "怪物箱",
            "貪吃箱"
        ],
        "difficulty": "47",
        "attr": "-",
        "atk": "-",
        "def": "5",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": "全狀態異常抗性少許加強(def率約5%上升)"
    },
    {
        "name": "魚主之鱗/努西之鱗(ヌッシーのうろこ)",
        "get": [
            "阿庫納位元",
            "湖裡釣到"
        ],
        "difficulty": "78",
        "attr": "-",
        "atk": "-",
        "def": "-",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": "吸收HP約10%"
    },
    {
        "name": "たぬきの葉っぱ(貍貓樹葉)",
        "get": [
            "タヌゴロー(塔努格洛)"
        ],
        "difficulty": "34",
        "attr": "-",
        "atk": "8",
        "def": "7",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-6",
        "sp": ""
    },
    {
        "name": "竜の骨(龍骨)",
        "get": [
            "エンシェントボーン(古代龍骨)"
        ],
        "difficulty": "48",
        "attr": "-",
        "atk": "12",
        "def": "-",
        "matk": "1",
        "mdef": "-",
        "str": "-",
        "vit": "-8",
        "int": "-",
        "sp": ""
    },
    {
        "name": "獅子の青毛(獅子的藍毛)",
        "get": [
            "青獅子(藍獅子)"
        ],
        "difficulty": "62",
        "attr": "-",
        "atk": "-2",
        "def": "-6",
        "matk": "15",
        "mdef": "4",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "獅子の赤毛(獅子的紅毛)",
        "get": [
            "赤獅子(紅獅子)"
        ],
        "difficulty": "62",
        "attr": "-",
        "atk": "13",
        "def": "2",
        "matk": "-2",
        "mdef": "-6",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": "麻痹發生率提升"
    },
    {
        "name": "氷壁のかけら(冰壁的碎片)",
        "get": [
            "デスウォール(死亡冰壁)"
        ],
        "difficulty": "76",
        "attr": "-",
        "atk": "-8",
        "def": "10",
        "matk": "5",
        "mdef": "12",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": "提升對吹飛抗性"
    },
    {
        "name": "水竜の羽ビレ(水龍的羽鰭)",
        "get": [
            "アクナビート(阿克納位元)"
        ],
        "difficulty": "83",
        "attr": "-",
        "atk": "10",
        "def": "10",
        "matk": "10",
        "mdef": "10",
        "str": "-",
        "vit": "-",
        "int": "10",
        "sp": ""
    },
    {
        "name": "グレートな胸毛(豪邁胸毛)",
        "get": [
            "グレーターデーモン(終極惡魔)"
        ],
        "difficulty": "65",
        "attr": "-",
        "atk": "10",
        "def": "2",
        "matk": "-",
        "mdef": "-4",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "アンモナイト(鸚鵡螺化石)",
        "get": [
            "オクトパイレーツ(奧科特海盜)"
        ],
        "difficulty": "69",
        "attr": "-",
        "atk": "-",
        "def": "-",
        "matk": "-",
        "mdef": "-",
        "str": "-",
        "vit": "16",
        "int": "-5",
        "sp": ""
    },
    {
        "name": "キメラのしっぽ(奇美拉之尾)",
        "get": [
            "キメラ(奇美拉)"
        ],
        "difficulty": "70",
        "attr": "-",
        "atk": "9",
        "def": "-",
        "matk": "8",
        "mdef": "-",
        "str": "4",
        "vit": "-",
        "int": "8",
        "sp": "毒、麻痹率提升"
    },
    {
        "name": "氷の鼻(冰之鼻)",
        "get": [
            "クリスタルマンモス(水晶猛犸/水晶毛象)"
        ],
        "difficulty": "73",
        "attr": "-",
        "atk": "-",
        "def": "-",
        "matk": "18",
        "mdef": "-6",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "グリモアのうろこ(格利莫亞之鱗)",
        "get": [
            "グリモア(格利莫亞)"
        ],
        "difficulty": "84",
        "attr": "-",
        "atk": "12",
        "def": "2",
        "matk": "14",
        "mdef": "8",
        "str": "2",
        "vit": "2",
        "int": "2",
        "sp": "睡眠發生率提升"
    },
    {
        "name": "動く枝(動枝)",
        "get": [
            "デッドツリー(死亡之樹)"
        ],
        "difficulty": "83",
        "attr": "-",
        "atk": "-",
        "def": "6",
        "matk": "-",
        "mdef": "-",
        "str": "4",
        "vit": "7",
        "int": "-",
        "sp": "容易使對手氣絕"
    },
    {
        "name": "電気の結晶(電氣結晶)",
        "get": [
            "ウーパードラゴン(邪龍)"
        ],
        "difficulty": "83",
        "attr": "-",
        "atk": "8",
        "def": "8",
        "matk": "7",
        "mdef": "7",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": "麻痹發生率提升"
    },
    {
        "name": "歌の小ビン(歌之小瓶)",
        "get": [
            "セイレーン(塞壬)"
        ],
        "difficulty": "83",
        "attr": "-",
        "atk": "-",
        "def": "-10",
        "matk": "15",
        "mdef": "15",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": "給予全狀態異常"
    },
    {
        "name": "ゴーレムの石版(怪力石版)",
        "get": [
            "ゴーレム(怪力/哥勒姆)"
        ],
        "difficulty": "83",
        "attr": "-",
        "atk": "15",
        "def": "15",
        "matk": "-",
        "mdef": "-10",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "地竜のうろこ(地龍之鱗)",
        "get": [
            "プロテグリード(普羅戴格里德)"
        ],
        "difficulty": "85",
        "attr": "-",
        "atk": "-3",
        "def": "26",
        "matk": "-",
        "mdef": "20",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    },
    {
        "name": "火竜のうろこ(火龍之鱗)",
        "get": [
            "フレクザィード(弗雷克扎伊德)"
        ],
        "difficulty": "87",
        "attr": "-",
        "atk": "20",
        "def": "-4",
        "matk": "18",
        "mdef": "-",
        "str": "-",
        "vit": "-",
        "int": "-",
        "sp": ""
    }
];
const decorRec = [
    {
        "category": "盾牌",
        "tab": "shield",
        "active": true,
        "list": [
            {
                "name": "小盾牌",
                "skillLv": "2",
                "item1": "鐵",
                "item2": "鐵",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "青銅盾",
                "skillLv": "8",
                "item1": "銅",
                "item2": "銅",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "傘",
                "skillLv": "17",
                "item1": "鐵",
                "item2": "鐵",
                "item3": "漂亮的蟲皮",
                "item4": "結實的藤",
                "item5": "鳥之羽",
                "item6": ""
            },
            {
                "name": "圓盾",
                "skillLv": "17",
                "item1": "銅",
                "item2": "銅",
                "item3": "鐵",
                "item4": "鐵",
                "item5": "",
                "item6": ""
            },
            {
                "name": "重盾",
                "skillLv": "22",
                "item1": "鐵",
                "item2": "鐵",
                "item3": "鐵",
                "item4": "堅固的角",
                "item5": "",
                "item6": ""
            },
            {
                "name": "魔法之盾",
                "skillLv": "24",
                "item1": "銅",
                "item2": "銅",
                "item3": "紫水晶",
                "item4": "海盜哥布林的布",
                "item5": "",
                "item6": ""
            },
            {
                "name": "海龜盾",
                "skillLv": "34",
                "item1": "龜殼",
                "item2": "龜殼",
                "item3": "龜殼",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "骨盾",
                "skillLv": "36",
                "item1": "銀",
                "item2": "銀",
                "item3": "昆蟲下顎",
                "item4": "鬥牛之角",
                "item5": "鬥牛之角",
                "item6": ""
            },
            {
                "name": "高級盾牌",
                "skillLv": "37",
                "item1": "銀",
                "item2": "銀",
                "item3": "金",
                "item4": "金",
                "item5": "",
                "item6": ""
            },
            {
                "name": "混沌之盾",
                "skillLv": "41",
                "item1": "銀",
                "item2": "銀",
                "item3": "蝎子的尾巴",
                "item4": "蝎子的鉗子",
                "item5": "戰士之證",
                "item6": ""
            },
            {
                "name": "猴子布偶",
                "skillLv": "43",
                "item1": "獸人的破布",
                "item2": "結實的蜘蛛絲",
                "item3": "軟綿綿棉(莫可棉)",
                "item4": "軟綿綿棉(莫可棉)",
                "item5": "",
                "item6": ""
            },
            {
                "name": "騎士盾",
                "skillLv": "50",
                "item1": "銀",
                "item2": "銀",
                "item3": "金",
                "item4": "白金",
                "item5": "鬥牛之角",
                "item6": ""
            },
            {
                "name": "棱鏡之盾",
                "skillLv": "66",
                "item1": "白金",
                "item2": "紫水晶",
                "item3": "紅寶石",
                "item4": "綠寶石",
                "item5": "海藍寶石",
                "item6": "藍寶石"
            },
            {
                "name": "魔力盾牌",
                "skillLv": "67",
                "item1": "金",
                "item2": "金",
                "item3": "骨膠",
                "item4": "魔法師之粉",
                "item5": "魔力結晶",
                "item6": "魔力結晶"
            },
            {
                "name": "元素之盾",
                "skillLv": "69",
                "item1": "銀",
                "item2": "銀",
                "item3": "白金",
                "item4": "鑽石",
                "item5": "魔法師之粉",
                "item6": "妖精之粉"
            },
            {
                "name": "白金盾",
                "skillLv": "75",
                "item1": "白金",
                "item2": "白金",
                "item3": "鑽石",
                "item4": "龍牙",
                "item5": "魔人之角",
                "item6": "惡魔之血"
            },
            {
                "name": "符文之盾",
                "skillLv": "88",
                "item1": "白金",
                "item2": "鑽石",
                "item3": "龍牙",
                "item4": "小結晶",
                "item5": "妖精之粉",
                "item6": "妖精之粉"
            }
        ]
    },
    {
        "category": "頭盔",
        "tab": "helmet",
        "list": [
            {
                "name": "手織帽",
                "skillLv": "9",
                "item1": "毛線球",
                "item2": "",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "集中耳墜",
                "skillLv": "12",
                "item1": "鐵",
                "item2": "生鏽的箭頭",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "飛奔頭巾",
                "skillLv": "16",
                "item1": "海盜哥布林的布",
                "item2": "海盜哥布林的布",
                "item3": "巨人手套",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "氣勢頭巾",
                "skillLv": "32",
                "item1": "獸人的破布",
                "item2": "海盜哥布林的布",
                "item3": "哥布林的繃帶",
                "item4": "哥布林的繃帶",
                "item5": "",
                "item6": ""
            },
            {
                "name": "漂亮帽子",
                "skillLv": "35",
                "item1": "哥布林的繃帶",
                "item2": "鳥之羽",
                "item3": "毛皮",
                "item4": "毛皮",
                "item5": "",
                "item6": ""
            },
            {
                "name": "銀髮簪",
                "skillLv": "38",
                "item1": "銀",
                "item2": "骨膠",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "名牌眼鏡",
                "skillLv": "48",
                "item1": "骨膠",
                "item2": "鬥牛之角",
                "item3": "古代魚之骨",
                "item4": "浮游靈頭巾",
                "item5": "",
                "item6": ""
            },
            {
                "name": "金髮簪",
                "skillLv": "53",
                "item1": "金",
                "item2": "骨膠",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "羽毛帽",
                "skillLv": "61",
                "item1": "鳥之羽",
                "item2": "毛皮",
                "item3": "毛皮",
                "item4": "上質的毛皮",
                "item5": "絲綢",
                "item6": "絲綢"
            },
            {
                "name": "魔女耳墜",
                "skillLv": "65",
                "item1": "金",
                "item2": "毛皮",
                "item3": "銀",
                "item4": "鐵",
                "item5": "魔法師之粉",
                "item6": "銀"
            },
            {
                "name": "魔法師耳墜",
                "skillLv": "82",
                "item1": "銀",
                "item2": "銀",
                "item3": "紅寶石",
                "item4": "紅寶石",
                "item5": "魔力結晶",
                "item6": "魔法師之粉"
            }
        ]
    },
    {
        "category": "鞋子",
        "tab": "shoe",
        "list": [
            {
                "name": "皮靴",
                "skillLv": "7",
                "item1": "毛皮",
                "item2": "毛皮",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "黏黏鞋",
                "skillLv": "9",
                "item1": "獸人的破布",
                "item2": "獸人的破布",
                "item3": "結實的蜘蛛絲",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "拖鞋",
                "skillLv": "10",
                "item1": "蟲皮",
                "item2": "蟲皮",
                "item3": "軟綿綿棉",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "特工靴/內增高靴",
                "skillLv": "11",
                "item1": "鐵",
                "item2": "蟲皮",
                "item3": "蟲皮",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "重靴",
                "skillLv": "14",
                "item1": "鐵",
                "item2": "鐵",
                "item3": "鐵",
                "item4": "鐵",
                "item5": "銅",
                "item6": "銅"
            },
            {
                "name": "跳步鞋",
                "skillLv": "18",
                "item1": "漂亮的蟲皮",
                "item2": "漂亮的蟲皮",
                "item3": "蘑菇孢子",
                "item4": "結實的藤",
                "item5": "",
                "item6": ""
            },
            {
                "name": "銀靴",
                "skillLv": "26",
                "item1": "銅",
                "item2": "銀",
                "item3": "巨人手套",
                "item4": "錘子碎片",
                "item5": "",
                "item6": ""
            },
            {
                "name": "骨靴",
                "skillLv": "31",
                "item1": "龍骨",
                "item2": "",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "飛龍靴",
                "skillLv": "33",
                "item1": "綠寶石",
                "item2": "綠寶石",
                "item3": "昆蟲的下顎",
                "item4": "豹爪",
                "item5": "",
                "item6": ""
            },
            {
                "name": "滑冰鞋",
                "skillLv": "38",
                "item1": "水之結晶",
                "item2": "水之結晶",
                "item3": "龜殼",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "踏雪靴",
                "skillLv": "43",
                "item1": "鐵",
                "item2": "結實的藤",
                "item3": "狼牙",
                "item4": "上質的毛皮",
                "item5": "上質的毛皮",
                "item6": ""
            },
            {
                "name": "金靴",
                "skillLv": "47",
                "item1": "銀",
                "item2": "金",
                "item3": "金",
                "item4": "戰士之證",
                "item5": "毛皮",
                "item6": ""
            },
            {
                "name": "制動靴",
                "skillLv": "49",
                "item1": "巨人手套",
                "item2": "巨人手套",
                "item3": "骨膠",
                "item4": "骨膠",
                "item5": "鬥牛之角",
                "item6": ""
            },
            {
                "name": "騎士靴",
                "skillLv": "51",
                "item1": "銀",
                "item2": "銀",
                "item3": "白金",
                "item4": "維京護肩",
                "item5": "上質的毛皮",
                "item6": "絲綢"
            },
            {
                "name": "水蜘蛛/水云",
                "skillLv": "54",
                "item1": "結實的蜘蛛絲",
                "item2": "結實的蜘蛛絲",
                "item3": "漂亮的蜘蛛絲",
                "item4": "漂亮的蜘蛛絲",
                "item5": "壞掉的木箱",
                "item6": "壞掉的木箱"
            },
            {
                "name": "潛行靴",
                "skillLv": "59",
                "item1": "獸人的破布",
                "item2": "海盜哥布林的布",
                "item3": "骨膠",
                "item4": "軟綿綿棉",
                "item5": "",
                "item6": ""
            },
            {
                "name": "幽靈靴",
                "skillLv": "64",
                "item1": "魔法師之粉",
                "item2": "魔法師之粉",
                "item3": "狼牙",
                "item4": "狼牙",
                "item5": "浮游靈頭巾",
                "item6": ""
            },
            {
                "name": "羽毛靴",
                "skillLv": "71",
                "item1": "昆蟲的下顎",
                "item2": "骨膠",
                "item3": "鳥之羽",
                "item4": "鳥之羽",
                "item5": "毛皮",
                "item6": ""
            },
            {
                "name": "鐵屐鞋",
                "skillLv": "76",
                "item1": "鐵",
                "item2": "鐵",
                "item3": "維京護肩",
                "item4": "維京護肩",
                "item5": "龜殼",
                "item6": ""
            },
            {
                "name": "火箭之風",
                "skillLv": "85",
                "item1": "絲綢",
                "item2": "絲綢",
                "item3": "絲綢",
                "item4": "惡魔之血",
                "item5": "妖精之粉",
                "item6": "妖精之粉"
            },
            {
                "name": "妖精之靴",
                "skillLv": "89",
                "item1": "鑽石",
                "item2": "鑽石",
                "item3": "小結晶",
                "item4": "妖精之粉",
                "item5": "妖精之粉",
                "item6": "妖精之粉"
            }
        ]
    },
    {
        "category": "飾品",
        "tab": "accessories",
        "list": [
            {
                "name": "便宜的腕輪",
                "skillLv": "1",
                "item1": "鐵",
                "item2": "獸人的破布",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "護符",
                "skillLv": "3",
                "item1": "獸人的破布",
                "item2": "結實的蜘蛛絲",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "努力者勞動手套",
                "skillLv": "4",
                "item1": "獸人的破布",
                "item2": "海盜哥布林的布",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "贈送徽章",
                "skillLv": "6",
                "item1": "鐵",
                "item2": "",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "銅腕輪",
                "skillLv": "10",
                "item1": "銅",
                "item2": "獸人的破布",
                "item3": "獸人的破布",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "皮腰帶",
                "skillLv": "13",
                "item1": "毛皮",
                "item2": "毛皮",
                "item3": "漂亮的蟲皮",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "紫水晶戒指",
                "skillLv": "15",
                "item1": "紫水晶",
                "item2": "",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "綠寶石戒指",
                "skillLv": "15",
                "item1": "綠寶石",
                "item2": "",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "藍寶石戒指",
                "skillLv": "15",
                "item1": "藍寶石",
                "item2": "",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "紅寶石戒指",
                "skillLv": "15",
                "item1": "紅寶石",
                "item2": "",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "暗之戒指",
                "skillLv": "15",
                "item1": "骷髏",
                "item2": "",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "水藍寶石戒指",
                "skillLv": "15",
                "item1": "海藍寶石",
                "item2": "",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "結實手套",
                "skillLv": "18",
                "item1": "獸人的破布",
                "item2": "海盜哥布林的布",
                "item3": "軟綿綿棉",
                "item4": "巨人手套",
                "item5": "",
                "item6": ""
            },
            {
                "name": "大地吊墜",
                "skillLv": "19",
                "item1": "純銀吊墜",
                "item2": "地之結晶",
                "item3": "地之結晶",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "純銀吊墜",
                "skillLv": "20",
                "item1": "鐵",
                "item2": "銀",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "求婚戒指",
                "skillLv": "20",
                "item1": "銀",
                "item2": "銀",
                "item3": "紅寶石",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "銀腕輪",
                "skillLv": "25",
                "item1": "銀",
                "item2": "海盜哥布林的布",
                "item3": "海盜哥布林的布",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "劇毒戒指",
                "skillLv": "27",
                "item1": "銅",
                "item2": "蘑菇孢子",
                "item3": "蘑菇孢子",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "麻痹戒指",
                "skillLv": "28",
                "item1": "銅",
                "item2": "植物莖",
                "item3": "植物莖",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "沉默戒指",
                "skillLv": "29",
                "item1": "銅",
                "item2": "燈章魚",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "會心戒指",
                "skillLv": "30",
                "item1": "銀",
                "item2": "堅固的角",
                "item3": "豹爪",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "幸運戒指",
                "skillLv": "30",
                "item1": "鑽石",
                "item2": "四葉草",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "魔力戒指",
                "skillLv": "31",
                "item1": "銀",
                "item2": "魔力結晶",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "草原吊墜",
                "skillLv": "35",
                "item1": "純銀吊墜",
                "item2": "風之結晶",
                "item3": "風之結晶",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "金腕輪",
                "skillLv": "39",
                "item1": "金",
                "item2": "海盜哥布林的布",
                "item3": "海盜哥布林的布",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "心形吊墜",
                "skillLv": "40",
                "item1": "純銀吊墜",
                "item2": "愛之結晶",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "星星吊墜",
                "skillLv": "40",
                "item1": "純銀吊墜",
                "item2": "光之結晶",
                "item3": "暗之結晶",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "力量手套",
                "skillLv": "42",
                "item1": "蟲皮",
                "item2": "蟲皮",
                "item3": "錘子的碎片",
                "item4": "豹爪",
                "item5": "",
                "item6": ""
            },
            {
                "name": "手織圍巾",
                "skillLv": "43",
                "item1": "軟綿綿棉",
                "item2": "軟綿綿棉",
                "item3": "軟綿綿棉",
                "item4": "軟綿綿棉",
                "item5": "軟綿綿棉",
                "item6": "軟綿綿棉"
            },
            {
                "name": "護盾戒指",
                "skillLv": "44",
                "item1": "金",
                "item2": "錘子碎片",
                "item3": "鬥牛之角",
                "item4": "鬥牛之角",
                "item5": "古代魚之骨",
                "item6": ""
            },
            {
                "name": "太陽吊墜",
                "skillLv": "45",
                "item1": "純銀吊墜",
                "item2": "火之結晶",
                "item3": "火之結晶",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "魔斗咒符",
                "skillLv": "46",
                "item1": "魔力結晶",
                "item2": "魔法師之粉",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "白金腕輪",
                "skillLv": "50",
                "item1": "白金",
                "item2": "海盜哥布林的布",
                "item3": "海盜哥布林的布",
                "item4": "古代魚之骨",
                "item5": "",
                "item6": ""
            },
            {
                "name": "神聖護身符",
                "skillLv": "55",
                "item1": "純銀吊墜",
                "item2": "銀",
                "item3": "銀",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "水藍寶石胸針",
                "skillLv": "55",
                "item1": "海藍寶石",
                "item2": "海藍寶石",
                "item3": "海藍寶石",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "紫水晶胸針",
                "skillLv": "55",
                "item1": "紫水晶",
                "item2": "紫水晶",
                "item3": "紫水晶",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "綠寶石胸針",
                "skillLv": "55",
                "item1": "綠寶石",
                "item2": "綠寶石",
                "item3": "綠寶石",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "藍寶石胸針",
                "skillLv": "55",
                "item1": "藍寶石",
                "item2": "藍寶石",
                "item3": "藍寶石",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "紅寶石胸針",
                "skillLv": "55",
                "item1": "紅寶石",
                "item2": "紅寶石",
                "item3": "紅寶石",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "水滴吊墜",
                "skillLv": "58",
                "item1": "純銀吊墜",
                "item2": "水之結晶",
                "item3": "水之結晶",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "鑽石戒指",
                "skillLv": "60",
                "item1": "鑽石",
                "item2": "鑽石",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "冠軍腰帶",
                "skillLv": "63",
                "item1": "金",
                "item2": "戰士之證",
                "item3": "上質的毛皮",
                "item4": "絲綢",
                "item5": "",
                "item6": ""
            },
            {
                "name": "鑽石胸針",
                "skillLv": "64",
                "item1": "鑽石",
                "item2": "鑽石",
                "item3": "鑽石",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "純銀戒指",
                "skillLv": "65",
                "item1": "銀",
                "item2": "銀",
                "item3": "銀",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "不戰十字架",
                "skillLv": "68",
                "item1": "銀",
                "item2": "銀",
                "item3": "漂亮的蜘蛛絲",
                "item4": "漂亮的蜘蛛絲",
                "item5": "",
                "item6": ""
            },
            {
                "name": "黃金戒指",
                "skillLv": "70",
                "item1": "金",
                "item2": "金",
                "item3": "金",
                "item4": "金",
                "item5": "",
                "item6": ""
            },
            {
                "name": "護身符",
                "skillLv": "71",
                "item1": "白金",
                "item2": "白金",
                "item3": "漂亮的蜘蛛絲",
                "item4": "漂亮的蜘蛛絲",
                "item5": "",
                "item6": ""
            },
            {
                "name": "厚厚圍巾",
                "skillLv": "72",
                "item1": "軟綿綿棉",
                "item2": "毛線球",
                "item3": "毛線球",
                "item4": "毛線球",
                "item5": "毛線球",
                "item6": "毛線球"
            },
            {
                "name": "豪傑之證",
                "skillLv": "73",
                "item1": "金",
                "item2": "魔人之角",
                "item3": "龍牙",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "賢者之證",
                "skillLv": "74",
                "item1": "金",
                "item2": "魔法師之粉",
                "item3": "妖精之粉",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "白金戒指",
                "skillLv": "75",
                "item1": "白金",
                "item2": "白金",
                "item3": "白金",
                "item4": "白金",
                "item5": "白金",
                "item6": ""
            },
            {
                "name": "會心之證",
                "skillLv": "78",
                "item1": "會心戒指",
                "item2": "狼牙",
                "item3": "魔人之角",
                "item4": "龍牙",
                "item5": "",
                "item6": ""
            },
            {
                "name": "鋼鐵的極意",
                "skillLv": "90",
                "item1": "白金",
                "item2": "鑽石",
                "item3": "龜殼",
                "item4": "上質的毛皮",
                "item5": "龍牙",
                "item6": "壞掉的木箱"
            },
            {
                "name": "必殺的極意",
                "skillLv": "91",
                "item1": "白金",
                "item2": "鬥牛之角",
                "item3": "狼牙",
                "item4": "魔人之角",
                "item5": "龍牙",
                "item6": "骷髏"
            },
            {
                "name": "魔道的極意",
                "skillLv": "92",
                "item1": "白金",
                "item2": "魔法師之粉",
                "item3": "浮游靈的頭巾",
                "item4": "惡魔之血",
                "item5": "小結晶",
                "item6": "妖精之粉"
            },
            {
                "name": "風之戒指",
                "skillLv": "93",
                "item1": "白金",
                "item2": "風之結晶",
                "item3": "風之結晶",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "地之戒指",
                "skillLv": "94",
                "item1": "白金",
                "item2": "地之結晶",
                "item3": "地之結晶",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "火之戒指",
                "skillLv": "95",
                "item1": "白金",
                "item2": "火之結晶",
                "item3": "火之結晶",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "水之戒指",
                "skillLv": "96",
                "item1": "白金",
                "item2": "水之結晶",
                "item3": "水之結晶",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "勇氣徽章",
                "skillLv": "99",
                "item1": "贈送徽章",
                "item2": "戰士之證",
                "item3": "骨膠",
                "item4": "光之結晶",
                "item5": "暗之結晶",
                "item6": "愛之結晶"
            }
        ]
    },
    {
        "category": "收集品",
        "tab": "collection",
        "list": [
            {
                "name": "毛線球",
                "skillLv": "5",
                "item1": "軟毛",
                "item2": "軟毛",
                "item3": "軟毛",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "毛線球",
                "skillLv": "6",
                "item1": "軟軟的毛",
                "item2": "",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            },
            {
                "name": "毛線球",
                "skillLv": "7",
                "item1": "軟軟綿綿的毛",
                "item2": "",
                "item3": "",
                "item4": "",
                "item5": "",
                "item6": ""
            }
        ]
    }
];
const acceCap = [
    {
        "name": "便宜的腕輪 (安物の腕輪)",
        "attr": "",
        "sp": [
            "魔防+16"
        ],
        "se": "",
        "buy": "560",
        "sell": "80",
        "notion": ""
    },
    {
        "name": "護符 (お守り)",
        "attr": "",
        "sp": [],
        "se": "會心一擊耐性提高",
        "buy": "420",
        "sell": "60",
        "notion": ""
    },
    {
        "name": "努力者勞動手套 (がんばり屋の軍手)",
        "attr": "",
        "sp": [
            "攻擊+15"
        ],
        "se": "攻擊時僵直時間增加",
        "buy": "630",
        "sell": "80",
        "notion": ""
    },
    {
        "name": "贈送徽章 (おまけのバッヂ)",
        "attr": "",
        "sp": [
            "體力+10"
        ],
        "se": "",
        "buy": "770",
        "sell": "60",
        "notion": ""
    },
    {
        "name": "銅腕輪 (銅の腕輪)",
        "attr": "",
        "sp": [
            "魔防+35"
        ],
        "se": "",
        "buy": "1190",
        "sell": "170",
        "notion": ""
    },
    {
        "name": "皮腰帶 (皮のベルト)",
        "attr": "",
        "sp": [
            "防禦+30"
        ],
        "se": "",
        "buy": "1120",
        "sell": "160",
        "notion": ""
    },
    {
        "name": "紫水晶戒指 (アメジストの指輪)",
        "attr": "地",
        "sp": [],
        "se": "土屬性的傷害減半",
        "buy": "1980",
        "sell": "330",
        "notion": ""
    },
    {
        "name": "綠寶石戒指 (エメラルドの指輪)",
        "attr": "風",
        "sp": [],
        "se": "風屬性的傷害減半",
        "buy": "2180",
        "sell": "640",
        "notion": ""
    },
    {
        "name": "藍寶石戒指 (サファイアの指輪)",
        "attr": "光",
        "sp": [],
        "se": "光屬性的傷害減半",
        "buy": "2580",
        "sell": "1210",
        "notion": ""
    },
    {
        "name": "紅寶石戒指 (ルビーの指輪)",
        "attr": "火",
        "sp": [],
        "se": "火屬性的傷害減半",
        "buy": "2180",
        "sell": "610",
        "notion": ""
    },
    {
        "name": "暗之戒指 (闇の指輪)",
        "attr": "暗",
        "sp": [],
        "se": "暗屬性的傷害減半",
        "buy": "2580",
        "sell": "1200",
        "notion": ""
    },
    {
        "name": "水藍寶石戒指 (アクアマリンの指輪)",
        "attr": "水",
        "sp": [],
        "se": "水屬性的傷害減半",
        "buy": "2380",
        "sell": "980",
        "notion": ""
    },
    {
        "name": "結實的手套 (丈夫な手袋)",
        "attr": "",
        "sp": [
            "攻擊+30"
        ],
        "se": "攻擊時僵直時間增加",
        "buy": "2030",
        "sell": "270",
        "notion": ""
    },
    {
        "name": "大地吊墜 (大地のペンダント)",
        "attr": "地",
        "sp": [],
        "se": "地屬性的傷害減半，活躍種子的能力上升",
        "buy": "3800",
        "sell": "800",
        "notion": ""
    },
    {
        "name": "純銀吊墜 (シルバーペンダント)",
        "attr": "",
        "sp": [
            "魔攻+25"
        ],
        "se": "",
        "buy": "2870",
        "sell": "390",
        "notion": ""
    },
    {
        "name": "銀腕輪 (銀の腕輪)",
        "attr": "",
        "sp": [
            "魔防+52"
        ],
        "se": "",
        "buy": "3430",
        "sell": "530",
        "notion": ""
    },
    {
        "name": "訂婚戒指",
        "attr": "",
        "sp": [],
        "se": "",
        "buy": "",
        "sell": "",
        "notion": ""
    },
    {
        "name": "劇毒戒指 (ポイズンリング)",
        "attr": "",
        "sp": [],
        "se": "攻擊時令對方陷入中毒狀態",
        "buy": "4890",
        "sell": "250",
        "notion": ""
    },
    {
        "name": "麻痹戒指 (パラライズリング)",
        "attr": "",
        "sp": [],
        "se": "攻擊時令對方陷入麻痹狀態",
        "buy": "4890",
        "sell": "280",
        "notion": ""
    },
    {
        "name": "沉默戒指 (サイレントリング)",
        "attr": "",
        "sp": [],
        "se": "攻擊時令對方陷入封印狀態",
        "buy": "4890",
        "sell": "1500",
        "notion": ""
    },
    {
        "name": "會心戒指 (クリティカルリング)",
        "attr": "",
        "sp": [],
        "se": "提高會心一擊的發生率",
        "buy": "6460",
        "sell": "580",
        "notion": ""
    },
    {
        "name": "幸運戒指 (幸せの指輪)",
        "attr": "",
        "sp": [],
        "se": "提升道具掉落率",
        "buy": "9999",
        "sell": "4444",
        "notion": ""
    },
    {
        "name": "魔力戒指 (マジックリング)",
        "attr": "",
        "sp": [],
        "se": "蓄力速度提升",
        "buy": "6970",
        "sell": "760",
        "notion": ""
    },
    {
        "name": "草原吊墜 (草原のペンダント)",
        "attr": "風",
        "sp": [],
        "se": "風屬性的傷害減半，同伴魔物的能力上升",
        "buy": "9600",
        "sell": "1250",
        "notion": ""
    },
    {
        "name": "金腕輪 (金の腕輪)",
        "attr": "",
        "sp": [
            "魔防+70"
        ],
        "se": "",
        "buy": "7500",
        "sell": "830",
        "notion": ""
    },
    {
        "name": "心形吊墜 (ハートのペンダント)",
        "attr": "",
        "sp": [],
        "se": "技能經驗值提升",
        "buy": "13720",
        "sell": "1530",
        "notion": ""
    },
    {
        "name": "星星吊墜 (星のペンダント)",
        "attr": "愛",
        "sp": [],
        "se": "經驗值提升",
        "buy": "14800",
        "sell": "1660",
        "notion": ""
    },
    {
        "name": "力量手套 (パワーグローブ)",
        "attr": "",
        "sp": [
            "攻擊+65"
        ],
        "se": "攻擊時僵直時間增加相當多",
        "buy": "12520",
        "sell": "1020",
        "notion": ""
    },
    {
        "name": "手織圍巾 (手編みのマフラー)",
        "attr": "",
        "sp": [],
        "se": "RP消耗量減半(有時無效)",
        "buy": "8850",
        "sell": "1066",
        "notion": "對奧義等技能無效"
    },
    {
        "name": "護盾戒指 (シールドリング)",
        "attr": "",
        "sp": [
            "防禦+42"
        ],
        "se": "偶爾會將受到的傷害控制到1",
        "buy": "16450",
        "sell": "2300",
        "notion": ""
    },
    {
        "name": "太陽吊墜 (太陽のペンダント)",
        "attr": "火",
        "sp": [],
        "se": "火屬性的傷害減半，同伴人物的能力上升",
        "buy": "16200",
        "sell": "1980",
        "notion": ""
    },
    {
        "name": "魔斗咒符 (魔闘の呪符)",
        "attr": "",
        "sp": [],
        "se": "攻擊時，力和魔力高的優先計算傷害",
        "buy": "14760",
        "sell": "1050",
        "notion": ""
    },
    {
        "name": "白金腕輪 (プラチナの腕輪)",
        "attr": "",
        "sp": [
            "魔防+98"
        ],
        "se": "",
        "buy": "23370",
        "sell": "2140",
        "notion": ""
    },
    {
        "name": "神聖護身符 (ホーリーアミュレット)",
        "attr": "暗",
        "sp": [],
        "se": "暗屬性的傷害激減",
        "buy": "19800",
        "sell": "2150",
        "notion": ""
    },
    {
        "name": "水藍寶石胸針 (アクアマリンブローチ)",
        "attr": "水",
        "sp": [],
        "se": "水屬性的傷害激減",
        "buy": "19800",
        "sell": "4500",
        "notion": ""
    },
    {
        "name": "紫水晶胸針 (アメジストブローチ)",
        "attr": "地",
        "sp": [],
        "se": "土屬性的傷害激減",
        "buy": "19800",
        "sell": "1530",
        "notion": ""
    },
    {
        "name": "綠寶石胸針 (エメラルドブローチ)",
        "attr": "風",
        "sp": [],
        "se": "風屬性的傷害激減",
        "buy": "19800",
        "sell": "2970",
        "notion": ""
    },
    {
        "name": "藍寶石胸針 (サファイアブローチ)",
        "attr": "光",
        "sp": [],
        "se": "光屬性的傷害激減",
        "buy": "19800",
        "sell": "5620",
        "notion": ""
    },
    {
        "name": "紅寶石胸針 (ルビーブローチ)",
        "attr": "火",
        "sp": [],
        "se": "火屬性的傷害激減",
        "buy": "19800",
        "sell": "2810",
        "notion": ""
    },
    {
        "name": "水滴吊墜 (雫のペンダント)",
        "attr": "水",
        "sp": [],
        "se": "暗屬性的傷害減半，農具的功擊力提升",
        "buy": "24800",
        "sell": "2250",
        "notion": ""
    },
    {
        "name": "鑽石戒指 (ダイヤモンドの指輪)",
        "attr": "",
        "sp": [
            "體力+50"
        ],
        "se": "睡眠、疲勞、疾病、HP吸收完全防禦",
        "buy": "59710",
        "sell": "5880",
        "notion": ""
    },
    {
        "name": "冠軍腰帶 (チャンピオンベルト)",
        "attr": "",
        "sp": [
            "體力+50"
        ],
        "se": "",
        "buy": "87300",
        "sell": "2370",
        "notion": ""
    },
    {
        "name": "鑽石胸針 (ダイヤモンドブローチ)",
        "attr": "",
        "sp": [],
        "se": "全部狀態異常無效化",
        "buy": "99250",
        "sell": "9650",
        "notion": ""
    },
    {
        "name": "純銀戒指 (シルバーリング)",
        "attr": "光暗",
        "sp": [],
        "se": "光屬性與暗屬性的傷害減半",
        "buy": "71400",
        "sell": "5410",
        "notion": ""
    },
    {
        "name": "不戰十字架 (不戦のロザリオ)",
        "attr": "",
        "sp": [],
        "se": "一般魔物不出現",
        "buy": "16230",
        "sell": "1930",
        "notion": ""
    },
    {
        "name": "黃金戒指 (ゴールドリング)",
        "attr": "火水土風",
        "sp": [],
        "se": "減輕火水土風屬性的傷害",
        "buy": "183400",
        "sell": "8370",
        "notion": ""
    },
    {
        "name": "護身符 (タリスマン)",
        "attr": "",
        "sp": [],
        "se": "逆轉毒、麻痹、疲勞、感冒狀態異常的效果",
        "buy": "164830",
        "sell": "7080",
        "notion": ""
    },
    {
        "name": "厚厚圍巾 (もこもこのマフラー)",
        "attr": "",
        "sp": [
            "體力+40"
        ],
        "se": "RP不消耗(有時無效)",
        "buy": "170280",
        "sell": "7040",
        "notion": "對奧義等技能無效"
    },
    {
        "name": "豪傑之證 (豪傑の証)",
        "attr": "",
        "sp": [
            "防禦+50"
        ],
        "se": "HP持續回復",
        "buy": "186030",
        "sell": "8300",
        "notion": ""
    },
    {
        "name": "賢者之證 (賢者の証)",
        "attr": "",
        "sp": [
            "魔防+50"
        ],
        "se": "RP持續回復",
        "buy": "187270",
        "sell": "8620",
        "notion": ""
    },
    {
        "name": "白金戒指 (プラチナリング)",
        "attr": "火水土風光暗",
        "sp": [],
        "se": "減輕全部屬性的傷害",
        "buy": "205710",
        "sell": "7970",
        "notion": ""
    },
    {
        "name": "會心之證 (クリティカセブン)",
        "attr": "",
        "sp": [],
        "se": "提高會心一擊的發生率",
        "buy": "77777",
        "sell": "7777",
        "notion": ""
    },
    {
        "name": "鋼鐵的極意 (鋼鉄の極意)",
        "attr": "",
        "sp": [
            "體力+50"
        ],
        "se": "受攻擊時僵直時間減半",
        "buy": "483420",
        "sell": "43192",
        "notion": ""
    },
    {
        "name": "必殺的極意 (必殺の極意)",
        "attr": "",
        "sp": [
            "力量+50"
        ],
        "se": "武器的攻擊範圍變廣",
        "buy": "524170",
        "sell": "48875",
        "notion": ""
    },
    {
        "name": "魔道的極意 (魔道の極意)",
        "attr": "",
        "sp": [
            "智力+50"
        ],
        "se": "無屬性的物理攻擊傷害減半",
        "buy": "538920",
        "sell": "48409",
        "notion": ""
    },
    {
        "name": "風之戒指 (風の指輪)",
        "attr": "風",
        "sp": [],
        "se": "風屬性傷害無效化，土屬性弱點增加",
        "buy": "680000",
        "sell": "23900",
        "notion": ""
    },
    {
        "name": "地之戒指 (地の指輪)",
        "attr": "地",
        "sp": [],
        "se": "地屬性傷害無效化，風屬性弱點增加",
        "buy": "680000",
        "sell": "23900",
        "notion": ""
    },
    {
        "name": "火之戒指 (火の指輪)",
        "attr": "火",
        "sp": [],
        "se": "火屬性傷害無效化，水屬性弱點增加",
        "buy": "680000",
        "sell": "23900",
        "notion": ""
    },
    {
        "name": "水之戒指 (水の指輪)",
        "attr": "水",
        "sp": [],
        "se": "水屬性傷害無效化，火屬性弱點增加",
        "buy": "680000",
        "sell": "23900",
        "notion": ""
    },
    {
        "name": "勇氣徽章 (勇気のバッヂ)",
        "attr": "",
        "sp": [
            "攻擊+99",
            "防禦+99",
            "魔攻+99",
            "魔防+99",
            "力量+99",
            "體力+99",
            "智力+99"
        ],
        "se": "不容易受到會心一擊和氣絕，全狀態異常抗性提高",
        "buy": "1000000",
        "sell": "59800",
        "notion": ""
    }
];
const shoeCap = [
    {
        "name": "皮靴 (レザーブーツ)",
        "def": "14",
        "mdef": "0",
        "sp": [],
        "se": "",
        "buy": "770",
        "sell": "110"
    },
    {
        "name": "黏黏鞋 (ぬめぬめブーツ)",
        "def": "0",
        "mdef": "0",
        "sp": [
            "智力-5"
        ],
        "se": "容易使出會心一擊",
        "buy": "630",
        "sell": "90"
    },
    {
        "name": "拖鞋 (ピヨピヨサンダル)",
        "def": "14",
        "mdef": "0",
        "sp": [],
        "se": "走路時發出特別音效",
        "buy": "910",
        "sell": "130"
    },
    {
        "name": "內增高鞋/特務靴 (シークレットシューズ)",
        "def": "20",
        "mdef": "0",
        "sp": [],
        "se": "",
        "buy": "1050",
        "sell": "150"
    },
    {
        "name": "重鞋 (へヴィブーツ)",
        "def": "26",
        "mdef": "0",
        "sp": [],
        "se": "吹飛耐性提升、疲勞耐性提升",
        "buy": "",
        "sell": ""
    },
    {
        "name": "跳步鞋/舞步鞋 (ステステスニーカー)",
        "def": "32",
        "mdef": "0",
        "sp": [],
        "se": "裝備後步行變得容易",
        "buy": "",
        "sell": ""
    },
    {
        "name": "銀靴 (シルバーブーツ)",
        "def": "40",
        "mdef": "0",
        "sp": [],
        "se": "",
        "buy": "4560",
        "sell": "880"
    },
    {
        "name": "骨靴 (ボーンブーツ)",
        "def": "68",
        "mdef": "0",
        "sp": [],
        "se": "",
        "buy": "8800",
        "sell": "3000"
    },
    {
        "name": "飛龍靴/闊步靴 (ストライダーブーツ)",
        "def": "25",
        "mdef": "25",
        "sp": [
            "攻擊+25",
            "魔攻+25"
        ],
        "se": "每一步距離變大",
        "buy": "12140",
        "sell": "2020"
    },
    {
        "name": "滑冰鞋 (スケートブーツ)",
        "def": "0",
        "mdef": "60",
        "sp": [],
        "se": "很滑",
        "buy": "",
        "sell": ""
    },
    {
        "name": "雪地靴/踏雪靴 (かんじき)",
        "def": "40",
        "mdef": "15",
        "sp": [],
        "se": "不會打滑",
        "buy": "9840",
        "sell": "2120"
    },
    {
        "name": "金靴 (ゴールドブーツ)",
        "def": "92",
        "mdef": "0",
        "sp": [],
        "se": "",
        "buy": "14860",
        "sell": "2480"
    },
    {
        "name": "制動靴 (ステップインブーツ)",
        "def": "70",
        "mdef": "40",
        "sp": [],
        "se": "無法使用衝刺攻擊",
        "buy": "19860",
        "sell": "1080"
    },
    {
        "name": "騎士靴 (ナイトブーツ)",
        "def": "144",
        "mdef": "0",
        "sp": [
            "力量+5"
        ],
        "se": "",
        "buy": "48350",
        "sell": "4050"
    },
    {
        "name": "水云/水蜘蛛 (みずぐも)",
        "def": "83",
        "mdef": "0",
        "sp": [],
        "se": "可以在水上步行",
        "buy": "50220",
        "sell": "1460"
    },
    {
        "name": "潛行靴 (スニーキングブーツ)",
        "def": "0",
        "mdef": "0",
        "sp": [],
        "se": "降低怪物的警戒距離",
        "buy": "182310",
        "sell": "1530"
    },
    {
        "name": "幽靈靴 (ゴーストブーツ)",
        "def": "128",
        "mdef": "0",
        "sp": [],
        "se": "移動速度增加",
        "buy": "100580",
        "sell": "2940"
    },
    {
        "name": "羽毛靴 (フェザーブーツ)",
        "def": "98",
        "mdef": "128",
        "sp": [],
        "se": "",
        "buy": "56790",
        "sell": "4970"
    },
    {
        "name": "鐵屐鞋 (テツゲタシューズ)",
        "def": "150",
        "mdef": "90",
        "sp": [],
        "se": "移動速度下降",
        "buy": "91060",
        "sell": "2180"
    },
    {
        "name": "火箭之風 (ロケットウイング)",
        "def": "0",
        "mdef": "0",
        "sp": [],
        "se": "移動速度大幅增加，會心一擊耐性降低",
        "buy": "237030",
        "sell": "5290"
    },
    {
        "name": "妖精之靴 (フェアリーブーツ)",
        "def": "217",
        "mdef": "50",
        "sp": [],
        "se": "各狀態異常抗性稍加強",
        "buy": "288060",
        "sell": "18580"
    }
];
const hetCap = [
    {
        "name": "手織帽 (手編みのニット)",
        "def": "0",
        "mdef": "15",
        "sp": [
            "魔攻+15"
        ],
        "se": "",
        "buy": "1400",
        "sell": "100"
    },
    {
        "name": "集中耳墜 (集中のイヤリング)",
        "def": "5",
        "mdef": "5",
        "sp": [],
        "se": "",
        "buy": "980",
        "sell": "760"
    },
    {
        "name": "飛奔頭巾 (おはしな頭巾)",
        "def": "15",
        "mdef": "12",
        "sp": [],
        "se": "",
        "buy": "1890",
        "sell": "270"
    },
    {
        "name": "氣勢頭巾 (どすこいハチマキ)",
        "def": "32",
        "mdef": "27",
        "sp": [
            "攻擊+20"
        ],
        "se": "麻痹耐性提升",
        "buy": "6360",
        "sell": "480"
    },
    {
        "name": "漂亮帽子 (おしゃれな帽子)",
        "def": "45",
        "mdef": "45",
        "sp": [],
        "se": "",
        "buy": "13850",
        "sell": "550"
    },
    {
        "name": "銀髮簪 (銀のかんざし)",
        "def": "0",
        "mdef": "62",
        "sp": [
            "魔攻+30"
        ],
        "se": "",
        "buy": "9950",
        "sell": "570"
    },
    {
        "name": "名牌眼鏡 (ブランドメガネ)",
        "def": "60",
        "mdef": "60",
        "sp": [
            "力量+15"
        ],
        "se": "",
        "buy": "30670",
        "sell": "1810"
    },
    {
        "name": "金髮簪 (金のかんざし)",
        "def": "20",
        "mdef": "80",
        "sp": [
            "魔攻+50"
        ],
        "se": "封印耐性稍微提升",
        "buy": "24950",
        "sell": "1850"
    },
    {
        "name": "羽毛帽 (羽付き帽子)",
        "def": "112",
        "mdef": "98",
        "sp": [],
        "se": "",
        "buy": "72810",
        "sell": "2830"
    },
    {
        "name": "魔女的耳環 (魔女のピアス)",
        "def": "30",
        "mdef": "112",
        "sp": [
            "魔攻+80 智力+20"
        ],
        "se": "暗屬性的傷害減半，很難受到封印",
        "buy": "103020",
        "sell": "4860"
    },
    {
        "name": "魔法師的耳墜 (魔法石のイヤリング)",
        "def": "50",
        "mdef": "250",
        "sp": [],
        "se": "光屬性的傷害減半，很難受到封印",
        "buy": "448690",
        "sell": "12670"
    }
];
const shieldCap = [
    {
        "name": "小盾牌 (スモールシールド)",
        "def": "6",
        "attr": "",
        "sp": [],
        "se": "",
        "buy": "530",
        "sell": "110"
    },
    {
        "name": "青銅盾 (ブロンズシールド)",
        "def": "12",
        "attr": "",
        "sp": [],
        "se": "",
        "buy": "1210",
        "sell": "320"
    },
    {
        "name": "圓盾 (ラウンドシールド)",
        "def": "21",
        "attr": "",
        "sp": [],
        "se": "",
        "buy": "5870",
        "sell": "820"
    },
    {
        "name": "傘 (かさ)",
        "def": "8",
        "attr": "",
        "sp": [
            "魔防+20"
        ],
        "se": "",
        "buy": "3990",
        "sell": "3780"
    },
    {
        "name": "重盾 (ヘヴィシールド)",
        "def": "28",
        "attr": "",
        "sp": [],
        "se": "不容易受到會心一擊",
        "buy": "7200",
        "sell": "1120"
    },
    {
        "name": "魔法之盾 (マジックシールド)",
        "def": "0",
        "attr": "",
        "sp": [
            "魔防+42",
            "智力+15"
        ],
        "se": "防禦封印攻擊配合杖的話效果倍增",
        "buy": "9830",
        "sell": "2210"
    },
    {
        "name": "海龜盾 (タートルシールド)",
        "def": "43",
        "attr": "",
        "sp": [],
        "se": "抵抗吹飛耐性提升",
        "buy": "12500",
        "sell": "3050"
    },
    {
        "name": "骨盾 (ボーンシールド)",
        "def": "36",
        "attr": "",
        "sp": [
            "魔攻+20"
        ],
        "se": "",
        "buy": "19700",
        "sell": "4320"
    },
    {
        "name": "高級盾牌 (カイトシールド)",
        "def": "61",
        "attr": "",
        "sp": [],
        "se": "抵抗氣絕耐性提升",
        "buy": "28000",
        "sell": "5930"
    },
    {
        "name": "混沌之盾 (カオスシールド)",
        "def": "18",
        "attr": "",
        "sp": [
            "魔攻+50"
        ],
        "se": "對毒、麻痹、封印的耐性提高",
        "buy": "29900",
        "sell": "5020"
    },
    {
        "name": "猴子布偶 (サルのぬいぐるみ)",
        "def": "55",
        "attr": "愛",
        "sp": [
            "魔防+12"
        ],
        "se": "",
        "buy": "1100",
        "sell": "900"
    },
    {
        "name": "騎士盾 (ナイトシールド)",
        "def": "85",
        "attr": "",
        "sp": [],
        "se": "很難受到氣絕與會心一擊",
        "buy": "85600",
        "sell": "10380"
    },
    {
        "name": "棱鏡之盾 (プリズムシールド)",
        "def": "0",
        "attr": "",
        "sp": [
            "魔防+96",
            "智力+30"
        ],
        "se": "不受封印攻擊",
        "buy": "146620",
        "sell": "19200"
    },
    {
        "name": "魔力盾牌 (マジカルシールド)",
        "def": "45",
        "attr": "",
        "sp": [
            "魔防+120"
        ],
        "se": "",
        "buy": "194500",
        "sell": "11310"
    },
    {
        "name": "元素之盾 (エレメンタルシールド)",
        "def": "90",
        "attr": "火水地風",
        "sp": [],
        "se": "水火地風屬性的傷害減半",
        "buy": "255000",
        "sell": "23870"
    },
    {
        "name": "白金盾 (プラチナシールド)",
        "def": "180",
        "attr": "",
        "sp": [
            "力量+20"
        ],
        "se": "相當難受到氣絕與會心一擊",
        "buy": "372000",
        "sell": "33180"
    },
    {
        "name": "符文之盾 (ルーンシールド)",
        "def": "150",
        "attr": "光暗",
        "sp": [
            "魔防+150"
        ],
        "se": "光與暗屬性的傷害減半",
        "buy": "488000",
        "sell": "35570"
    }
];
const cropInfo = [
    {
        "category": "春季",
        "tab": "spring",
        "active": true,
        "list": [
            {
                "name": "サクラカブ(櫻色蕪菁)",
                "seedBuy": "80",
                "seedSell": "8",
                "matureDay": "3(1)",
                "crop": "不可",
                "cropBuy": "400",
                "cropSell": "200",
                "Lv10Sell": "240",
                "sp": [
                    "HP+5",
                    "RP+5"
                ],
                "time": "3"
            },
            {
                "name": "キャベツ(捲心菜)",
                "seedBuy": "100",
                "seedSell": "10",
                "matureDay": "6(2)",
                "crop": "不可",
                "cropBuy": "1920",
                "cropSell": "480",
                "Lv10Sell": "960",
                "sp": [
                    "HP+10",
                    "HP上限+10",
                    "體力+2"
                ],
                "time": "3"
            },
            {
                "name": "イチゴ(草莓)",
                "seedBuy": "260",
                "seedSell": "26",
                "matureDay": "9(3)",
                "crop": "2日",
                "cropBuy": "2160",
                "cropSell": "720",
                "Lv10Sell": "864",
                "sp": [
                    "RP+6%",
                    "智力+1"
                ],
                "time": "3"
            },
            {
                "name": "タマネギ(洋蔥)",
                "seedBuy": "110",
                "seedSell": "11",
                "matureDay": "12(4)",
                "crop": "不可",
                "cropBuy": "3120",
                "cropSell": "780",
                "Lv10Sell": "1560",
                "sp": [
                    "HP+20",
                    "RP+30",
                    "HP上限+5"
                ],
                "time": "3"
            },
            {
                "name": "オトメロン(少女甜瓜)",
                "seedBuy": "620",
                "seedSell": "62",
                "matureDay": "7(3)",
                "crop": "不可",
                "cropBuy": "12600",
                "cropSell": "4200",
                "Lv10Sell": "6300",
                "sp": [
                    "HP+50",
                    "RP+30",
                    "HP上限+5"
                ],
                "time": "3"
            },
            {
                "name": "金のキャベツ(金捲心菜)",
                "seedBuy": "230",
                "seedSell": "23",
                "matureDay": "14(5)",
                "crop": "不可",
                "cropBuy": "19000",
                "cropSell": "3800",
                "Lv10Sell": "11400",
                "sp": [
                    "HP+50",
                    "HP上限+50",
                    "體力+6"
                ],
                "time": "3"
            },
            {
                "name": "トイハーブ(托伊藥草)",
                "seedBuy": "60",
                "seedSell": "6",
                "matureDay": "2(1)",
                "crop": "不可",
                "cropBuy": "1260",
                "cropSell": "180",
                "Lv10Sell": "900",
                "sp": [
                    "HP+2%",
                    "RP+15%",
                    "恢復疲勞"
                ],
                "time": "3"
            },
            {
                "name": "ムーンドロップ草(月落草)",
                "seedBuy": "70",
                "seedSell": "7",
                "matureDay": "7(3)",
                "crop": "不可",
                "cropBuy": "4200",
                "cropSell": "600",
                "Lv10Sell": "3000",
                "sp": [
                    "RP+15%",
                    "智力+6%"
                ],
                "time": "3"
            },
            {
                "name": "サクラ草(櫻花草)",
                "seedBuy": "120",
                "seedSell": "12",
                "matureDay": "6(2)",
                "crop": "不可",
                "cropBuy": "6020",
                "cropSell": "860",
                "Lv10Sell": "4300",
                "sp": [
                    "RP+15%"
                ],
                "time": "3"
            },
            {
                "name": "ランプ草(燈草)",
                "seedBuy": "480",
                "seedSell": "48",
                "matureDay": "18(6)",
                "crop": "不可",
                "cropBuy": "32060",
                "cropSell": "4580",
                "Lv10Sell": "22900",
                "sp": [
                    "HP+10%",
                    "RP+15%"
                ],
                "time": "3"
            },
            {
                "name": "青水晶(青水晶)",
                "seedBuy": "700",
                "seedSell": "70",
                "matureDay": "16(6)",
                "crop": "不可",
                "cropBuy": "49000",
                "cropSell": "7000",
                "Lv10Sell": "35000",
                "sp": [
                    "HP+20%",
                    "RP+15%"
                ],
                "time": "3"
            },
            {
                "name": "金剛花(金剛花)",
                "seedBuy": "1000",
                "seedSell": "100",
                "matureDay": "27(9)",
                "crop": "不可",
                "cropBuy": "89600",
                "cropSell": "12800",
                "Lv10Sell": "64000",
                "sp": [
                    "HP+50%",
                    "RP+15%",
                    "體力+15"
                ],
                "time": "3"
            }
        ]
    },
    {
        "category": "夏季",
        "tab": "summer",
        "list": [
            {
                "name": "キュウリ(黃瓜)",
                "seedBuy": "80",
                "seedSell": "8",
                "matureDay": "6(2)",
                "crop": "2日",
                "cropBuy": "720",
                "cropSell": "180",
                "Lv10Sell": "216",
                "sp": [
                    "HP+10",
                    "RP+10",
                    "HP上限+5",
                    "RP上限+10"
                ],
                "time": "3"
            },
            {
                "name": "トマト(番茄)",
                "seedBuy": "140",
                "seedSell": "14",
                "matureDay": "11(4)",
                "crop": "1日",
                "cropBuy": "900",
                "cropSell": "300",
                "Lv10Sell": "600",
                "sp": [
                    "HP+15",
                    "RP+10"
                ],
                "time": "3"
            },
            {
                "name": "トウモロコシ(玉米)",
                "seedBuy": "130",
                "seedSell": "13",
                "matureDay": "13(5)",
                "crop": "2日",
                "cropBuy": "1320",
                "cropSell": "440",
                "Lv10Sell": "880",
                "sp": [
                    "HP+25",
                    "RP+10",
                    "HP上限+10",
                    "RP上限+10"
                ],
                "time": "3"
            },
            {
                "name": "カボチャ(南瓜)",
                "seedBuy": "220",
                "seedSell": "22",
                "matureDay": "10(4)",
                "crop": "不可",
                "cropBuy": "4960",
                "cropSell": "1240",
                "Lv10Sell": "2480",
                "sp": [
                    "HP+50",
                    "HP上限+30",
                    "體力+3"
                ],
                "time": "3"
            },
            {
                "name": "ナス(茄子)",
                "seedBuy": "160",
                "seedSell": "16",
                "matureDay": "9(3)",
                "crop": "2日",
                "cropBuy": "1040",
                "cropSell": "480",
                "Lv10Sell": "720",
                "sp": [
                    "HP+15",
                    "RP+10",
                    "體力+5"
                ],
                "time": "3"
            },
            {
                "name": "パイナップル(菠蘿)",
                "seedBuy": "300",
                "seedSell": "30",
                "matureDay": "14",
                "crop": "3日",
                "cropBuy": "6000",
                "cropSell": "1200",
                "Lv10Sell": "",
                "sp": [
                    "RP+20",
                    "力量+2",
                    "智力+6"
                ],
                "time": "3"
            },
            {
                "name": "金のカボチャ(金南瓜)",
                "seedBuy": "190",
                "seedSell": "19",
                "matureDay": "15(5)",
                "crop": "不可",
                "cropBuy": "16500",
                "cropSell": "3300",
                "Lv10Sell": "9900",
                "sp": [
                    "HP+70",
                    "HP上限+30",
                    "體力+6"
                ],
                "time": "3"
            },
            {
                "name": "ピンクキャット(粉色貓咪)",
                "seedBuy": "50",
                "seedSell": "5",
                "matureDay": "4(2)",
                "crop": "不可",
                "cropBuy": "1890",
                "cropSell": "270",
                "Lv10Sell": "1350",
                "sp": [
                    "HP+6%",
                    "RP+15%"
                ],
                "time": "3"
            },
            {
                "name": "野之花火(野之花火)",
                "seedBuy": "260",
                "seedSell": "26",
                "matureDay": "6(2)",
                "crop": "不可",
                "cropBuy": "8400",
                "cropSell": "1200",
                "Lv10Sell": "6000",
                "sp": [
                    "RP+15%",
                    "力量+10%"
                ],
                "time": "3"
            },
            {
                "name": "鉄千輪(鐵千輪)",
                "seedBuy": "420",
                "seedSell": "42",
                "matureDay": "25(9)",
                "crop": "不可",
                "cropBuy": "38500",
                "cropSell": "5500",
                "Lv10Sell": "27500",
                "sp": [
                    "HP-25%",
                    "RP+15%",
                    "力量+12",
                    "體力-4"
                ],
                "time": "3"
            },
            {
                "name": "クローバー (四葉三葉草)",
                "seedBuy": "390",
                "seedSell": "39",
                "matureDay": "10(4)",
                "crop": "不可",
                "cropBuy": "14700",
                "cropSell": "2100",
                "Lv10Sell": "10500",
                "sp": [
                    "RP+15%"
                ],
                "time": "3"
            },
            {
                "name": "緑水晶(綠水晶)",
                "seedBuy": "700",
                "seedSell": "70",
                "matureDay": "16(6)",
                "crop": "不可",
                "cropBuy": "49000",
                "cropSell": "7000",
                "Lv10Sell": "35000",
                "sp": [
                    "HP+20%",
                    "RP+15%"
                ],
                "time": "3"
            }
        ]
    },
    {
        "category": "秋季",
        "tab": "autumn",
        "list": [
            {
                "name": "サツマイモ(蕃薯)",
                "seedBuy": "80",
                "seedSell": "8",
                "matureDay": "6(2)",
                "crop": "1日",
                "cropBuy": "440",
                "cropSell": "140",
                "Lv10Sell": "210",
                "sp": [
                    "HP上限+10",
                    "體力+5"
                ],
                "time": "3"
            },
            {
                "name": "ジャガイモ(土豆/馬鈴薯)",
                "seedBuy": "90",
                "seedSell": "9",
                "matureDay": "3(1)",
                "crop": "不可",
                "cropBuy": "840",
                "cropSell": "280",
                "Lv10Sell": "336",
                "sp": [
                    "HP+5",
                    "RP+5"
                ],
                "time": "3"
            },
            {
                "name": "ニンジン(胡蘿蔔)",
                "seedBuy": "100",
                "seedSell": "10",
                "matureDay": "8(3)",
                "crop": "不可",
                "cropBuy": "1770",
                "cropSell": "590",
                "Lv10Sell": "885",
                "sp": [
                    "RP+15"
                ],
                "time": "3"
            },
            {
                "name": "ピーマン(青椒)",
                "seedBuy": "150",
                "seedSell": "15",
                "matureDay": "9(3)",
                "crop": "1日",
                "cropBuy": "930",
                "cropSell": "310",
                "Lv10Sell": "620",
                "sp": [
                    "RP+15",
                    "RP上限+10"
                ],
                "time": "3"
            },
            {
                "name": "ホウレン草(菠菜)",
                "seedBuy": "60",
                "seedSell": "6",
                "matureDay": "2(1)",
                "crop": "不可",
                "cropBuy": "340",
                "cropSell": "140",
                "Lv10Sell": "168",
                "sp": [
                    "HP+5",
                    "RP+10",
                    "HP上限+3",
                    "力量+3",
                    "體力+1",
                    "智力-2"
                ],
                "time": "3"
            },
            {
                "name": "金のジャガイモ(金土豆)",
                "seedBuy": "250",
                "seedSell": "25",
                "matureDay": "6(2)",
                "crop": "不可",
                "cropBuy": "9500",
                "cropSell": "1900",
                "Lv10Sell": "5700",
                "sp": [
                    "HP+15",
                    "RP+25",
                    "力量+3",
                    "體力+3",
                    "智力+2"
                ],
                "time": "3"
            },
            {
                "name": "チャームブルー(藍色妖姬)",
                "seedBuy": "40",
                "seedSell": "4",
                "matureDay": "6(2)",
                "crop": "不可",
                "cropBuy": "2240",
                "cropSell": "320",
                "Lv10Sell": "1600",
                "sp": [
                    "HP+5%",
                    "RP+15%",
                    "毒"
                ],
                "time": "3"
            },
            {
                "name": "花紅葉(花紅葉)",
                "seedBuy": "440",
                "seedSell": "44",
                "matureDay": "15(5)",
                "crop": "不可",
                "cropBuy": "37800",
                "cropSell": "5400",
                "Lv10Sell": "27000",
                "sp": [
                    "RP+15%",
                    "HP上限+5%"
                ],
                "time": "3"
            },
            {
                "name": "タンポイズン(劇毒蒲公英)",
                "seedBuy": "510",
                "seedSell": "51",
                "matureDay": "22(8)",
                "crop": "不可",
                "cropBuy": "46200",
                "cropSell": "6600",
                "Lv10Sell": "33000",
                "sp": [
                    "RP+15%",
                    "毒"
                ],
                "time": "3"
            },
            {
                "name": "赤水晶(赤水晶)",
                "seedBuy": "700",
                "seedSell": "70",
                "matureDay": "16(6)",
                "crop": "不可",
                "cropBuy": "49000",
                "cropSell": "7000",
                "Lv10Sell": "35000",
                "sp": [
                    "HP+20%",
                    "RP+15%"
                ],
                "time": "3"
            }
        ]
    },
    {
        "category": "冬季",
        "tab": "winter",
        "list": [
            {
                "name": "カブ(蕪菁)",
                "seedBuy": "130",
                "seedSell": "13",
                "matureDay": "3(1)",
                "crop": "不可",
                "cropBuy": "1260",
                "cropSell": "420",
                "Lv10Sell": "630",
                "sp": [
                    "HP+10",
                    "RP+5",
                    "力量-2",
                    "智力+3"
                ],
                "time": "3"
            },
            {
                "name": "ネギ(大蔥)",
                "seedBuy": "120",
                "seedSell": "12",
                "matureDay": "6(2)",
                "crop": "不可",
                "cropBuy": "1500",
                "cropSell": "500",
                "Lv10Sell": "750",
                "sp": [
                    "HP+5",
                    "RP+10",
                    "力量+2"
                ],
                "time": "3"
            },
            {
                "name": "大根(蘿蔔)",
                "seedBuy": "160",
                "seedSell": "16",
                "matureDay": "7(3)",
                "crop": "不可",
                "cropBuy": "2310",
                "cropSell": "770",
                "Lv10Sell": "1155",
                "sp": [
                    "HP+5",
                    "RP+20"
                ],
                "time": "3"
            },
            {
                "name": "白菜(白菜)",
                "seedBuy": "200",
                "seedSell": "20",
                "matureDay": "12(4)",
                "crop": "不可",
                "cropBuy": "5400",
                "cropSell": "1350",
                "Lv10Sell": "2700",
                "sp": [
                    "HP+15",
                    "RP+30",
                    "體力+5",
                    "智力-2"
                ],
                "time": "3"
            },
            {
                "name": "ほかほかの実(火熱果實)",
                "seedBuy": "470",
                "seedSell": "47",
                "matureDay": "18(6)",
                "crop": "不可",
                "cropBuy": "24000",
                "cropSell": "4800",
                "Lv10Sell": "12000",
                "sp": [
                    "HP+50",
                    "RP+50",
                    "體力+8",
                    "智力-4",
                    "火傷害減半"
                ],
                "time": "3"
            },
            {
                "name": "金のカブ(金蕪菁)",
                "seedBuy": "210",
                "seedSell": "21",
                "matureDay": "5(2)",
                "crop": "不可",
                "cropBuy": "7000",
                "cropSell": "1400",
                "Lv10Sell": "4200",
                "sp": [
                    "HP+30",
                    "RP+10",
                    "RP上限+20",
                    "力量-8",
                    "智力+7"
                ],
                "time": "3"
            },
            {
                "name": "白水晶(白水晶)",
                "seedBuy": "700",
                "seedSell": "70",
                "matureDay": "16(6)",
                "crop": "不可",
                "cropBuy": "49000",
                "cropSell": "7000",
                "Lv10Sell": "35000",
                "sp": [
                    "HP+20%",
                    "RP+15%"
                ],
                "time": "3"
            },
            {
                "name": "ツリー草(樹形草)",
                "seedBuy": "330",
                "seedSell": "33",
                "matureDay": "24(8)",
                "crop": "不可",
                "cropBuy": "29547",
                "cropSell": "4221",
                "Lv10Sell": "21105",
                "sp": [
                    "RP+15%",
                    "體力+12"
                ],
                "time": "3"
            }
        ]
    },
    {
        "category": "其他",
        "tab": "other",
        "list": [
            {
                "name": "牧草",
                "seedBuy": "300",
                "seedSell": "30",
                "matureDay": "3(1)",
                "crop": "1日",
                "cropBuy": "240",
                "cropSell": "60",
                "Lv10Sell": "",
                "sp": [],
                "time": ""
            }
        ]
    }
];
const cookingRec = [
    {
        "category": "空手",
        "tab": "emptyhanded",
        "active": true,
        "list": [
            {
                "name": "腌蕪菁(かぶの酢漬け)",
                "skillLv": "2",
                "item": [
                    "櫻色蕪菁"
                ],
                "sp": [
                    "HP+40%",
                    "RP+35%",
                    "力量-3",
                    "智力+3"
                ],
                "time": "3"
            },
            {
                "name": "腌蕪菁(かぶの酢漬け)",
                "skillLv": "3",
                "item": [
                    "蕪菁"
                ],
                "sp": [
                    "HP+40%",
                    "RP+35%",
                    "力量-3",
                    "智力+3"
                ],
                "time": "3"
            },
            {
                "name": "醃黃瓜(きゅうりの酢漬け)",
                "skillLv": "6",
                "item": [
                    "黃瓜"
                ],
                "sp": [
                    "HP+50",
                    "RP+35%",
                    "HP上限+50"
                ],
                "time": "3"
            },
            {
                "name": "飯糰(おにぎり)",
                "skillLv": "6",
                "item": [
                    "米飯"
                ],
                "sp": [
                    "HP+50%"
                ],
                "time": "6"
            },
            {
                "name": "麵包(パン)",
                "skillLv": "9",
                "item": [
                    "小麥粉"
                ],
                "sp": [
                    "HP+50%",
                    "RP+20%",
                    "HP上限+10"
                ],
                "time": "6"
            },
            {
                "name": "竹筍飯(たけのこごはん)",
                "skillLv": "10",
                "item": [
                    "竹筍",
                    "米飯"
                ],
                "sp": [
                    "HP+40%",
                    "RP+50%",
                    "RP上限+10%",
                    "力量+2",
                    "體力+2"
                ],
                "time": "6"
            },
            {
                "name": "葡萄麵包(ぶどうパン)",
                "skillLv": "12",
                "item": [
                    "麵包",
                    "葡萄"
                ],
                "sp": [
                    "HP+50%",
                    "RP+60%",
                    "HP上限-20%",
                    "體力-1",
                    "智力+4"
                ],
                "time": "6"
            },
            {
                "name": "腌紅白蕪菁(カブの紅白漬け)",
                "skillLv": "12",
                "item": [
                    "蕪菁",
                    "櫻色蕪菁"
                ],
                "sp": [
                    "HP+80",
                    "RP+40%",
                    "HP上限+20",
                    "智力+2"
                ],
                "time": "3"
            },
            {
                "name": "冰激淋(アイスクリーム)",
                "skillLv": "14",
                "item": [
                    "牛奶"
                ],
                "sp": [
                    "HP+20%",
                    "RP+65%",
                    "RP上限+50",
                    "體力-8",
                    "智力+6",
                    "水屬性抗性+1",
                    "火屬性抗性-1"
                ],
                "time": "3"
            },
            {
                "name": "鮭魚飯糰(鮭のおにぎり)",
                "skillLv": "15",
                "item": [
                    "鹽烤鮭魚",
                    "米飯"
                ],
                "sp": [
                    "HP+75%",
                    "RP+50%",
                    "HP上限+30",
                    "力量+14%",
                    "會心一擊出現概率略微提升"
                ],
                "time": "6"
            },
            {
                "name": "水果三明治(フルーツサンド)",
                "skillLv": "15",
                "item": [
                    "草莓",
                    "麵包",
                    "橘子",
                    "蘋果"
                ],
                "sp": [
                    "HP+50%",
                    "RP+60%",
                    "HP上限+60",
                    "RP上限+80",
                    "力量-2",
                    "智力+2"
                ],
                "time": "6"
            },
            {
                "name": "沙拉(サラダ)",
                "skillLv": "16",
                "item": [
                    "煮雞蛋",
                    "黃瓜",
                    "蘿蔔",
                    "番茄",
                    "捲心菜"
                ],
                "sp": [
                    "HP+40%",
                    "RP+40%",
                    "HP上限+100",
                    "RP上限+50",
                    "力量-4"
                ],
                "time": "3"
            },
            {
                "name": "冰激淋(アイスクリーム)",
                "skillLv": "16",
                "item": [
                    "優質牛奶"
                ],
                "sp": [
                    "HP+20%",
                    "RP+65%",
                    "RP上限+50",
                    "體力-8",
                    "智力+6",
                    "水屬性抗性+1",
                    "火屬性抗性-1"
                ],
                "time": "3"
            },
            {
                "name": "三明治(サンドウィッチ)",
                "skillLv": "18",
                "item": [
                    "粉紅貓咪",
                    "番茄",
                    "黃瓜",
                    "煮雞蛋",
                    "麵包"
                ],
                "sp": [
                    "HP+50%",
                    "RP+50%",
                    "HP上限+125",
                    "RP上限+110",
                    "力量-3",
                    "體力+2"
                ],
                "time": "6"
            },
            {
                "name": "冰激淋(アイスクリーム)",
                "skillLv": "18",
                "item": [
                    "富鈣牛奶"
                ],
                "sp": [
                    "HP+20%",
                    "RP+65%",
                    "RP上限+50",
                    "體力-8",
                    "智力+6",
                    "水屬性抗性+1",
                    "火屬性抗性-1"
                ],
                "time": "3"
            },
            {
                "name": "蕪菁大雜燴(カブヘブン)",
                "skillLv": "20",
                "item": [
                    "蕪菁",
                    "櫻色蕪菁",
                    "金蕪菁"
                ],
                "sp": [
                    "HP+40%",
                    "RP+60%",
                    "力量+1",
                    "體力+1",
                    "智力+2"
                ],
                "time": "3"
            },
            {
                "name": "放鬆茶葉(リラックス茶の葉)",
                "skillLv": "25",
                "item": [
                    "白草",
                    "藥草",
                    "綠草",
                    "黃草",
                    "青草",
                    "紫草"
                ],
                "sp": [
                    "HP+10%",
                    "RP+10%"
                ],
                "time": "3"
            }
        ]
    },
    {
        "category": "菜刀",
        "tab": "kitchenknife",
        "list": [
            {
                "name": "烏賊刺身(イカさし)",
                "skillLv": "9",
                "item": [
                    "烏賊"
                ],
                "sp": [
                    "HP+20%",
                    "RP+30%",
                    "力量+1",
                    "體力+4"
                ],
                "time": "3"
            },
            {
                "name": "鱒魚/天魚刺身(アマゴのおさしみ)",
                "skillLv": "12",
                "item": [
                    "鱒魚/天魚"
                ],
                "sp": [
                    "HP+20%",
                    "RP+10%",
                    "力量+3",
                    "智力-2"
                ],
                "time": "3"
            },
            {
                "name": "鰯魚/沙丁魚刺身(イワシのおさしみ)",
                "skillLv": "15",
                "item": [
                    "鰯魚/沙丁魚"
                ],
                "sp": [
                    "HP+10%",
                    "RP+15%",
                    "會心一擊出現率提升"
                ],
                "time": "3"
            },
            {
                "name": "巖魚刺身(イワナのおさしみ)",
                "skillLv": "15",
                "item": [
                    "巖魚"
                ],
                "sp": [
                    "HP+25%",
                    "RP+15%",
                    "力量+4",
                    "體力-1",
                    "智力-1"
                ],
                "time": "3"
            },
            {
                "name": "蝦肉刺身(エビのおさしみ)",
                "skillLv": "17",
                "item": [
                    "蝦"
                ],
                "sp": [
                    "HP+40%",
                    "RP+20%",
                    "力量-5%",
                    "智力+7%"
                ],
                "time": "3"
            },
            {
                "name": "真鱒魚刺身(ヤマメのおさしみ)",
                "skillLv": "18",
                "item": [
                    "真鱒魚"
                ],
                "sp": [
                    "HP+15%",
                    "RP+10%",
                    "力量+2",
                    "智力-1",
                    "會心一擊出現率稍微提升"
                ],
                "time": "3"
            },
            {
                "name": "秋刀魚刺身(サンマのおさしみ)",
                "skillLv": "18",
                "item": [
                    "秋刀魚"
                ],
                "sp": [
                    "HP+30%",
                    "RP+30%",
                    "HP上限+10%",
                    "力量+2",
                    "智力-1",
                    "對封印抗性略微提升"
                ],
                "time": "3"
            },
            {
                "name": "虹色魚刺身(ドクニジマスさし)",
                "skillLv": "21",
                "item": [
                    "毒虹鱒魚/虹色魚"
                ],
                "sp": [
                    "HP+30%",
                    "RP+30%",
                    "HP上限+10",
                    "力量+12%",
                    "體力+1"
                ],
                "time": "3"
            },
            {
                "name": "針魚刺身(サヨリのおさしみ)",
                "skillLv": "22",
                "item": [
                    "針魚"
                ],
                "sp": [
                    "HP+25%",
                    "RP+25%",
                    "力量+4",
                    "智力+1"
                ],
                "time": "3"
            },
            {
                "name": "斑鲅魚刺身(メジナのおさしみ)",
                "skillLv": "25",
                "item": [
                    "斑鲅魚"
                ],
                "sp": [
                    "HP+25%",
                    "RP+30%"
                ],
                "time": "3"
            },
            {
                "name": "鮭魚刺身(サケのおさしみ)",
                "skillLv": "25",
                "item": [
                    "鮭魚"
                ],
                "sp": [
                    "HP+40%",
                    "RP+30%",
                    "HP上限+20%",
                    "力量+5",
                    "體力-15"
                ],
                "time": "3"
            },
            {
                "name": "鰹魚刺身(カツオのおさしみ)",
                "skillLv": "28",
                "item": [
                    "鰹魚"
                ],
                "sp": [
                    "HP+40%",
                    "RP+40%",
                    "力量+6%",
                    "體力-2",
                    "會心一擊出現率提升"
                ],
                "time": "3"
            },
            {
                "name": "龍蝦刺身(ロブスターのおさしみ)",
                "skillLv": "29",
                "item": [
                    "龍蝦"
                ],
                "sp": [
                    "HP+50%",
                    "RP+25%",
                    "力量-4%",
                    "智力+12%"
                ],
                "time": "3"
            },
            {
                "name": "鰈魚刺身(カレイのおさしみ)",
                "skillLv": "29",
                "item": [
                    "鰈魚"
                ],
                "sp": [
                    "HP+60%",
                    "RP+45%",
                    "RP上限+20",
                    "力量+6",
                    "智力-2"
                ],
                "time": "3"
            },
            {
                "name": "比目魚刺身(ヒラメのおさしみ)",
                "skillLv": "31",
                "item": [
                    "比目魚"
                ],
                "sp": [
                    "HP+45%",
                    "RP+60%",
                    "HP上限+20",
                    "力量+9",
                    "體力-4"
                ],
                "time": "3"
            },
            {
                "name": "鯛魚刺身(タイのおさしみ)",
                "skillLv": "32",
                "item": [
                    "鯛魚"
                ],
                "sp": [
                    "HP+45%",
                    "RP+30%",
                    "HP上限+15%",
                    "力量+2",
                    "體力+4",
                    "會心一擊出現率略微提升，容易受到會心一擊"
                ],
                "time": "3"
            },
            {
                "name": "鰤魚刺身(ブリのおさしみ)",
                "skillLv": "35",
                "item": [
                    "鰤魚"
                ],
                "sp": [
                    "HP+60%",
                    "RP+30%",
                    "力量+8",
                    "體力+6"
                ],
                "time": "3"
            },
            {
                "name": "紅葉魚刺身(色づくおさしみ)",
                "skillLv": "37",
                "item": [
                    "紅葉魚"
                ],
                "sp": [
                    "HP+40%",
                    "RP+55%",
                    "HP上限+20%",
                    "力量+18",
                    "體力-15"
                ],
                "time": "3"
            },
            {
                "name": "螢烏賊刺身(フーインイカさし)",
                "skillLv": "38",
                "item": [
                    "螢烏賊"
                ],
                "sp": [
                    "HP+20%",
                    "RP+60%",
                    "力量+8",
                    "體力+2",
                    "智力-5"
                ],
                "time": "3"
            },
            {
                "name": "心跳刺身(トキメクおさしみ)",
                "skillLv": "39",
                "item": [
                    "心跳鯛魚/彩鯛"
                ],
                "sp": [
                    "HP+50%",
                    "RP+60%",
                    "力量+13",
                    "體力+12",
                    "受到會心一擊概率降低"
                ],
                "time": "3"
            },
            {
                "name": "哲羅魚刺身(イトウのおさしみ)",
                "skillLv": "40",
                "item": [
                    "哲羅魚"
                ],
                "sp": [
                    "HP+40%",
                    "RP+30%",
                    "力量+18%"
                ],
                "time": "3"
            },
            {
                "name": "閃光刺身(カガヤクおさしみ)",
                "skillLv": "41",
                "item": [
                    "閃光鯛魚/銀鯛"
                ],
                "sp": [
                    "HP+60%",
                    "RP+40%",
                    "力量+28",
                    "體力-10",
                    "光耐性+2",
                    "大幅減少光屬性傷害"
                ],
                "time": "3"
            },
            {
                "name": "斑烏賊刺身(ジャマイカさし)",
                "skillLv": "42",
                "item": [
                    "斑烏賊/南國烏賊"
                ],
                "sp": [
                    "HP+30%",
                    "RP+45%",
                    "力量+12%",
                    "體力+10"
                ],
                "time": "3"
            },
            {
                "name": "大肥金槍魚/大舌頭(大トロ)",
                "skillLv": "43",
                "item": [
                    "金槍魚"
                ],
                "sp": [
                    "HP+50%",
                    "RP+50%",
                    "HP上限+40%",
                    "力量+20%",
                    "體力-12"
                ],
                "time": "3"
            },
            {
                "name": "河豚刺身(フグさし)",
                "skillLv": "51",
                "item": [
                    "河豚"
                ],
                "sp": [
                    "HP+50%",
                    "RP+70%",
                    "大幅提升對毒的抗性"
                ],
                "time": "3"
            }
        ]
    },
    {
        "category": "平底鍋",
        "tab": "pan",
        "list": [
            {
                "name": "鹽烤巖魚(イワナの塩焼き)",
                "skillLv": "12",
                "item": [
                    "巖魚"
                ],
                "sp": [
                    "HP+35%",
                    "RP+25%",
                    "力量+3",
                    "智力+1"
                ],
                "time": "6"
            },
            {
                "name": "炸土豆球/炸肉餅(コロッケ)",
                "skillLv": "14",
                "item": [
                    "土豆",
                    "油",
                    "蛋"
                ],
                "sp": [
                    "HP+240",
                    "RP+40%",
                    "HP上限+80"
                ],
                "time": "6"
            },
            {
                "name": "烤烏賊(焼きイカ)",
                "skillLv": "16",
                "item": [
                    "烏賊"
                ],
                "sp": [
                    "HP+25%",
                    "RP+25%",
                    "力量+4",
                    "體力+2"
                ],
                "time": "6"
            },
            {
                "name": "炸土豆球/炸肉餅(コロッケ)",
                "skillLv": "16",
                "item": [
                    "土豆",
                    "油",
                    "優質蛋"
                ],
                "sp": [
                    "HP+240",
                    "RP+40%",
                    "HP上限+80"
                ],
                "time": "6"
            },
            {
                "name": "玉米片(コーンフレーク)",
                "skillLv": "17",
                "item": [
                    "玉米",
                    "牛奶"
                ],
                "sp": [
                    "HP+45%",
                    "RP+60%",
                    "力量+3"
                ],
                "time": "6"
            },
            {
                "name": "鹽烤鱒魚/天魚(アマゴの塩焼き)",
                "skillLv": "17",
                "item": [
                    "鱒魚/天魚"
                ],
                "sp": [
                    "HP+30%",
                    "RP+15%",
                    "力量+2",
                    "智力-1"
                ],
                "time": "6"
            },
            {
                "name": "炸土豆球/炸肉餅(コロッケ)",
                "skillLv": "18",
                "item": [
                    "土豆",
                    "油",
                    "每天健康蛋"
                ],
                "sp": [
                    "HP+240",
                    "RP+40%",
                    "HP上限+80"
                ],
                "time": "6"
            },
            {
                "name": "法式吐司/奶油吐司(フレンチトースト)",
                "skillLv": "19",
                "item": [
                    "油",
                    "麵包",
                    "蛋"
                ],
                "sp": [
                    "HP+55%",
                    "RP+50%",
                    "力量-7",
                    "體力+8"
                ],
                "time": "6"
            },
            {
                "name": "沙丁魚串(めざし)",
                "skillLv": "20",
                "item": [
                    "沙丁魚/鰯魚",
                    "沙丁魚/鰯魚",
                    "沙丁魚/鰯魚"
                ],
                "sp": [
                    "HP+20%",
                    "RP+25%",
                    "會心一擊出現概率略微提升"
                ],
                "time": "6"
            },
            {
                "name": "玉米片(コーンフレーク)",
                "skillLv": "20",
                "item": [
                    "玉米",
                    "優質牛奶"
                ],
                "sp": [
                    "HP+45%",
                    "RP+60%",
                    "力量+3"
                ],
                "time": "6"
            },
            {
                "name": "鹽烤公魚(ワカサギの塩焼き)",
                "skillLv": "21",
                "item": [
                    "公魚"
                ],
                "sp": [
                    "HP+10%",
                    "RP+25%",
                    "力量+4",
                    "智力+1"
                ],
                "time": "6"
            },
            {
                "name": "煎餅/烤餅(ホットケーキ)",
                "skillLv": "22",
                "item": [
                    "小麥粉",
                    "蜂蜜",
                    "甘甜粉",
                    "優質牛奶",
                    "優質蛋"
                ],
                "sp": [
                    "HP+240",
                    "RP+45%",
                    "RP上限+25%",
                    "智力+4",
                    "對毒",
                    "麻痹",
                    "封印",
                    "睡眠的抗性略微提升"
                ],
                "time": "6"
            },
            {
                "name": "整烤鮮蝦(エビの姿焼き)",
                "skillLv": "22",
                "item": [
                    "蝦"
                ],
                "sp": [
                    "HP+240",
                    "RP+50%",
                    "力量-4%",
                    "智力+5%"
                ],
                "time": "6"
            },
            {
                "name": "玉米片(コーンフレーク)",
                "skillLv": "23",
                "item": [
                    "玉米",
                    "富鈣牛奶"
                ],
                "sp": [
                    "HP+45%",
                    "RP+60%",
                    "力量+3"
                ],
                "time": "6"
            },
            {
                "name": "炸薯條(フライドポテト)",
                "skillLv": "23",
                "item": [
                    "土豆",
                    "油"
                ],
                "sp": [
                    "HP+260",
                    "RP+40%",
                    "RP上限+20%",
                    "智力+2"
                ],
                "time": "6"
            },
            {
                "name": "鹽烤秋刀魚(サンマの塩焼き)",
                "skillLv": "23",
                "item": [
                    "蘿蔔",
                    "秋刀魚"
                ],
                "sp": [
                    "HP+35%",
                    "RP+25%",
                    "HP上限+15%",
                    "力量+3",
                    "體力-4",
                    "對封印的抗性略微提升"
                ],
                "time": "6"
            },
            {
                "name": "法式吐司/奶油吐絲(フレンチトースト)",
                "skillLv": "23",
                "item": [
                    "油",
                    "麵包",
                    "優質蛋"
                ],
                "sp": [
                    "HP+55%",
                    "RP+50%",
                    "力量-7",
                    "體力+8"
                ],
                "time": "6"
            },
            {
                "name": "鹽烤真鱒魚(ヤマメの塩焼き)",
                "skillLv": "23",
                "item": [
                    "真鱒魚"
                ],
                "sp": [
                    "HP+20%",
                    "RP+20%",
                    "力量+2",
                    "體力+1",
                    "智力-1",
                    "會心一擊出現概率略微提升"
                ],
                "time": "6"
            },
            {
                "name": "烏冬燒/烤麵條(焼きうどん)",
                "skillLv": "24",
                "item": [
                    "油",
                    "小麥粉",
                    "洋蔥",
                    "胡蘿蔔",
                    "捲心菜"
                ],
                "sp": [
                    "HP+70%",
                    "RP+50%",
                    "HP上限+25%",
                    "體力+12"
                ],
                "time": "12"
            },
            {
                "name": "整烤鯽魚(ヘラブナの姿焼き)",
                "skillLv": "24",
                "item": [
                    "鯽魚"
                ],
                "sp": [
                    "HP+50%",
                    "RP+45%",
                    "力量+6",
                    "體力-1"
                ],
                "time": "6"
            },
            {
                "name": "烤鯖魚/鮐魚(焼きサバ)",
                "skillLv": "24",
                "item": [
                    "鯖魚/鮐魚"
                ],
                "sp": [
                    "HP+40%",
                    "RP+20%",
                    "力量+3",
                    "智力1"
                ],
                "time": "6"
            },
            {
                "name": "煎餅/烤餅(ホットケーキ)",
                "skillLv": "24",
                "item": [
                    "小麥粉",
                    "蜂蜜",
                    "甘甜粉",
                    "富鈣牛奶",
                    "每天健康蛋"
                ],
                "sp": [
                    "HP+240",
                    "RP+45%",
                    "RP上限+25%",
                    "智力+4",
                    "對毒",
                    "麻痹",
                    "封印",
                    "睡眠的抗性略微提升"
                ],
                "time": "6"
            },
            {
                "name": "烤蘋果(焼きリンゴ)",
                "skillLv": "25",
                "item": [
                    "熱呼呼的果實",
                    "蘋果"
                ],
                "sp": [
                    "HP+35%",
                    "RP+30%",
                    "力量-12",
                    "智力+6",
                    "火",
                    "風屬性傷害減半"
                ],
                "time": "6"
            },
            {
                "name": "餃子(ぎょうざ)",
                "skillLv": "25",
                "item": [
                    "油",
                    "小麥粉",
                    "洋蔥",
                    "捲心菜"
                ],
                "sp": [
                    "HP+30%",
                    "RP+40%",
                    "HP上限-40",
                    "力量+4",
                    "體力+1",
                    "智力+2"
                ],
                "time": "6"
            },
            {
                "name": "烤毒虹鱒(焼きドクニジマス)",
                "skillLv": "26",
                "item": [
                    "毒虹鱒"
                ],
                "sp": [
                    "HP+40%",
                    "RP+30%",
                    "HP上限+10%",
                    "RP上限-15%",
                    "力量+6%",
                    "體力+1"
                ],
                "time": "6"
            },
            {
                "name": "鹽烤針魚(サヨリの塩焼き)",
                "skillLv": "27",
                "item": [
                    "針魚"
                ],
                "sp": [
                    "HP+15%",
                    "RP+20%",
                    "力量+7",
                    "體力-5",
                    "智力-4"
                ],
                "time": "6"
            },
            {
                "name": "法式吐司/奶油吐絲(フレンチトースト)",
                "skillLv": "27",
                "item": [
                    "油",
                    "麵包",
                    "每天健康蛋"
                ],
                "sp": [
                    "HP+55%",
                    "RP+50%",
                    "力量-7",
                    "體力+8"
                ],
                "time": "6"
            },
            {
                "name": "鹽烤雅羅魚(ウグイの塩焼き)",
                "skillLv": "27",
                "item": [
                    "雅羅魚"
                ],
                "sp": [
                    "HP+35%",
                    "RP+30%",
                    "力量+6"
                ],
                "time": "6"
            },
            {
                "name": "爆玉米花(ポップコーン)",
                "skillLv": "27",
                "item": [
                    "玉米"
                ],
                "sp": [
                    "HP+60",
                    "RP+20%",
                    "RP上限+15%",
                    "力量+1",
                    "體力+2"
                ],
                "time": "3"
            },
            {
                "name": "雜菜煎餅(お好み焼き)",
                "skillLv": "28",
                "item": [
                    "油",
                    "小麥粉",
                    "捲心菜",
                    "蛋"
                ],
                "sp": [
                    "HP+40%",
                    "RP+60%",
                    "HP上限+20%",
                    "RP上限+10%",
                    "力量+2",
                    "體力+8"
                ],
                "time": "12"
            },
            {
                "name": "雜菜煎餅(お好み焼き)",
                "skillLv": "29",
                "item": [
                    "油",
                    "小麥粉",
                    "捲心菜",
                    "優質蛋"
                ],
                "sp": [
                    "HP+40%",
                    "RP+60%",
                    "HP上限+20%",
                    "RP上限+10%",
                    "力量+2",
                    "體力+8"
                ],
                "time": "12"
            },
            {
                "name": "鹽烤鮭魚(塩ジャケ)",
                "skillLv": "30",
                "item": [
                    "鮭魚"
                ],
                "sp": [
                    "HP+45%",
                    "RP+40%",
                    "HP上限+12%",
                    "力量+2",
                    "體力-7"
                ],
                "time": "6"
            },
            {
                "name": "蛋包捲/煎雞蛋(卵焼き)",
                "skillLv": "30",
                "item": [
                    "蛋"
                ],
                "sp": [
                    "HP+35%",
                    "RP+40%",
                    "體力+6",
                    "智力+3",
                    "受到會心一擊概率略微下降"
                ],
                "time": "6"
            },
            {
                "name": "雜菜煎餅(お好み焼き)",
                "skillLv": "30",
                "item": [
                    "油",
                    "小麥粉",
                    "捲心菜",
                    "每天健康蛋"
                ],
                "sp": [
                    "HP+40%",
                    "RP+60%",
                    "HP上限+20%",
                    "RP上限+10%",
                    "力量+2",
                    "體力+8"
                ],
                "time": "12"
            },
            {
                "name": "蔬菜雜燴/炒蔬菜(野菜いため)",
                "skillLv": "31",
                "item": [
                    "胡蘿蔔",
                    "油",
                    "捲心菜",
                    "青椒",
                    "洋蔥"
                ],
                "sp": [
                    "HP+40%",
                    "RP+55%",
                    "力量+6"
                ],
                "time": "6"
            },
            {
                "name": "整烤哲羅魚(イトウの姿焼き)",
                "skillLv": "31",
                "item": [
                    "哲羅魚"
                ],
                "sp": [
                    "HP+50%",
                    "RP+40%",
                    "力量+18"
                ],
                "time": "6"
            },
            {
                "name": "煎蛋/菜肉蛋卷(オムレツ)",
                "skillLv": "32",
                "item": [
                    "牛奶",
                    "蛋"
                ],
                "sp": [
                    "HP+45%",
                    "RP+50%",
                    "力量-4",
                    "體力+9",
                    "智力+4",
                    "受到會心一擊概率少許下降"
                ],
                "time": "6"
            },
            {
                "name": "鰹魚片(土佐造り)",
                "skillLv": "33",
                "item": [
                    "鰹魚"
                ],
                "sp": [
                    "HP+25%",
                    "RP+25%",
                    "力量+4",
                    "體力-2",
                    "智力+1",
                    "風屬性抗性+1"
                ],
                "time": "6"
            },
            {
                "name": "蛋包捲/煎雞蛋(卵焼き)",
                "skillLv": "33",
                "item": [
                    "優質蛋"
                ],
                "sp": [
                    "HP+35%",
                    "RP+40%",
                    "體力+6",
                    "智力+3",
                    "受到會心一擊概率略微下降"
                ],
                "time": "6"
            },
            {
                "name": "整烤銀鯽魚(ギンブナの姿焼き)",
                "skillLv": "34",
                "item": [
                    "銀鯽魚/銀鮒魚"
                ],
                "sp": [
                    "HP+50%",
                    "RP+45%",
                    "力量+9"
                ],
                "time": "6"
            },
            {
                "name": "烤鰈魚(焼きカレイ)",
                "skillLv": "34",
                "item": [
                    "鰈魚"
                ],
                "sp": [
                    "HP+40%",
                    "RP+40%",
                    "RP上限+10%",
                    "力量+3",
                    "會心一擊出現概率略微提升"
                ],
                "time": "6"
            },
            {
                "name": "醬烤茄子/淋汁茄子(なす田楽)",
                "skillLv": "34",
                "item": [
                    "茄子"
                ],
                "sp": [
                    "HP+20%",
                    "RP+35%",
                    "力量-2",
                    "體力+3"
                ],
                "time": "6"
            },
            {
                "name": "整烤龍蝦(ロブスターの姿焼き)",
                "skillLv": "34",
                "item": [
                    "龍蝦"
                ],
                "sp": [
                    "HP+55%",
                    "RP+40%",
                    "力量-1%",
                    "智力+10%"
                ],
                "time": "6"
            },
            {
                "name": "煎蛋/菜肉蛋卷(オムレツ)",
                "skillLv": "34",
                "item": [
                    "優質牛奶",
                    "優質蛋"
                ],
                "sp": [
                    "HP+45%",
                    "RP+50%",
                    "力量-4",
                    "體力+9",
                    "智力+4",
                    "受到會心一擊概率少許下降"
                ],
                "time": "6"
            },
            {
                "name": "麵包圈/甜甜圈(ドーナツ)",
                "skillLv": "35",
                "item": [
                    "油",
                    "小麥粉",
                    "黃油",
                    "優質蛋"
                ],
                "sp": [
                    "HP+20",
                    "RP+40%",
                    "力量-2",
                    "體力+12",
                    "智力-8",
                    "對封印",
                    "睡眠的抗性少許提升"
                ],
                "time": "6"
            },
            {
                "name": "煎蛋/菜肉蛋卷(オムレツ)",
                "skillLv": "36",
                "item": [
                    "富鈣牛奶",
                    "每天健康蛋"
                ],
                "sp": [
                    "HP+45%",
                    "RP+50%",
                    "力量-4",
                    "體力+9",
                    "智力+4",
                    "受到會心一擊概率少許下降"
                ],
                "time": "6"
            },
            {
                "name": "烤比目魚(焼きヒラメ)",
                "skillLv": "36",
                "item": [
                    "比目魚"
                ],
                "sp": [
                    "HP+40%",
                    "RP+40%",
                    "HP上限+10",
                    "力量+9",
                    "體力-1",
                    "會心一擊出現概率略微提升"
                ],
                "time": "6"
            },
            {
                "name": "蛋包捲/煎雞蛋(卵焼き)",
                "skillLv": "36",
                "item": [
                    "每天健康蛋"
                ],
                "sp": [
                    "HP+35%",
                    "RP+40%",
                    "體力+6",
                    "智力+3",
                    "受到會心一擊概率略微下降"
                ],
                "time": "6"
            },
            {
                "name": "烤沙比目魚(焼き砂ヒラメ)",
                "skillLv": "36",
                "item": [
                    "沙比目魚"
                ],
                "sp": [
                    "HP+70%",
                    "RP-10%",
                    "HP上限+20%",
                    "力量+12%",
                    "體力+5",
                    "火",
                    "地屬性抗性+1"
                ],
                "time": "6"
            },
            {
                "name": "麵包圈/甜甜圈(ドーナツ)",
                "skillLv": "37",
                "item": [
                    "油",
                    "小麥粉",
                    "黃油",
                    "每天健康蛋"
                ],
                "sp": [
                    "HP+35%",
                    "RP+40%",
                    "力量-2",
                    "體力+12",
                    "智力-8",
                    "對封印",
                    "睡眠的抗性少許提升"
                ],
                "time": "6"
            },
            {
                "name": "炒飯(チャーハン)",
                "skillLv": "37",
                "item": [
                    "油",
                    "米飯",
                    "大蔥",
                    "青椒",
                    "優質蛋"
                ],
                "sp": [
                    "HP+70%",
                    "RP+50%",
                    "HP上限+30%",
                    "體力+12",
                    "對吹飛抗性略微提升"
                ],
                "time": "12"
            },
            {
                "name": "烤鯛魚(タイの焼きもの)",
                "skillLv": "37",
                "item": [
                    "鯛魚"
                ],
                "sp": [
                    "HP+35%",
                    "RP+25%",
                    "HP上限+32%",
                    "力量+1",
                    "體力-2",
                    "會心一擊出現概率略微提升"
                ],
                "time": "6"
            },
            {
                "name": "蛋包飯/蛋炒飯(オムライス)",
                "skillLv": "39",
                "item": [
                    "煎蛋/菜肉蛋卷",
                    "米飯",
                    "番茄醬"
                ],
                "sp": [
                    "HP+50%",
                    "RP+60%",
                    "體力+13",
                    "智力+6",
                    "受到會心一擊概率少許下降"
                ],
                "time": "12"
            },
            {
                "name": "意式菜飯(リゾット)",
                "skillLv": "39",
                "item": [
                    "油",
                    "米飯",
                    "洋蔥",
                    "番茄",
                    "玩具香草/托伊藥草"
                ],
                "sp": [
                    "HP+40%",
                    "RP+40%",
                    "體力-50%",
                    "全屬性抗性+1"
                ],
                "time": "12"
            },
            {
                "name": "炒飯(チャーハン)",
                "skillLv": "39",
                "item": [
                    "油",
                    "米飯",
                    "大蔥",
                    "青椒",
                    "每天健康蛋"
                ],
                "sp": [
                    "HP+70%",
                    "RP+50%",
                    "HP上限+30%",
                    "體力+12",
                    "對吹飛抗性略微提升"
                ],
                "time": "12"
            },
            {
                "name": "咖喱炒飯/干咖喱(ドライカレー)",
                "skillLv": "40",
                "item": [
                    "油",
                    "咖喱粉",
                    "米飯",
                    "胡蘿蔔",
                    "青椒",
                    "洋蔥"
                ],
                "sp": [
                    "HP+20",
                    "RP+30",
                    "RP上限-50%",
                    "力量+8",
                    "體力+18"
                ],
                "time": "6"
            },
            {
                "name": "照燒鰤魚(ブリの照り焼き)",
                "skillLv": "40",
                "item": [
                    "蘿蔔",
                    "鰤魚"
                ],
                "sp": [
                    "HP+55%",
                    "RP+25%",
                    "力量+8",
                    "體力+6"
                ],
                "time": "6"
            },
            {
                "name": "天婦羅(天ぷら)",
                "skillLv": "40",
                "item": [
                    "油",
                    "洋蔥",
                    "蝦",
                    "優質蛋"
                ],
                "sp": [
                    "HP+30%",
                    "RP+40%",
                    "HP上限-25%",
                    "RP上限+50%",
                    "力量+8"
                ],
                "time": "6"
            },
            {
                "name": "鹽烤斑鲅魚(メジナの塩焼き)",
                "skillLv": "41",
                "item": [
                    "斑鲅魚"
                ],
                "sp": [
                    "HP+45%",
                    "RP+40%",
                    "對吹飛的抗性少許提升"
                ],
                "time": "6"
            },
            {
                "name": "咖喱麵包(カレーパン)",
                "skillLv": "42",
                "item": [
                    "油",
                    "小麥粉",
                    "咖喱炒飯"
                ],
                "sp": [
                    "HP+40%",
                    "RP+45%",
                    "RP上限-50%",
                    "力量+8",
                    "體力+8"
                ],
                "time": "6"
            },
            {
                "name": "烤紅葉魚(焼き紅葉)",
                "skillLv": "42",
                "item": [
                    "紅葉比目魚",
                    "蘿蔔"
                ],
                "sp": [
                    "HP+50%",
                    "RP+50%",
                    "力量+9",
                    "會心一擊出現概率略微提升"
                ],
                "time": "6"
            },
            {
                "name": "天婦羅(天ぷら)",
                "skillLv": "42",
                "item": [
                    "油",
                    "洋蔥",
                    "蝦",
                    "每天健康蛋"
                ],
                "sp": [
                    "HP+30%",
                    "RP+40%",
                    "HP上限-25%",
                    "RP上限+50%",
                    "力量+8"
                ],
                "time": "6"
            },
            {
                "name": "烤螢烏賊(焼きフーイン)",
                "skillLv": "43",
                "item": [
                    "螢烏賊",
                    "燈草"
                ],
                "sp": [
                    "HP+50%",
                    "RP+70%",
                    "力量+12",
                    "體力-4",
                    "智力-3"
                ],
                "time": "6"
            },
            {
                "name": "烤心跳鯛魚(焼きトキメキタイ)",
                "skillLv": "44",
                "item": [
                    "心跳鯛魚/彩鯛"
                ],
                "sp": [
                    "HP+50%",
                    "RP+60%",
                    "力量-4",
                    "體力+8",
                    "智力+4%",
                    "受到會心一擊的概率略微下降"
                ],
                "time": "6"
            },
            {
                "name": "烤閃光鯛魚(焼きカガヤキタイ)",
                "skillLv": "46",
                "item": [
                    "閃光鯛魚/銀鯛"
                ],
                "sp": [
                    "HP+60%",
                    "RP+50%",
                    "力量+12",
                    "體力+2",
                    "光屬性抗性+2"
                ],
                "time": "6"
            },
            {
                "name": "烤斑烏賊(焼きジャマイカ)",
                "skillLv": "47",
                "item": [
                    "斑烏賊/南國烏賊"
                ],
                "sp": [
                    "HP+35%",
                    "RP+35%",
                    "力量+8%",
                    "體力+6",
                    "智力+4%"
                ],
                "time": "6"
            },
            {
                "name": "照燒金槍魚(マグロの照り焼き)",
                "skillLv": "48",
                "item": [
                    "蘿蔔",
                    "金槍魚"
                ],
                "sp": [
                    "HP+60%",
                    "RP+50%",
                    "HP上限+30%",
                    "RP上限+18%",
                    "力量+16%",
                    "體力-6"
                ],
                "time": "6"
            },
            {
                "name": "烤河豚(焼きフグ)",
                "skillLv": "56",
                "item": [
                    "河豚",
                    "解毒草",
                    "解毒草"
                ],
                "sp": [
                    "HP+60%",
                    "RP+50%",
                    "力量+8%",
                    "對毒的抗性大幅提高"
                ],
                "time": "6"
            }
        ]
    },
    {
        "category": "烤箱",
        "tab": "oven",
        "list": [
            {
                "name": "餅乾/甜餅(クッキー)",
                "skillLv": "12",
                "item": [
                    "小麥粉",
                    "牛奶"
                ],
                "sp": [
                    "HP+15%",
                    "RP+40%",
                    "力量-12",
                    "智力+8"
                ],
                "time": "3"
            },
            {
                "name": "吐司(トースト)",
                "skillLv": "14",
                "item": [
                    "麵包"
                ],
                "sp": [
                    "HP+55%",
                    "RP+20%",
                    "HP上限+50",
                    "力量+6",
                    "體力+4"
                ],
                "time": "6"
            },
            {
                "name": "餅乾/甜餅(クッキー)",
                "skillLv": "15",
                "item": [
                    "小麥粉",
                    "優質牛奶"
                ],
                "sp": [
                    "HP+15%",
                    "RP+40%",
                    "力量-12",
                    "智力+8"
                ],
                "time": "3"
            },
            {
                "name": "餅乾/甜餅(クッキー)",
                "skillLv": "18",
                "item": [
                    "小麥粉",
                    "富鈣牛奶"
                ],
                "sp": [
                    "HP+15%",
                    "RP+40%",
                    "力量-12",
                    "智力+8"
                ],
                "time": "3"
            },
            {
                "name": "烤飯糰(焼きおにぎり)",
                "skillLv": "22",
                "item": [
                    "飯糰"
                ],
                "sp": [
                    "HP+75%"
                ],
                "time": "6"
            },
            {
                "name": "巧克力餅乾/甜餅(チョコクッキー)",
                "skillLv": "22",
                "item": [
                    "巧克力",
                    "餅乾/甜餅",
                    "黃油"
                ],
                "sp": [
                    "HP+20%",
                    "RP+50%",
                    "力量-18",
                    "智力+16"
                ],
                "time": "3"
            },
            {
                "name": "烤蕃薯(焼いも)",
                "skillLv": "24",
                "item": [
                    "紅薯"
                ],
                "sp": [
                    "HP+65%",
                    "RP+25%",
                    "HP上限+20%",
                    "RP上限+10%",
                    "體力+5",
                    "對吹飛的抗性略微提升"
                ],
                "time": "6"
            },
            {
                "name": "烤玉米(焼きとうもろこし)",
                "skillLv": "28",
                "item": [
                    "黃油",
                    "玉米"
                ],
                "sp": [
                    "HP+190",
                    "RP+35%",
                    "HP上限+100",
                    "RP上限+30"
                ],
                "time": "6"
            },
            {
                "name": "果醬麵包(ジャムパン)",
                "skillLv": "32",
                "item": [
                    "草莓果醬",
                    "黃油麵包捲"
                ],
                "sp": [
                    "HP+60%",
                    "RP+40%",
                    "HP上限+80",
                    "治癒疲勞"
                ],
                "time": "6"
            },
            {
                "name": "果醬麵包(ジャムパン)",
                "skillLv": "32",
                "item": [
                    "蘋果果醬",
                    "黃油麵包捲"
                ],
                "sp": [
                    "HP+60%",
                    "RP+40%",
                    "HP上限+80",
                    "治癒疲勞"
                ],
                "time": "6"
            },
            {
                "name": "果醬麵包(ジャムパン)",
                "skillLv": "32",
                "item": [
                    "葡萄果醬",
                    "黃油麵包捲"
                ],
                "sp": [
                    "HP+60%",
                    "RP+40%",
                    "HP上限+80",
                    "治癒疲勞"
                ],
                "time": "6"
            },
            {
                "name": "果醬麵包(ジャムパン)",
                "skillLv": "32",
                "item": [
                    "橘皮果醬",
                    "黃油麵包捲"
                ],
                "sp": [
                    "HP+60%",
                    "RP+40%",
                    "HP上限+80",
                    "治癒疲勞"
                ],
                "time": "6"
            },
            {
                "name": "黃油麵包捲(バターロール)",
                "skillLv": "36",
                "item": [
                    "小麥粉",
                    "黃油",
                    "蛋",
                    "牛奶"
                ],
                "sp": [
                    "HP+100",
                    "RP+40%",
                    "HP上限+60"
                ],
                "time": "6"
            },
            {
                "name": "蘋果派/蘋果餡餅(アップルパイ)",
                "skillLv": "36",
                "item": [
                    "小麥粉",
                    "黃油",
                    "蜂蜜",
                    "蘋果",
                    "蘋果"
                ],
                "sp": [
                    "HP+60%",
                    "RP+60%",
                    "HP上限-25%",
                    "RP上限+14%",
                    "力量-10",
                    "智力+8",
                    "治癒疲勞"
                ],
                "time": "6"
            },
            {
                "name": "黃油麵包捲(バターロール)",
                "skillLv": "38",
                "item": [
                    "小麥粉",
                    "黃油",
                    "優質蛋",
                    "優質牛奶"
                ],
                "sp": [
                    "HP+100",
                    "RP+40%",
                    "HP上限+60"
                ],
                "time": "6"
            },
            {
                "name": "黃油麵包捲(バターロール)",
                "skillLv": "40",
                "item": [
                    "小麥粉",
                    "黃油",
                    "每天健康蛋",
                    "富鈣牛奶"
                ],
                "sp": [
                    "HP+100",
                    "RP+40%",
                    "HP上限+60"
                ],
                "time": "6"
            },
            {
                "name": "紅薯點心(スイートポテト)",
                "skillLv": "44",
                "item": [
                    "紅薯",
                    "黃油",
                    "甘甜粉",
                    "優質牛奶"
                ],
                "sp": [
                    "HP+50%",
                    "RP+40%",
                    "HP上限+25%",
                    "RP上限+16%",
                    "智力+18%"
                ],
                "time": "6"
            },
            {
                "name": "披薩餅(ピザ)",
                "skillLv": "44",
                "item": [
                    "番茄醬",
                    "茄子",
                    "小麥粉",
                    "洋蔥",
                    "奶酪",
                    "奶酪"
                ],
                "sp": [
                    "HP+50%",
                    "RP+60%",
                    "HP上限+25%",
                    "力量+2",
                    "體力+8",
                    "智力-12",
                    "對吹飛的抗性提升"
                ],
                "time": "12"
            },
            {
                "name": "紅薯點心(スイートポテト)",
                "skillLv": "48",
                "item": [
                    "紅薯",
                    "黃油",
                    "甘甜粉",
                    "富鈣牛奶"
                ],
                "sp": [
                    "HP+50%",
                    "RP+40%",
                    "HP上限+25%",
                    "RP上限+16%",
                    "智力+18%"
                ],
                "time": "6"
            },
            {
                "name": "海鮮披薩(シーフードピザ)",
                "skillLv": "48",
                "item": [
                    "番茄醬",
                    "烏賊",
                    "小麥粉",
                    "蝦",
                    "奶酪",
                    "奶酪"
                ],
                "sp": [
                    "HP+60%",
                    "RP+60%",
                    "HP上限+30%",
                    "力量+12",
                    "體力+4",
                    "智力-15"
                ],
                "time": "12"
            },
            {
                "name": "奶汁烤菜(グラタン)",
                "skillLv": "51",
                "item": [
                    "小麥粉",
                    "洋蔥",
                    "橙色草",
                    "奶酪",
                    "奶酪"
                ],
                "sp": [
                    "HP+80%",
                    "RP+50%",
                    "HP上限+38%",
                    "RP上限+60",
                    "力量+8",
                    "體力+16",
                    "會心一擊出現概率略微提升"
                ],
                "time": "12"
            },
            {
                "name": "多利亞/烤飯(ドリア)",
                "skillLv": "51",
                "item": [
                    "黃油",
                    "黃瓜",
                    "米飯",
                    "洋蔥",
                    "優質牛奶"
                ],
                "sp": [
                    "HP+70%",
                    "RP+40%",
                    "HP上限+50%",
                    "力量+4",
                    "體力+11",
                    "智力-8"
                ],
                "time": "12"
            },
            {
                "name": "海鮮奶汁烤菜(シーフードグラタン)",
                "skillLv": "53",
                "item": [
                    "洋蔥",
                    "蝦",
                    "小麥粉",
                    "烏賊",
                    "奶酪"
                ],
                "sp": [
                    "HP+80%",
                    "RP+60%",
                    "HP上限+45%",
                    "RP上限+90",
                    "力量+17",
                    "體力+8",
                    "智力-20",
                    "會心一擊出現概率稍提升"
                ],
                "time": "12"
            },
            {
                "name": "多利亞/烤飯(ドリア)",
                "skillLv": "53",
                "item": [
                    "黃油",
                    "黃瓜",
                    "米飯",
                    "洋蔥",
                    "富鈣牛奶"
                ],
                "sp": [
                    "HP+70%",
                    "RP+40%",
                    "HP上限+50%",
                    "力量+4",
                    "體力+11",
                    "智力-8"
                ],
                "time": "12"
            },
            {
                "name": "海鮮烤飯(シーフードドリア)",
                "skillLv": "58",
                "item": [
                    "黃油",
                    "黃油",
                    "蝦",
                    "烏賊",
                    "米飯",
                    "奶酪"
                ],
                "sp": [
                    "HP+70%",
                    "RP+40%",
                    "HP上限+60%",
                    "力量+12",
                    "體力+12",
                    "智力-10"
                ],
                "time": "12"
            },
            {
                "name": "蛋糕(ケーキ)",
                "skillLv": "59",
                "item": [
                    "小麥粉",
                    "草莓",
                    "黃油",
                    "粉色貓咪",
                    "優質牛奶"
                ],
                "sp": [
                    "HP+70%",
                    "RP+85%",
                    "RP上限+30%",
                    "體力-12",
                    "智力15%",
                    "治癒除感冒以外的異常狀態"
                ],
                "time": "3"
            },
            {
                "name": "蛋糕(ケーキ)",
                "skillLv": "60",
                "item": [
                    "小麥粉",
                    "草莓",
                    "黃油",
                    "粉色貓咪",
                    "富鈣牛奶"
                ],
                "sp": [
                    "HP+70%",
                    "RP+85%",
                    "RP上限+30%",
                    "體力-12",
                    "智力15%",
                    "治癒除感冒以外的異常狀態"
                ],
                "time": "3"
            },
            {
                "name": "巧克力蛋糕(チョコレートケーキ)",
                "skillLv": "62",
                "item": [
                    "小麥粉",
                    "黃油",
                    "巧克力",
                    "優質牛奶"
                ],
                "sp": [
                    "HP+80%",
                    "RP+90%",
                    "RP上限+40%",
                    "體力-15",
                    "智力+22%",
                    "治癒除感冒以外的異常狀態"
                ],
                "time": "3"
            },
            {
                "name": "巧克力蛋糕(チョコレートケーキ)",
                "skillLv": "64",
                "item": [
                    "小麥粉",
                    "黃油",
                    "巧克力",
                    "富鈣牛奶"
                ],
                "sp": [
                    "HP+80%",
                    "RP+90%",
                    "RP上限+40%",
                    "體力-15",
                    "智力+22%",
                    "治癒除感冒以外的異常狀態"
                ],
                "time": "3"
            },
            {
                "name": "芝士蛋糕/奶酪蛋糕(チーズケーキ)",
                "skillLv": "68",
                "item": [
                    "小麥粉",
                    "小麥粉",
                    "奶酪",
                    "優質蛋"
                ],
                "sp": [
                    "HP+90%",
                    "RP+95%",
                    "RP上限+50%",
                    "體力-16",
                    "智力+28%",
                    "治癒除感冒以外的異常狀態"
                ],
                "time": "3"
            },
            {
                "name": "芝士蛋糕/奶酪蛋糕(チーズケーキ)",
                "skillLv": "72",
                "item": [
                    "小麥粉",
                    "小麥粉",
                    "奶酪",
                    "每天健康蛋"
                ],
                "sp": [
                    "HP+90%",
                    "RP+95%",
                    "RP上限+50%",
                    "體力-16",
                    "智力+28%",
                    "治癒除感冒以外的異常狀態"
                ],
                "time": "3"
            }
        ]
    },
    {
        "category": "蒸籠",
        "tab": "steamer",
        "list": [
            {
                "name": "糰子/丸子(だんご)",
                "skillLv": "11",
                "item": [
                    "糰子/丸子粉"
                ],
                "sp": [
                    "HP+30%",
                    "RP+30%",
                    "力量-2",
                    "體力+4",
                    "治癒中毒，受到會心一擊的概率大幅降低"
                ],
                "time": "6"
            },
            {
                "name": "中華饅頭/包子(中華まん)",
                "skillLv": "30",
                "item": [
                    "小麥粉",
                    "竹筍",
                    "胡蘿蔔",
                    "混合香料"
                ],
                "sp": [
                    "HP+60%",
                    "RP+50%",
                    "HP上限+60",
                    "力量-1",
                    "體力+8",
                    "對所有異常狀態的抗性稍提升"
                ],
                "time": "6"
            },
            {
                "name": "布丁(プリン)",
                "skillLv": "31",
                "item": [
                    "蛋"
                ],
                "sp": [
                    "HP+40%",
                    "RP+80%",
                    "HP上限-20%",
                    "體力+10",
                    "智力+8%",
                    "治癒疲勞和感冒，對所有異常狀態的抗性稍提升"
                ],
                "time": "3"
            },
            {
                "name": "布丁(プリン)",
                "skillLv": "33",
                "item": [
                    "優質蛋"
                ],
                "sp": [
                    "HP+40%",
                    "RP+80%",
                    "HP上限-20%",
                    "體力+10",
                    "智力+8%",
                    "治癒疲勞和感冒，對所有異常狀態的抗性稍提升"
                ],
                "time": "3"
            },
            {
                "name": "蒸麵包(むしパン)",
                "skillLv": "33",
                "item": [
                    "小麥粉",
                    "蜂蜜",
                    "蛋"
                ],
                "sp": [
                    "HP+40%",
                    "RP+45%",
                    "HP上限+80",
                    "力量-5",
                    "體力+2",
                    "對所有異常狀態的抗性略微提升"
                ],
                "time": "6"
            },
            {
                "name": "咖喱包子(カレーまん)",
                "skillLv": "34",
                "item": [
                    "小麥粉",
                    "胡蘿蔔",
                    "咖喱粉",
                    "竹筍"
                ],
                "sp": [
                    "HP+50%",
                    "RP+40%",
                    "力量+7",
                    "體力+8",
                    "智力-14",
                    "對所有異常狀態的抗性稍提升"
                ],
                "time": "6"
            },
            {
                "name": "布丁(プリン)",
                "skillLv": "35",
                "item": [
                    "每天健康蛋"
                ],
                "sp": [
                    "HP+40%",
                    "RP+80%",
                    "HP上限-20%",
                    "體力+10",
                    "智力+8%",
                    "治癒疲勞和感冒，對所有異常狀態的抗性稍提升"
                ],
                "time": "3"
            },
            {
                "name": "蒸麵包(むしパン)",
                "skillLv": "36",
                "item": [
                    "小麥粉",
                    "蜂蜜",
                    "優質蛋"
                ],
                "sp": [
                    "HP+40%",
                    "RP+45%",
                    "HP上限+80",
                    "力量-5",
                    "體力+2",
                    "對所有異常狀態的抗性略微提升"
                ],
                "time": "6"
            },
            {
                "name": "蒸麵包(むしパン)",
                "skillLv": "39",
                "item": [
                    "小麥粉",
                    "蜂蜜",
                    "每天健康蛋"
                ],
                "sp": [
                    "HP+40%",
                    "RP+45%",
                    "HP上限+80",
                    "力量-5",
                    "體力+2",
                    "對所有異常狀態的抗性略微提升"
                ],
                "time": "6"
            },
            {
                "name": "蒸蛋糕(むしケーキ)",
                "skillLv": "41",
                "item": [
                    "小麥粉",
                    "蜂蜜",
                    "牛奶"
                ],
                "sp": [
                    "HP+50%",
                    "RP+50%",
                    "力量-5%",
                    "體力+4",
                    "智力+7",
                    "治癒疲勞，對所有異常狀態的抗性稍提升"
                ],
                "time": "6"
            },
            {
                "name": "蒸蛋糕(むしケーキ)",
                "skillLv": "42",
                "item": [
                    "小麥粉",
                    "蜂蜜",
                    "優質牛奶"
                ],
                "sp": [
                    "HP+50%",
                    "RP+50%",
                    "力量-5%",
                    "體力+4",
                    "智力+7",
                    "治癒疲勞，對所有異常狀態的抗性稍提升"
                ],
                "time": "6"
            },
            {
                "name": "蒸蛋糕(むしケーキ)",
                "skillLv": "43",
                "item": [
                    "小麥粉",
                    "蜂蜜",
                    "富鈣牛奶"
                ],
                "sp": [
                    "HP+50%",
                    "RP+50%",
                    "力量-5%",
                    "體力+4",
                    "智力+7",
                    "治癒疲勞，對所有異常狀態的抗性稍提升"
                ],
                "time": "6"
            },
            {
                "name": "南瓜布丁(かぼちゃプリン)",
                "skillLv": "44",
                "item": [
                    "蜂蜜",
                    "南瓜",
                    "黃草",
                    "優質蛋"
                ],
                "sp": [
                    "HP+60%",
                    "RP+80%",
                    "HP上限+15%",
                    "體力+12",
                    "智力+6%",
                    "對所有異常狀態的抗性稍提升"
                ],
                "time": "3"
            },
            {
                "name": "奶酪蒸麵包(チーズ蒸しパン)",
                "skillLv": "45",
                "item": [
                    "小麥粉",
                    "蜂蜜",
                    "奶酪"
                ],
                "sp": [
                    "HP+50%",
                    "RP+60%",
                    "HP上限+18%",
                    "力量-2",
                    "體力+15",
                    "智力+4",
                    "對所有異常狀態的抗性稍提升"
                ],
                "time": "3"
            },
            {
                "name": "蒸餃(むしぎょうざ)",
                "skillLv": "45",
                "item": [
                    "小麥粉",
                    "油",
                    "洋蔥",
                    "捲心菜"
                ],
                "sp": [
                    "HP+50%",
                    "RP+40%",
                    "HP上限+20%",
                    "力量-16%",
                    "體力+12",
                    "對所有異常狀態的抗性稍提升"
                ],
                "time": "3"
            },
            {
                "name": "南瓜布丁(かぼちゃプリン)",
                "skillLv": "48",
                "item": [
                    "蜂蜜",
                    "南瓜",
                    "黃草",
                    "每天健康蛋"
                ],
                "sp": [
                    "HP+60%",
                    "RP+80%",
                    "HP上限+15%",
                    "體力+12",
                    "智力+6%",
                    "對所有異常狀態的抗性稍提升"
                ],
                "time": "3"
            },
            {
                "name": "蒸雞蛋糕/蒸鬆糕(むしカステラ)",
                "skillLv": "48",
                "item": [
                    "小麥粉",
                    "蛋"
                ],
                "sp": [
                    "HP+50%",
                    "RP+50%",
                    "HP上限+30%",
                    "體力+18",
                    "對所有異常狀態的抗性提升"
                ],
                "time": "6"
            },
            {
                "name": "燒賣(しゅうまい)",
                "skillLv": "49",
                "item": [
                    "小麥粉",
                    "捲心菜",
                    "綠草",
                    "蝦",
                    "洋蔥"
                ],
                "sp": [
                    "HP+25%",
                    "RP+35%",
                    "HP上限+22%",
                    "力量-14%",
                    "體力+15",
                    "智力+8%",
                    "對封印的抗性提升，對其它異常狀態抗性略微提升"
                ],
                "time": "6"
            },
            {
                "name": "蒸雞蛋糕/蒸鬆糕(むしカステラ)",
                "skillLv": "51",
                "item": [
                    "小麥粉",
                    "優質蛋"
                ],
                "sp": [
                    "HP+50%",
                    "RP+50%",
                    "HP上限+30%",
                    "體力+18",
                    "對所有異常狀態的抗性提升"
                ],
                "time": "6"
            },
            {
                "name": "蒸雞蛋糕/蒸鬆糕(むしカステラ)",
                "skillLv": "54",
                "item": [
                    "小麥粉",
                    "每天健康蛋"
                ],
                "sp": [
                    "HP+50%",
                    "RP+50%",
                    "HP上限+30%",
                    "體力+18",
                    "對所有異常狀態的抗性提升"
                ],
                "time": "6"
            }
        ]
    },
    {
        "category": "鍋子",
        "tab": "pot",
        "list": [
            {
                "name": "熱牛奶(ホットミルク)",
                "skillLv": "5",
                "item": [
                    "牛奶"
                ],
                "sp": [
                    "HP+120",
                    "RP+25%",
                    "HP上限+30",
                    "體力+2",
                    "對毒的抗性略微提升"
                ],
                "time": "3"
            },
            {
                "name": "熱牛奶(ホットミルク)",
                "skillLv": "7",
                "item": [
                    "優質牛奶"
                ],
                "sp": [
                    "HP+120",
                    "RP+25%",
                    "HP上限+30",
                    "體力+2",
                    "對毒的抗性略微提升"
                ],
                "time": "3"
            },
            {
                "name": "熱牛奶(ホットミルク)",
                "skillLv": "9",
                "item": [
                    "富鈣牛奶"
                ],
                "sp": [
                    "HP+120",
                    "RP+25%",
                    "HP上限+30",
                    "體力+2",
                    "對毒的抗性略微提升"
                ],
                "time": "3"
            },
            {
                "name": "熱巧克力(ホットチョコレート)",
                "skillLv": "12",
                "item": [
                    "巧克力"
                ],
                "sp": [
                    "HP+160",
                    "RP+30%",
                    "HP上限+50",
                    "體力+3",
                    "智力+2",
                    "對毒的抗性略微提升"
                ],
                "time": "3"
            },
            {
                "name": "煮雞蛋(ゆでタマゴ)",
                "skillLv": "13",
                "item": [
                    "蛋"
                ],
                "sp": [
                    "HP+120",
                    "RP+25%",
                    "HP上限+25",
                    "力量+2",
                    "對封印的抗性稍提升"
                ],
                "time": "3"
            },
            {
                "name": "涼拌菜(おひたし)",
                "skillLv": "14",
                "item": [
                    "菠菜"
                ],
                "sp": [
                    "HP+20%",
                    "RP+20%",
                    "RP上限+20",
                    "力量+1",
                    "體力+1",
                    "智力-5"
                ],
                "time": "3"
            },
            {
                "name": "煮雞蛋(ゆでタマゴ)",
                "skillLv": "14",
                "item": [
                    "優質蛋"
                ],
                "sp": [
                    "HP+120",
                    "RP+25%",
                    "HP上限+25",
                    "力量+2",
                    "對封印的抗性稍提升"
                ],
                "time": "3"
            },
            {
                "name": "煮雞蛋(ゆでタマゴ)",
                "skillLv": "15",
                "item": [
                    "每天健康蛋"
                ],
                "sp": [
                    "HP+120",
                    "RP+25%",
                    "HP上限+25",
                    "力量+2",
                    "對封印的抗性稍提升"
                ],
                "time": "3"
            },
            {
                "name": "葡萄酒(ぶどう酒)",
                "skillLv": "18",
                "item": [
                    "葡萄",
                    "藍色妖姬",
                    "紫草",
                    "紅酒"
                ],
                "sp": [
                    "HP+50%",
                    "RP+60%",
                    "體力-15",
                    "智力-10%",
                    "會心一擊出現概率提升"
                ],
                "time": "3"
            },
            {
                "name": "蘋果果醬(りんごジャム)",
                "skillLv": "23",
                "item": [
                    "蘋果",
                    "蘋果",
                    "蘋果"
                ],
                "sp": [
                    "HP+30%",
                    "RP+40%",
                    "力量-12%",
                    "體力+2",
                    "智力+12%"
                ],
                "time": "3"
            },
            {
                "name": "橘皮果醬(オレンジマーマレード)",
                "skillLv": "24",
                "item": [
                    "橘子",
                    "橘子",
                    "橘子"
                ],
                "sp": [
                    "HP+30%",
                    "RP+40%",
                    "力量-2%",
                    "智力+10%"
                ],
                "time": "3"
            },
            {
                "name": "草莓果醬(イチゴジャム)",
                "skillLv": "25",
                "item": [
                    "草莓",
                    "草莓",
                    "草莓"
                ],
                "sp": [
                    "HP+30%",
                    "RP+40%",
                    "力量-4%",
                    "智力+16%"
                ],
                "time": "3"
            },
            {
                "name": "水餃(水ぎょうざ)",
                "skillLv": "26",
                "item": [
                    "小麥粉",
                    "菠菜",
                    "捲心菜"
                ],
                "sp": [
                    "HP+30%",
                    "RP+50%",
                    "HP上限-25",
                    "力量+4",
                    "體力+2",
                    "智力+2"
                ],
                "time": "3"
            },
            {
                "name": "葡萄果醬(ぶどうジャム)",
                "skillLv": "27",
                "item": [
                    "葡萄",
                    "葡萄",
                    "葡萄"
                ],
                "sp": [
                    "HP+30%",
                    "RP+40%",
                    "力量-8%",
                    "智力+12%"
                ],
                "time": "3"
            },
            {
                "name": "烏冬/湯麵(うどん)",
                "skillLv": "29",
                "item": [
                    "櫻色蕪菁",
                    "胡蘿蔔",
                    "小麥粉",
                    "混合香料"
                ],
                "sp": [
                    "HP+60%",
                    "RP+60%",
                    "HP上限+30%"
                ],
                "time": "12"
            },
            {
                "name": "蛋蓋飯(たまごどん)",
                "skillLv": "32",
                "item": [
                    "米飯",
                    "洋蔥",
                    "蛋"
                ],
                "sp": [
                    "HP+60%",
                    "RP+80%",
                    "HP上限+120",
                    "力量-8",
                    "體力+2"
                ],
                "time": "12"
            },
            {
                "name": "粥(おかゆ)",
                "skillLv": "33",
                "item": [
                    "米飯",
                    "混合香料",
                    "火熱果實"
                ],
                "sp": [
                    "HP+50%",
                    "RP+50%",
                    "對疲勞的抗性少許提升"
                ],
                "time": "12"
            },
            {
                "name": "咖喱湯麵(カレーうどん)",
                "skillLv": "33",
                "item": [
                    "小麥粉",
                    "咖喱粉",
                    "櫻色蕪菁",
                    "胡蘿蔔"
                ],
                "sp": [
                    "HP+70%",
                    "RP+70%",
                    "HP上限+45%",
                    "力量+12",
                    "體力+15"
                ],
                "time": "12"
            },
            {
                "name": "天婦羅飯/天蓋飯(天どん)",
                "skillLv": "34",
                "item": [
                    "米飯",
                    "天婦羅",
                    "酸味料"
                ],
                "sp": [
                    "HP+50%",
                    "RP+70%",
                    "HP上限+25%",
                    "RP上限+10%"
                ],
                "time": "12"
            },
            {
                "name": "煮南瓜(かぼちゃの煮つけ)",
                "skillLv": "35",
                "item": [
                    "南瓜"
                ],
                "sp": [
                    "HP+40%",
                    "RP+45%",
                    "HP上限+100",
                    "體力+8",
                    "智力-2"
                ],
                "time": "6"
            },
            {
                "name": "蛋蓋飯(たまごどん)",
                "skillLv": "35",
                "item": [
                    "米飯",
                    "洋蔥",
                    "優質蛋"
                ],
                "sp": [
                    "HP+60%",
                    "RP+80%",
                    "HP上限+120",
                    "力量-8",
                    "體力+2"
                ],
                "time": "12"
            },
            {
                "name": "蘿蔔燉湯/味增田樂(みそ田楽)",
                "skillLv": "36",
                "item": [
                    "蘿蔔"
                ],
                "sp": [
                    "HP+40%",
                    "RP+80",
                    "RP上限+80",
                    "智力+4"
                ],
                "time": "6"
            },
            {
                "name": "天婦羅烏冬面(天ぷらうどん)",
                "skillLv": "37",
                "item": [
                    "天婦羅",
                    "烏冬/湯麵",
                    "酸味料"
                ],
                "sp": [
                    "HP+80%",
                    "RP+80%",
                    "HP上限+60%",
                    "力量+6",
                    "體力+19",
                    "智力+6"
                ],
                "time": "12"
            },
            {
                "name": "蛋蓋飯(たまごどん)",
                "skillLv": "38",
                "item": [
                    "米飯",
                    "洋蔥",
                    "每天健康蛋"
                ],
                "sp": [
                    "HP+60%",
                    "RP+80%",
                    "HP上限+120",
                    "力量-8",
                    "體力+2"
                ],
                "time": "12"
            },
            {
                "name": "大學芋(大學いも)",
                "skillLv": "39",
                "item": [
                    "紅薯",
                    "甘甜粉"
                ],
                "sp": [
                    "HP+35%",
                    "RP+50%",
                    "HP上限+15%",
                    "體力+5",
                    "智力+6"
                ],
                "time": "6"
            },
            {
                "name": "水煮巖石魚(巖石魚の煮付け)",
                "skillLv": "41",
                "item": [
                    "巖石魚",
                    "白菜"
                ],
                "sp": [
                    "HP+50%",
                    "RP+40%",
                    "力量-11",
                    "體力+15",
                    "治療麻痹",
                    "火",
                    "地屬性傷害減半"
                ],
                "time": "3"
            },
            {
                "name": "牛奶粥(牛乳がゆ)",
                "skillLv": "42",
                "item": [
                    "米飯",
                    "牛奶"
                ],
                "sp": [
                    "HP+70%",
                    "RP+60%",
                    "治癒疲勞和感冒",
                    "對疲勞和感冒的抗性提升"
                ],
                "time": "12"
            },
            {
                "name": "牛奶粥(牛乳がゆ)",
                "skillLv": "44",
                "item": [
                    "米飯",
                    "優質牛奶"
                ],
                "sp": [
                    "HP+70%",
                    "RP+60%",
                    "治癒疲勞和感冒",
                    "對疲勞和感冒的抗性提升"
                ],
                "time": "12"
            },
            {
                "name": "牛奶粥(牛乳がゆ)",
                "skillLv": "46",
                "item": [
                    "米飯",
                    "富鈣牛奶"
                ],
                "sp": [
                    "HP+70%",
                    "RP+60%",
                    "治癒疲勞和感冒",
                    "對疲勞和感冒的抗性提升"
                ],
                "time": "12"
            },
            {
                "name": "奶酪火鍋/乾酪鍋(チーズフォンデュ)",
                "skillLv": "47",
                "item": [
                    "麵包",
                    "奶酪",
                    "奶酪",
                    "奶酪",
                    "奶酪"
                ],
                "sp": [
                    "HP+45%",
                    "RP+45%",
                    "HP上限+40%",
                    "力量+5",
                    "體力+5",
                    "智力+6"
                ],
                "time": "6"
            },
            {
                "name": "咖喱飯(カレーライス)",
                "skillLv": "55",
                "item": [
                    "米飯",
                    "胡蘿蔔",
                    "咖喱粉",
                    "紅草",
                    "重口味調料"
                ],
                "sp": [
                    "HP+50%",
                    "RP+25%",
                    "HP上限-10%",
                    "RP上限-10%",
                    "力量+12",
                    "火屬性抗性+1"
                ],
                "time": "12"
            },
            {
                "name": "火鍋(寄せ鍋)",
                "skillLv": "58",
                "item": [
                    "蘿蔔",
                    "大蔥",
                    "白菜",
                    "白菜",
                    "火熱果實"
                ],
                "sp": [
                    "HP+80%",
                    "RP+80%",
                    "HP上限+20%",
                    "力量+9",
                    "體力+8",
                    "智力+4"
                ],
                "time": "12"
            },
            {
                "name": "燉菜(シチュー)",
                "skillLv": "58",
                "item": [
                    "小麥粉",
                    "土豆",
                    "胡蘿蔔",
                    "洋蔥",
                    "優質牛奶"
                ],
                "sp": [
                    "HP+70%",
                    "RP+70%",
                    "HP上限+50%",
                    "力量-12%",
                    "體力+14",
                    "水",
                    "地",
                    "風",
                    "光屬性傷害減半"
                ],
                "time": "12"
            },
            {
                "name": "放鬆茶(リラックスティー)",
                "skillLv": "64",
                "item": [
                    "放鬆茶葉",
                    "蜂蜜",
                    "少女甜瓜",
                    "大蔥"
                ],
                "sp": [
                    "HP+50%",
                    "RP+80%",
                    "RP上限+60%",
                    "治療感冒以外的一切異常狀態",
                    "對所有異常狀態的抗性提升"
                ],
                "time": "3"
            },
            {
                "name": "燉菜(シチュー)",
                "skillLv": "64",
                "item": [
                    "小麥粉",
                    "土豆",
                    "胡蘿蔔",
                    "洋蔥",
                    "富鈣牛奶"
                ],
                "sp": [
                    "HP+70%",
                    "RP+70%",
                    "HP上限+50%",
                    "力量-12%",
                    "體力+14",
                    "水",
                    "地",
                    "風",
                    "光屬性傷害減半"
                ],
                "time": "12"
            },
            {
                "name": "究極咖喱(究極のカレー)",
                "skillLv": "70",
                "item": [
                    "紅酒",
                    "惡魔之血",
                    "蟲皮",
                    "咖喱粉",
                    "重口味調料"
                ],
                "sp": [
                    "HP+70%",
                    "RP+50%",
                    "HP上限-8%",
                    "RP上限-8%",
                    "力量+24",
                    "體力+9",
                    "火屬性傷害減半"
                ],
                "time": "12"
            },
            {
                "name": "至高咖喱(至高のカレー)",
                "skillLv": "85",
                "item": [
                    "魔法師之粉",
                    "蘋果",
                    "蜂蜜",
                    "咖喱粉",
                    "混合香料",
                    "混合香料"
                ],
                "sp": [
                    "HP+80%",
                    "75%",
                    "力量+38",
                    "火屬性抗性+2"
                ],
                "time": "12"
            }
        ]
    },
    {
        "category": "攪拌機",
        "tab": "blender",
        "list": [
            {
                "name": "蛋黃醬(マヨネーズ)",
                "skillLv": "5",
                "item": [
                    "蛋"
                ],
                "sp": [
                    "HP+100",
                    "對麻痹的抗性提升"
                ],
                "time": "3"
            },
            {
                "name": "酸奶(ヨーグルト)",
                "skillLv": "5",
                "item": [
                    "白草",
                    "牛奶"
                ],
                "sp": [
                    "RP+50%"
                ],
                "time": "3"
            },
            {
                "name": "蘋果汁(リンゴジュース)",
                "skillLv": "8",
                "item": [
                    "蘋果"
                ],
                "sp": [
                    "HP+20%",
                    "RP+30%",
                    "力量+1",
                    "智力+4"
                ],
                "time": "3"
            },
            {
                "name": "黃油(バター)",
                "skillLv": "9",
                "item": [
                    "牛奶"
                ],
                "sp": [
                    "HP+20%",
                    "RP+15%",
                    "體力+5"
                ],
                "time": "3"
            },
            {
                "name": "蛋黃醬(マヨネーズ)",
                "skillLv": "10",
                "item": [
                    "優質蛋"
                ],
                "sp": [
                    "HP+100",
                    "對麻痹的抗性提升"
                ],
                "time": "3"
            },
            {
                "name": "酸奶(ヨーグルト)",
                "skillLv": "10",
                "item": [
                    "白草",
                    "優質牛奶"
                ],
                "sp": [
                    "RP+50%"
                ],
                "time": "3"
            },
            {
                "name": "橙汁(オレンジジュース)",
                "skillLv": "11",
                "item": [
                    "橙子/橘子"
                ],
                "sp": [
                    "HP+20%",
                    "RP+45%",
                    "力量-1",
                    "體力-1",
                    "智力+5"
                ],
                "time": "3"
            },
            {
                "name": "菠蘿汁(パインジュース)",
                "skillLv": "13",
                "item": [
                    "菠蘿"
                ],
                "sp": [
                    "HP+20%",
                    "RP+40%",
                    "力量-1",
                    "智力+8"
                ],
                "time": "3"
            },
            {
                "name": "蔬菜汁(野菜ジュース)",
                "skillLv": "14",
                "item": [
                    "南瓜",
                    "櫻蕪菁",
                    "胡蘿蔔",
                    "菠菜"
                ],
                "sp": [
                    "HP+70%",
                    "RP+65%",
                    "RP上限+20%",
                    "力量-8",
                    "體力+1",
                    "智力+12",
                    "對異常狀態的抗性略微提升"
                ],
                "time": "3"
            },
            {
                "name": "蔬菜牛奶(野菜・オ・レ)",
                "skillLv": "15",
                "item": [
                    "蔬菜汁",
                    "牛奶"
                ],
                "sp": [
                    "HP+70%",
                    "RP+75%",
                    "HP上限+10",
                    "RP上限+30%",
                    "力量-10",
                    "體力+5",
                    "智力+16",
                    "對異常狀態的抗性略微提升"
                ],
                "time": "3"
            },
            {
                "name": "蛋黃醬(マヨネーズ)",
                "skillLv": "15",
                "item": [
                    "每天健康蛋"
                ],
                "sp": [
                    "HP+100",
                    "對麻痹的抗性提升"
                ],
                "time": "3"
            },
            {
                "name": "草莓牛奶(いちご牛乳)",
                "skillLv": "15",
                "item": [
                    "草莓",
                    "甘甜粉",
                    "牛奶"
                ],
                "sp": [
                    "HP+40%",
                    "RP+60%",
                    "體力+2",
                    "智力+8"
                ],
                "time": "3"
            },
            {
                "name": "葡萄汁(ぶどうジュース)",
                "skillLv": "15",
                "item": [
                    "葡萄"
                ],
                "sp": [
                    "HP+20%",
                    "RP+40%",
                    "體力+1",
                    "智力+3"
                ],
                "time": "3"
            },
            {
                "name": "新鮮果汁(フルーツジュース)",
                "skillLv": "16",
                "item": [
                    "菠蘿",
                    "蘋果",
                    "葡萄",
                    "橘子"
                ],
                "sp": [
                    "HP+55%",
                    "RP+60%",
                    "體力-8",
                    "智力+10"
                ],
                "time": "3"
            },
            {
                "name": "蔬菜牛奶(野菜・オ・レ)",
                "skillLv": "16",
                "item": [
                    "蔬菜汁",
                    "優質牛奶"
                ],
                "sp": [
                    "HP+70%",
                    "RP+75%",
                    "HP上限+10",
                    "RP上限+30%",
                    "力量-10",
                    "體力+5",
                    "智力+16",
                    "對異常狀態的抗性略微提升"
                ],
                "time": "3"
            },
            {
                "name": "草莓牛奶(いちご牛乳)",
                "skillLv": "17",
                "item": [
                    "草莓",
                    "甘甜粉",
                    "優質牛奶"
                ],
                "sp": [
                    "HP+40%",
                    "RP+60%",
                    "體力+2",
                    "智力+8"
                ],
                "time": "3"
            },
            {
                "name": "蔬菜牛奶(野菜・オ・レ)",
                "skillLv": "17",
                "item": [
                    "蔬菜汁",
                    "富鈣牛奶"
                ],
                "sp": [
                    "HP+70%",
                    "RP+75%",
                    "HP上限+10",
                    "RP上限+30%",
                    "力量-10",
                    "體力+5",
                    "智力+16",
                    "對異常狀態的抗性略微提升"
                ],
                "time": "3"
            },
            {
                "name": "黃油(バター)",
                "skillLv": "18",
                "item": [
                    "優質牛奶"
                ],
                "sp": [
                    "HP+20%",
                    "RP+15%",
                    "體力+5"
                ],
                "time": "3"
            },
            {
                "name": "果汁牛奶(フルーツ・オ・レ)",
                "skillLv": "18",
                "item": [
                    "果汁",
                    "牛奶"
                ],
                "sp": [
                    "HP+60%",
                    "RP+65%",
                    "體力-6",
                    "智力+14",
                    "治癒封印"
                ],
                "time": "3"
            },
            {
                "name": "番茄汁(トマトジュース)",
                "skillLv": "18",
                "item": [
                    "番茄"
                ],
                "sp": [
                    "HP+20%",
                    "RP+15%",
                    "智力+5",
                    "治癒疲勞"
                ],
                "time": "3"
            },
            {
                "name": "熱果汁(ホットジュース)",
                "skillLv": "19",
                "item": [
                    "火熱果實",
                    "紅草",
                    "香辛調料/重口味調料"
                ],
                "sp": [
                    "HP+60%",
                    "RP+25%",
                    "HP上限+25%",
                    "RP上限-25%",
                    "力量-45",
                    "會心一擊出現概率大幅提升，火屬性抗性+1"
                ],
                "time": "3"
            },
            {
                "name": "草莓牛奶(いちご牛乳)",
                "skillLv": "19",
                "item": [
                    "草莓",
                    "甘甜粉",
                    "富鈣牛奶"
                ],
                "sp": [
                    "HP+40%",
                    "RP+60%",
                    "體力+2",
                    "智力+8"
                ],
                "time": "3"
            },
            {
                "name": "果汁牛奶(フルーツ・オ・レ)",
                "skillLv": "19",
                "item": [
                    "果汁",
                    "優質牛奶"
                ],
                "sp": [
                    "HP+60%",
                    "RP+65%",
                    "體力-6",
                    "智力+14",
                    "治癒封印"
                ],
                "time": "3"
            },
            {
                "name": "果汁牛奶(フルーツ・オ・レ)",
                "skillLv": "20",
                "item": [
                    "果汁",
                    "富鈣牛奶"
                ],
                "sp": [
                    "HP+60%",
                    "RP+65%",
                    "體力-6",
                    "智力+14",
                    "治癒封印"
                ],
                "time": "3"
            },
            {
                "name": "奶酪(チーズ)",
                "skillLv": "20",
                "item": [
                    "黃草",
                    "牛奶"
                ],
                "sp": [
                    "RP+75%"
                ],
                "time": "3"
            },
            {
                "name": "酸奶(ヨーグルト)",
                "skillLv": "20",
                "item": [
                    "白草",
                    "富鈣牛奶"
                ],
                "sp": [
                    "RP+50%"
                ],
                "time": "3"
            },
            {
                "name": "混合果汁(ミックスジュース)",
                "skillLv": "22",
                "item": [
                    "蔬菜汁",
                    "果汁"
                ],
                "sp": [
                    "HP+80%",
                    "RP+80%",
                    "RP上限+30%",
                    "力量-6",
                    "體力-6",
                    "智力+18",
                    "對所有異常狀態抗性略微提升"
                ],
                "time": "3"
            },
            {
                "name": "番茄醬(ケチャップ)",
                "skillLv": "23",
                "item": [
                    "番茄",
                    "洋蔥"
                ],
                "sp": [
                    "HP+25%",
                    "RP+20%",
                    "HP上限+18"
                ],
                "time": "3"
            },
            {
                "name": "戀愛預感(戀の予感)",
                "skillLv": "24",
                "item": [
                    "少女甜瓜",
                    "草莓"
                ],
                "sp": [
                    "HP+40%",
                    "RP+60%",
                    "HP上限-50%",
                    "RP上限-50%",
                    "全屬性抗性+2"
                ],
                "time": "3"
            },
            {
                "name": "奶酪(チーズ)",
                "skillLv": "25",
                "item": [
                    "黃草",
                    "優質牛奶"
                ],
                "sp": [
                    "RP+75%"
                ],
                "time": "3"
            },
            {
                "name": "黃油(バター)",
                "skillLv": "27",
                "item": [
                    "富鈣牛奶"
                ],
                "sp": [
                    "HP+20%",
                    "RP+15%",
                    "體力+5"
                ],
                "time": "3"
            },
            {
                "name": "混合牛奶(ミックス･オ･レ)",
                "skillLv": "28",
                "item": [
                    "果汁牛奶",
                    "蔬菜牛奶"
                ],
                "sp": [
                    "HP+80%",
                    "RP+80%",
                    "HP上限+20%",
                    "體力+8",
                    "智力+19",
                    "對所有異常狀態抗性略微提升"
                ],
                "time": "3"
            },
            {
                "name": "奶酪(チーズ)",
                "skillLv": "30",
                "item": [
                    "黃草",
                    "富鈣牛奶"
                ],
                "sp": [
                    "RP+75%"
                ],
                "time": "3"
            },
            {
                "name": "黃金果汁(ゴールドジュース)",
                "skillLv": "32",
                "item": [
                    "金南瓜",
                    "金剛花",
                    "金土豆",
                    "金蕪菁",
                    "金捲心菜"
                ],
                "sp": [
                    "HP+50%",
                    "RP+50%",
                    "體力+10",
                    "智力+28%"
                ],
                "time": "3"
            }
        ]
    },
    {
        "category": "失敗作",
        "tab": "fail",
        "list": [
            {
                "name": "失敗作",
                "skillLv": "2",
                "item": [],
                "sp": [
                    "HP-20%",
                    "HP上限-10%",
                    "RP上限-10%",
                    "力量-10%",
                    "體力-10%",
                    "智力-10%"
                ],
                "time": ""
            },
            {
                "name": "超失敗作",
                "skillLv": "50",
                "item": [],
                "sp": [
                    "HP-80%",
                    "RP上限-25%",
                    "力量-25%",
                    "體力-25%",
                    "智力-25%"
                ],
                "time": ""
            }
        ]
    }
];
const drugRec = [
    {
        "name": "回復瓶",
        "skillLv": "4",
        "item1": "藥草",
        "item2": "藥草",
        "item3": "",
        "item4": "",
        "item5": "",
        "item6": "",
        "sp": [
            "HP+500"
        ]
    },
    {
        "name": "解毒藥",
        "skillLv": "8",
        "item1": "解毒草",
        "item2": "解毒草",
        "item3": "",
        "item4": "",
        "item5": "",
        "item6": "",
        "sp": [
            "毒狀態解除",
            "HP+300"
        ]
    },
    {
        "name": "甘甜粉",
        "skillLv": "9",
        "item1": "蘋果",
        "item2": "蘋果",
        "item3": "",
        "item4": "",
        "item5": "",
        "item6": "",
        "sp": [
            "智力+4"
        ]
    },
    {
        "name": "好肥料",
        "skillLv": "11",
        "item1": "綠草",
        "item2": "綠草",
        "item3": "紅草",
        "item4": "紅草",
        "item5": "",
        "item6": "",
        "sp": [
            "加快作物成長速度"
        ]
    },
    {
        "name": "重口味調料",
        "skillLv": "12",
        "item1": "紅草",
        "item2": "紅草",
        "item3": "",
        "item4": "",
        "item5": "",
        "item6": "",
        "sp": [
            "力量+4"
        ]
    },
    {
        "name": "回復瓶",
        "skillLv": "14",
        "item1": "托伊藥草",
        "item2": "",
        "item3": "",
        "item4": "",
        "item5": "",
        "item6": "",
        "sp": [
            "HP+500"
        ]
    },
    {
        "name": "麻痹藥",
        "skillLv": "14",
        "item1": "黃草",
        "item2": "黃草",
        "item3": "",
        "item4": "",
        "item5": "",
        "item6": "",
        "sp": [
            "麻痹狀態解除",
            "HP+500"
        ]
    },
    {
        "name": "酸味料",
        "skillLv": "15",
        "item1": "橘子",
        "item2": "黃草",
        "item3": "",
        "item4": "",
        "item5": "",
        "item6": "",
        "sp": [
            "體力+4"
        ]
    },
    {
        "name": "解封丸",
        "skillLv": "16",
        "item1": "紫草",
        "item2": "青草",
        "item3": "",
        "item4": "",
        "item5": "",
        "item6": "",
        "sp": [
            "封印狀態解除",
            "HP+500"
        ]
    },
    {
        "name": "中和劑",
        "skillLv": "17",
        "item1": "藍色妖姬",
        "item2": "解毒草",
        "item3": "",
        "item4": "",
        "item5": "",
        "item6": "",
        "sp": [
            "田地凈化毒沼"
        ]
    },
    {
        "name": "治療瓶",
        "skillLv": "20",
        "item1": "藥草",
        "item2": "藥草",
        "item3": "藥草",
        "item4": "",
        "item5": "",
        "item6": "",
        "sp": [
            "HP+1000"
        ]
    },
    {
        "name": "感冒藥",
        "skillLv": "21",
        "item1": "大蔥",
        "item2": "青椒",
        "item3": "綠草",
        "item4": "太陽草",
        "item5": "",
        "item6": "",
        "sp": [
            "感冒狀態解除",
            "HP+1000"
        ]
    },
    {
        "name": "好肥料",
        "skillLv": "22",
        "item1": "月淚草",
        "item2": "",
        "item3": "",
        "item4": "",
        "item5": "",
        "item6": "",
        "sp": [
            "加快作物成長速度"
        ]
    },
    {
        "name": "感冒藥",
        "skillLv": "27",
        "item1": "野之花火",
        "item2": "",
        "item3": "",
        "item4": "",
        "item5": "",
        "item6": "",
        "sp": [
            "感冒狀態解除",
            "HP+1000"
        ]
    },
    {
        "name": "快速肥料",
        "skillLv": "28",
        "item1": "青草",
        "item2": "青草",
        "item3": "紅草",
        "item4": "紅草",
        "item5": "",
        "item6": "",
        "sp": [
            "加快作物成長速度"
        ]
    },
    {
        "name": "中和劑",
        "skillLv": "29",
        "item1": "解毒草",
        "item2": "解毒草",
        "item3": "解毒草",
        "item4": "",
        "item5": "",
        "item6": "",
        "sp": [
            "田地凈化毒沼"
        ]
    },
    {
        "name": "進化之綠",
        "skillLv": "30",
        "item1": "結實的藤",
        "item2": "結實的藤",
        "item3": "古代魚之骨",
        "item4": "地之結晶",
        "item5": "",
        "item6": "",
        "sp": [
            "提升作物等級"
        ]
    },
    {
        "name": "麻痹藥",
        "skillLv": "31",
        "item1": "粉色貓咪",
        "item2": "",
        "item3": "",
        "item4": "",
        "item5": "",
        "item6": "",
        "sp": [
            "麻痹狀態解除",
            "HP+500"
        ]
    },
    {
        "name": "混合香料",
        "skillLv": "35",
        "item1": "月淚草",
        "item2": "托伊藥草",
        "item3": "粉色貓咪",
        "item4": "藍色妖姬",
        "item5": "",
        "item6": "",
        "sp": [
            "RP上限+25%"
        ]
    },
    {
        "name": "快速肥料",
        "skillLv": "36",
        "item1": "藍色妖姬",
        "item2": "",
        "item3": "",
        "item4": "",
        "item5": "",
        "item6": "",
        "sp": [
            "加快作物成長速度"
        ]
    },
    {
        "name": "神秘瓶",
        "skillLv": "40",
        "item1": "藥草",
        "item2": "藥草",
        "item3": "青草",
        "item4": "青草",
        "item5": "",
        "item6": "",
        "sp": [
            "HP+2000"
        ]
    },
    {
        "name": "治療瓶",
        "skillLv": "40",
        "item1": "樹形草",
        "item2": "",
        "item3": "",
        "item4": "",
        "item5": "",
        "item6": "",
        "sp": [
            "HP+1000"
        ]
    },
    {
        "name": "心靈飲料",
        "skillLv": "41",
        "item1": "綠水晶",
        "item2": "龍骨",
        "item3": "結實的藤",
        "item4": "魔法師之粉",
        "item5": "鐵千輪",
        "item6": "",
        "sp": [
            "HP最大值+10"
        ]
    },
    {
        "name": "強烈肥料",
        "skillLv": "42",
        "item1": "黃草",
        "item2": "黃草",
        "item3": "紅草",
        "item4": "紅草",
        "item5": "",
        "item6": "",
        "sp": [
            "加快作物成長速度"
        ]
    },
    {
        "name": "蛋白質",
        "skillLv": "43",
        "item1": "赤水晶",
        "item2": "貍貓樹葉",
        "item3": "結實的藤",
        "item4": "魔法師之粉",
        "item5": "菠菜",
        "item6": "",
        "sp": [
            "力量最大值+1"
        ]
    },
    {
        "name": "智力補品",
        "skillLv": "45",
        "item1": "白水晶",
        "item2": "冰壁碎片",
        "item3": "結實的藤",
        "item4": "魔法師之粉",
        "item5": "茄子",
        "item6": "",
        "sp": [
            "智力最大值+1"
        ]
    },
    {
        "name": "超營養水",
        "skillLv": "46",
        "item1": "燈草",
        "item2": "重口味調料",
        "item3": "酸奶",
        "item4": "奶酪",
        "item5": "惡魔之血",
        "item6": "咖喱粉",
        "sp": [
            "全部狀態異常解除",
            "RP回復+75%",
            "HP上限-90%",
            "力量+50",
            "體力+50",
            "智力+50"
        ]
    },
    {
        "name": "生命果凍/活力劑",
        "skillLv": "48",
        "item1": "青水晶",
        "item2": "獅子的紅毛",
        "item3": "獅子的藍毛",
        "item4": "結實的藤",
        "item5": "魔法師之粉",
        "item6": "",
        "sp": [
            "體力最大值+1"
        ]
    },
    {
        "name": "愛情飲料",
        "skillLv": "52",
        "item1": "少女甜瓜",
        "item2": "少女甜瓜",
        "item3": "草莓",
        "item4": "葡萄酒",
        "item5": "蜂蜜",
        "item6": "魔法師之粉",
        "sp": [
            "送禮提升對方好感度",
            "RP回復+50%"
        ]
    },
    {
        "name": "強烈肥料",
        "skillLv": "52",
        "item1": "櫻花草",
        "item2": "",
        "item3": "",
        "item4": "",
        "item5": "",
        "item6": "",
        "sp": [
            "加快作物成長速度"
        ]
    },
    {
        "name": "心靈飲料",
        "skillLv": "55",
        "item1": "綠水晶",
        "item2": "",
        "item3": "",
        "item4": "",
        "item5": "",
        "item6": "",
        "sp": [
            "HP最大值+10"
        ]
    },
    {
        "name": "蛋白質",
        "skillLv": "57",
        "item1": "赤水晶",
        "item2": "",
        "item3": "",
        "item4": "",
        "item5": "",
        "item6": "",
        "sp": [
            "力量最大值+1"
        ]
    },
    {
        "name": "智力補品",
        "skillLv": "59",
        "item1": "白水晶",
        "item2": "",
        "item3": "",
        "item4": "",
        "item5": "",
        "item6": "",
        "sp": [
            "智力最大值+1"
        ]
    },
    {
        "name": "神秘瓶",
        "skillLv": "60",
        "item1": "鐵千輪",
        "item2": "",
        "item3": "",
        "item4": "",
        "item5": "",
        "item6": "",
        "sp": [
            "HP+2000"
        ]
    },
    {
        "name": "生命果凍/活力劑",
        "skillLv": "62",
        "item1": "青水晶",
        "item2": "",
        "item3": "",
        "item4": "",
        "item5": "",
        "item6": "",
        "sp": [
            "體力最大值+1"
        ]
    },
    {
        "name": "超營養水",
        "skillLv": "66",
        "item1": "花紅葉",
        "item2": "",
        "item3": "",
        "item4": "",
        "item5": "",
        "item6": "",
        "sp": [
            "全部狀態異常解除",
            "RP回復+75%",
            "HP上限-90%",
            "力量+50",
            "體力+50",
            "智力+50"
        ]
    },
    {
        "name": "愛情飲料",
        "skillLv": "73",
        "item1": "金剛花",
        "item2": "",
        "item3": "",
        "item4": "",
        "item5": "",
        "item6": "",
        "sp": [
            "送禮提升對方好感度",
            "RP回復+50%"
        ]
    },
    {
        "name": "解封丸",
        "skillLv": "76",
        "item1": "燈草",
        "item2": "",
        "item3": "",
        "item4": "",
        "item5": "",
        "item6": "",
        "sp": [
            "封印狀態解除",
            "HP+500"
        ]
    },
    {
        "name": "無敵秘藥",
        "skillLv": "61",
        "item1": "營養水",
        "item2": "花紅葉",
        "item3": "南瓜",
        "item4": "金南瓜",
        "item5": "",
        "item6": "",
        "sp": [
            "解除所有異常狀態",
            "HP回復+100%",
            "RP回復+100%",
            "HP上限+25%",
            "RP上限+25%",
            "力量+10%",
            "體力+25%",
            "智力+10%"
        ]
    },
    {
        "name": "無敵秘藥",
        "skillLv": "82",
        "item1": "營養水",
        "item2": "花紅葉",
        "item3": "",
        "item4": "",
        "item5": "",
        "item6": "",
        "sp": [
            "解除所有異常狀態",
            "HP回復+100%",
            "RP回復+100%",
            "HP上限+25%",
            "RP上限+25%",
            "力量+10%",
            "體力+25%",
            "智力+10%"
        ]
    },
    {
        "name": "解毒藥",
        "skillLv": "82",
        "item1": "劇毒蒲公英",
        "item2": "",
        "item3": "",
        "item4": "",
        "item5": "",
        "item6": "",
        "sp": [
            "毒狀態解除",
            "HP+300"
        ]
    },
    {
        "name": "符文秘藥/熱帶加侖",
        "skillLv": "91",
        "item1": "四葉草",
        "item2": "四葉草",
        "item3": "四葉草",
        "item4": "野之花火",
        "item5": "野之花火",
        "item6": "蛋黃醬",
        "sp": [
            "等級+1"
        ]
    },
    {
        "name": "符文秘藥/熱帶加侖",
        "skillLv": "98",
        "item1": "四葉草",
        "item2": "",
        "item3": "",
        "item4": "",
        "item5": "",
        "item6": "",
        "sp": [
            "等級+1"
        ]
    }
];
const fishTown = [
    {
        "category": "石池通路、旅館旁邊的池塘",
        "tab": "town",
        "active": true,
        "data": {
            "spring": [
                "ヤマメ(真鱒魚)",
                "イカ(烏賊)",
                "フーインイカ(螢烏賊)",
                "ギンブナ(銀鮒魚)",
                "サヨリ(針魚)",
                "アマゴ(鱒魚/天魚)",
                "トキメキタイ(心跳鯛魚)",
                "稀有的空罐子",
                "空罐子",
                "長靴"
            ],
            "summer": [
                "イカ(烏賊)",
                "イワシ(鰯魚/沙丁魚)",
                "イワナ(巖魚)",
                "ウグイ(雅羅魚)",
                "カレイ(鰈魚)",
                "ジャマイカ(斑烏賊/南國章魚)",
                "エビ(蝦)",
                "ヘラブナ(鯽魚)",
                "ロブスター(龍蝦)",
                "トキメキタイ(心跳鯛魚)",
                "長靴",
                "稀有的空罐子"
            ],
            "autumn": [
                "タイ(鯛魚)",
                "サンマ(秋刀魚)",
                "サバ(鯖魚/鮐魚)",
                "サケ(鮭魚)",
                "カツオ(鰹魚)",
                "モミジヒラメ(紅葉比目魚)",
                "イカ(烏賊)",
                "トキメキタイ(心跳鯛魚)",
                "空罐子"
            ],
            "east": [
                "ワカサギ(公魚)",
                "メジナ(斑鲅魚)",
                "フグ(河豚)",
                "ヒラメ(比目魚)",
                "ドクニジマス(毒虹鱒魚/虹色魚)",
                "イカ(烏賊)",
                "トキメキタイ(心跳鯛魚)",
                "カガヤキタイ(銀鯛)",
                "稀有的空罐子",
                "長靴"
            ]
        }
    },
    {
        "category": "阿克娜湖",
        "tab": "lake",
        "data": {
            "spring": [
                "ヤマメ(真鱒魚)",
                "イカ(烏賊)",
                "フーインイカ(螢烏賊)",
                "ギンブナ(銀鮒魚)",
                "サヨリ(針魚)",
                "アマゴ(鱒魚/天魚)",
                "トキメキタイ(心跳鯛魚)",
                "稀有的空罐子",
                "空罐子",
                "長靴",
                "ヌッシーのうろこ(魚主之鱗)"
            ],
            "summer": [
                "ウグイ(石斑魚)",
                "イワシ(鰯魚/沙丁魚)",
                "イワナ(巖魚)",
                "ジャマイカ(斑烏賊/南國章魚)",
                "カレイ(鰈魚)",
                "ヘラブナ(鯽魚)",
                "エビ(蝦)",
                "ロブスター(龍蝦)",
                "イカ(烏賊)",
                "トキメキタイ(心跳鯛魚)",
                "ヌッシーのうろこ(魚主之鱗)"
            ],
            "autumn": [
                "モミジヒラメ(紅葉比目魚)",
                "タイ(鯛魚)",
                "サケ(鮭魚)",
                "サバ(鯖魚/鮐魚)",
                "イカ(烏賊)",
                "サンマ(秋刀魚)",
                "ヌッシーのうろこ(魚主之鱗)"
            ],
            "east": [
                "ワカサギ(公魚)",
                "メジナ(斑鲅魚)",
                "マグロ(金槍魚)",
                "ドクニジマス(毒虹鱒魚/虹色魚)",
                "イカ(烏賊)",
                "ヒラメ(比目魚)",
                "ブリ(鰤魚)",
                "イトウ(哲羅魚)",
                "トキメキタイ(心跳鯛魚)",
                "カガヤキタイ(閃光鯛魚)",
                "ヌッシーのうろこ(魚主之鱗)"
            ]
        }
    },
    {
        "category": "兄妹的釣魚館",
        "tab": "Fishing House",
        "data": {
            "spring": [
                "サケ(鮭魚)",
                "エビ(蝦)",
                "イワナ(巖魚)",
                "アマゴ(鱒魚/天魚)",
                "ギンブナ(銀鮒魚)",
                "サヨリ(針魚)",
                "イカ(烏賊)"
            ],
            "summer": [
                "サケ(鮭魚)",
                "エビ(蝦)"
            ],
            "autumn": [
                "エビ(蝦)",
                "サンマ(秋刀魚)",
                "サバ(鯖魚/鮐魚)",
                "サケ(鮭魚)",
                "イワナ(巖魚)",
                "イカ(烏賊)"
            ],
            "east": [
                "エビ(蝦)",
                "メジナ(斑鲅魚)",
                "イワナ(巖魚)",
                "サケ(鮭魚)"
            ]
        }
    }
];
const fishMaze = [
    {
        "category": "プリベラの森(普利貝拉之森) [春之迷宮]",
        "active": true,
        "tab": "spring",
        "list": [
            {
                "name": "蒼碧の細道",
                "data": [
                    "烏賊",
                    "針魚",
                    "真鱒魚",
                    "鱒魚/天魚",
                    "銀鮒魚",
                    "螢烏賊",
                    "心跳鯛魚"
                ]
            },
            {
                "name": "古の建造物跡",
                "data": [
                    "烏賊",
                    "針魚",
                    "真鱒魚",
                    "鱒魚/天魚",
                    "銀鮒魚",
                    "螢烏賊",
                    "心跳鯛魚"
                ]
            },
            {
                "name": "三日月島",
                "data": [
                    "烏賊",
                    "針魚",
                    "真鱒魚",
                    "鱒魚/天魚",
                    "銀鮒魚",
                    "螢烏賊",
                    "心跳鯛魚"
                ]
            },
            {
                "name": "浮き島",
                "data": [
                    "烏賊",
                    "針魚",
                    "真鱒魚",
                    "鱒魚/天魚",
                    "銀鮒魚",
                    "螢烏賊",
                    "心跳鯛魚"
                ]
            },
            {
                "name": "過去を見る島",
                "data": [
                    "烏賊",
                    "針魚",
                    "真鱒魚",
                    "鱒魚/天魚",
                    "銀鮒魚",
                    "螢烏賊",
                    "心跳鯛魚"
                ]
            }
        ]
    },
    {
        "category": "ソル・テラーノ砂漠(索爾・提拉諾沙漠) [夏之迷宮]",
        "tab": "summer",
        "list": [
            {
                "name": "水浴び骨",
                "data": [
                    "鰯魚/沙丁魚",
                    "鯽魚",
                    "雅羅魚",
                    "鰈魚",
                    "巖魚",
                    "蝦",
                    "龍蝦",
                    "烏賊",
                    "斑烏賊/南國章魚",
                    "心跳鯛魚"
                ]
            },
            {
                "name": "泳ぐ砂原",
                "data": [
                    "沙比目魚",
                    "巖石魚"
                ]
            }
        ]
    },
    {
        "category": "オッドワードの谷(奧德華之谷) [秋之迷宮]",
        "tab": "autumn",
        "list": [
            {
                "name": "虹登る滝",
                "data": [
                    "秋刀魚",
                    "鰹魚",
                    "鮭魚",
                    "鯛魚",
                    "鯖魚/鮐魚",
                    "烏賊"
                ]
            },
            {
                "name": "空映す水",
                "data": [
                    "秋刀魚",
                    "鰹魚",
                    "鮭魚",
                    "鯛魚",
                    "鯖魚/鮐魚",
                    "紅葉比目魚",
                    "心跳鯛魚"
                ]
            },
            {
                "name": "風呼びの谷",
                "data": [
                    "秋刀魚",
                    "鰹魚",
                    "鮭魚",
                    "鯛魚",
                    "鯖魚/鮐魚",
                    "紅葉比目魚",
                    "烏賊"
                ]
            },
            {
                "name": "頂の鳥居",
                "data": [
                    "秋刀魚",
                    "鰹魚",
                    "鮭魚",
                    "鯛魚",
                    "鯖魚/鮐魚",
                    "紅葉比目魚",
                    "烏賊",
                    "心跳鯛魚"
                ]
            }
        ]
    },
    {
        "category": "インヴァエル川(茵瓦艾爾河) [冬之迷宮]",
        "tab": "east",
        "list": [
            {
                "name": "氷のほとり",
                "data": [
                    "公魚",
                    "毒虹鱒魚/虹色魚",
                    "金槍魚",
                    "斑鲅魚",
                    "哲羅魚",
                    "心跳鯛魚",
                    "閃光鯛魚",
                    "比目魚",
                    "烏賊",
                    "鰤魚",
                    "河豚"
                ]
            },
            {
                "name": "風凍る岸辺",
                "data": [
                    "公魚",
                    "毒虹鱒魚/虹色魚",
                    "金槍魚",
                    "斑鲅魚",
                    "哲羅魚",
                    "心跳鯛魚",
                    "閃光鯛魚",
                    "比目魚",
                    "烏賊",
                    "鰤魚",
                    "河豚"
                ]
            },
            {
                "name": "氷沈む川",
                "data": [
                    "公魚",
                    "毒虹鱒魚/虹色魚",
                    "金槍魚",
                    "斑鲅魚",
                    "心跳鯛魚",
                    "閃光鯛魚",
                    "比目魚",
                    "烏賊"
                ]
            }
        ]
    }
];
const mazeData = [
    {
        "category": "春之迷宮",
        "active": true,
        "tab": "springmaze",
        "data": [
            {
                "name": "モコモコ(莫可莫可)",
                "defattr": [
                    "地+1",
                    "水+1"
                ],
                "lover": [
                    "リンゴ(蘋果)",
                    "だんご(糰子)",
                    "モコ綿(莫可棉)"
                ],
                "dropitem": [
                    "モコ綿(軟綿綿棉)",
                    "毛がりバサミ(毛剪)"
                ],
                "getitem": [
                    "ふわ毛(軟毛)",
                    "ふわふわ毛(軟軟的毛)",
                    "ふわふわモフモフ毛(軟軟綿綿的毛)"
                ],
                "area": [
                    "日差しの道"
                ]
            },
            {
                "name": "リーノ(蘋果怪)",
                "defattr": [],
                "lover": [
                    "リンゴ(蘋果)"
                ],
                "dropitem": [
                    "りんご(蘋果)",
                    "焼きりんご(烤蘋果)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "日差しの道"
                ]
            },
            {
                "name": "オーク(獸人)",
                "defattr": [
                    "火-1",
                    "地+1"
                ],
                "lover": [],
                "dropitem": [
                    "安物の腕輪(便宜的腕輪)",
                    "オークのボロ布(獸人的破布)",
                    "にかわ(骨膠)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "響く石"
                ]
            },
            {
                "name": "ハイオーク(高等獸人)",
                "defattr": [
                    "火-1",
                    "地+2"
                ],
                "lover": [
                    "おさしみ(刺身)"
                ],
                "dropitem": [
                    "安物の腕輪(便宜的腕輪)",
                    "オークのボロ布(獸人的破布)",
                    "にかわ(骨膠)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "蒼碧の細道",
                    "見つめる瞳",
                    "見屆ける瞳"
                ]
            },
            {
                "name": "オークアーチャー(獸人弓箭手)",
                "defattr": [
                    "火-1",
                    "地+1"
                ],
                "lover": [],
                "dropitem": [
                    "さびた矢尻(生鏽的箭頭)",
                    "射手の発火薬(射手的火藥)",
                    "回復のポット(回復瓶)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "響く石",
                    "浮き島",
                    "見屆ける瞳"
                ]
            },
            {
                "name": "オークハンター(獸人獵手)",
                "defattr": [
                    "火-1",
                    "地+2"
                ],
                "lover": [],
                "dropitem": [
                    "さびた矢尻(生鏽的箭頭)",
                    "射手の発火薬(射手的火藥)",
                    "回復のポット(回復瓶)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "見つめる瞳",
                    "見屆ける瞳",
                    "古の建造物跡"
                ]
            },
            {
                "name": "ライダーオーク(獸人騎兵)",
                "defattr": [
                    "地-1",
                    "水+1"
                ],
                "lover": [],
                "dropitem": [
                    "戦士の証(展示之證)",
                    "オークのボロ布(獸人的破布)",
                    "にかわ(骨膠)",
                    "ゴブリンの包帯(哥布林的繃帶)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "見つめる瞳",
                    "見屆ける瞳"
                ]
            },
            {
                "name": "エレバン(大象)",
                "defattr": [],
                "lover": [],
                "dropitem": [
                    "ボロのじょうろ(破灑水壺)",
                    "毛皮",
                    "上質の毛皮"
                ],
                "getitem": [
                    "無",
                    "可騎乘"
                ],
                "area": [
                    "見つめる瞳"
                ]
            },
            {
                "name": "ビートル(甲蟲)",
                "defattr": [
                    "地-1",
                    "風+1"
                ],
                "lover": [],
                "dropitem": [
                    "強固な角(堅固的角)",
                    "蟲の皮(蟲皮)",
                    "キレイな蟲の皮(漂亮蟲皮)"
                ],
                "getitem": [
                    "強固な角(堅固的角)",
                    "可以騎乘"
                ],
                "area": [
                    "見つめる瞳",
                    "古の建造物跡"
                ]
            },
            {
                "name": "スパイダー(蜘蛛)",
                "defattr": [
                    "地+1",
                    "風-1"
                ],
                "lover": [],
                "dropitem": [
                    "丈夫なクモ糸(結實的蜘蛛絲)",
                    "キレイなクモ糸(漂亮的蜘蛛絲)",
                    "昆蟲のアゴ(昆蟲的下顎)"
                ],
                "getitem": [
                    "丈夫なクモ糸(結實的蜘蛛絲)"
                ],
                "area": [
                    "三日月島"
                ]
            },
            {
                "name": "アント(螞蟻)",
                "defattr": [
                    "地+1",
                    "風-1"
                ],
                "lover": [],
                "dropitem": [
                    "木材",
                    "蟲の皮(蟲皮)",
                    "キレイな蟲の皮(漂亮蟲皮)",
                    "昆蟲のアゴ(昆蟲的下顎)"
                ],
                "getitem": [
                    "蟲の皮(蟲皮)"
                ],
                "area": [
                    "見つめる瞳",
                    "三日月島",
                    "蒼碧の細道"
                ]
            },
            {
                "name": "キラーアント(殺人螞蟻)",
                "defattr": [
                    "地+2",
                    "風-1"
                ],
                "lover": [],
                "dropitem": [
                    "木材",
                    "蟲の皮(蟲皮)",
                    "キレイな蟲の皮(漂亮蟲皮)",
                    "昆蟲のアゴ(昆蟲的下顎)"
                ],
                "getitem": [
                    "蟲の皮(蟲皮)"
                ],
                "area": [
                    "三日月島",
                    "蒼碧の細道"
                ]
            },
            {
                "name": "バッファモー(溫牛)",
                "defattr": [],
                "lover": [
                    "牛乳(牛奶)"
                ],
                "dropitem": [
                    "牛乳(牛奶)",
                    "良い牛乳(優質牛奶)"
                ],
                "getitem": [
                    "牛乳(牛奶)",
                    "良い牛乳(優質牛奶)",
                    "カルシウム満點牛乳(鈣滿點牛奶)",
                    "可以騎乘"
                ],
                "area": [
                    "見屆ける瞳"
                ]
            },
            {
                "name": "チロリ(奇羅利)",
                "defattr": [
                    "地+1",
                    "風-1"
                ],
                "lover": [
                    "リンゴ(蘋果)"
                ],
                "dropitem": [
                    "枝",
                    "毛皮",
                    "上質の毛皮"
                ],
                "getitem": [
                    "毛皮"
                ],
                "area": [
                    "見屆ける瞳"
                ]
            },
            {
                "name": "フラワーブロッサム(怪花)",
                "defattr": [
                    "地+1",
                    "風-1"
                ],
                "lover": [],
                "dropitem": [
                    "植物の莖(植物的莖)",
                    "植物の根(植物的根)",
                    "丈夫なツル(結實的藤)"
                ],
                "getitem": [
                    "植物の根(植物的根)"
                ],
                "area": [
                    "三日月島",
                    "浮き島"
                ]
            },
            {
                "name": "リーフボール(葉球)",
                "defattr": [
                    "地-1",
                    "風+1"
                ],
                "lover": [
                    "トイハーブ(托伊藥草)"
                ],
                "dropitem": [
                    "植物の莖(植物的莖)",
                    "植物の根(植物的根)",
                    "丈夫なツル(結實的藤)"
                ],
                "getitem": [
                    "植物の莖(植物的莖)"
                ],
                "area": [
                    "見つめる瞳",
                    "古の建造物跡"
                ]
            },
            {
                "name": "ビッグマッシュ(大蘑菇)",
                "defattr": [
                    "地+1",
                    "風-1"
                ],
                "lover": [],
                "dropitem": [
                    "キノコの胞子(蘑菇孢子)",
                    "毒の粉(毒粉)",
                    "植物の莖(植物的莖)"
                ],
                "getitem": [
                    "キノコの胞子(蘑菇孢子)",
                    "可以騎乘"
                ],
                "area": [
                    "蒼碧の細道"
                ]
            },
            {
                "name": "オニオンゴースト(洋蔥幽靈/蔥頭鬼)",
                "defattr": [
                    "地+2",
                    "暗+2"
                ],
                "lover": [],
                "dropitem": [
                    "たまねぎの種(洋蔥的種子)",
                    "タマネギ(洋蔥)",
                    "浮遊霊の頭巾(浮游靈的頭巾)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "見つめる瞳",
                    "見屆ける瞳"
                ]
            },
            {
                "name": "ヘラクレス(巨鉗蟲)",
                "defattr": [
                    "風+2"
                ],
                "lover": [],
                "dropitem": [
                    "強固な角(堅固的角)",
                    "蟲の皮(蟲皮)",
                    "キレイな蟲の皮(漂亮蟲皮"
                ],
                "getitem": [
                    "強固な角(堅固的角)",
                    "可以騎乘"
                ],
                "area": [
                    "浮き島"
                ]
            },
            {
                "name": "プランコア(植物之核/普蘭之核)",
                "defattr": [
                    "風+1"
                ],
                "lover": [],
                "dropitem": [
                    "植物の莖(植物的莖)",
                    "植物の根(植物的根)",
                    "丈夫なツル(結實的藤)"
                ],
                "getitem": [
                    "植物の莖(植物的莖)"
                ],
                "area": [
                    "浮き島"
                ]
            },
            {
                "name": "タヌゴロー(貍貓)",
                "defattr": [
                    "地+2",
                    "風+2"
                ],
                "lover": [],
                "dropitem": [
                    "うどん(烏冬面)",
                    "カレーうどん(咖喱烏冬面)",
                    "天ぷらうどん(天婦羅烏冬面)",
                    "たぬきの葉っぱ(貍貓樹葉)"
                ],
                "getitem": [
                    "不可作同伴"
                ],
                "area": [
                    "陽光集う場所"
                ]
            },
            {
                "name": "グレーターデーモン(終極惡魔)",
                "defattr": [
                    "火+1",
                    "水+1",
                    "地+1",
                    "風+1",
                    "光+1",
                    "暗+1",
                    "愛-1"
                ],
                "lover": [],
                "dropitem": [
                    "毛皮",
                    "上質の毛皮",
                    "グレートな胸毛(豪邁的胸毛)"
                ],
                "getitem": [
                    "不可作同伴"
                ],
                "area": [
                    "過去を見る島"
                ]
            },
            {
                "name": "キメラ(奇美拉)",
                "defattr": [
                    "火+2",
                    "水+4",
                    "地+2",
                    "風+2",
                    "光+2"
                ],
                "lover": [],
                "dropitem": [
                    "キメラのしっぽ(奇美拉之尾)",
                    "悪魔の血(惡魔之血)"
                ],
                "getitem": [
                    "不可作同伴"
                ],
                "area": [
                    "過去を見る島"
                ]
            },
            {
                "name": "オクトパイレーツ(奧科特海盜)",
                "defattr": [
                    "火+4",
                    "水+4",
                    "地+1",
                    "光+1",
                    "暗+1",
                    "愛-1"
                ],
                "lover": [],
                "dropitem": [
                    "アンモナイト(鸚鵡螺化石)",
                    "古代魚の骨(古代魚之骨)",
                    "バイタルグミ(生命果凍)"
                ],
                "getitem": [
                    "不可作同伴"
                ],
                "area": [
                    "過去を見る島"
                ]
            },
            {
                "name": "クリスタルマンモス(水晶猛犸/水晶毛象)",
                "defattr": [
                    "水+4",
                    "地+2",
                    "風+1",
                    "光+1",
                    "暗+1"
                ],
                "lover": [],
                "dropitem": [
                    "氷の鼻(冰之鼻)",
                    "ダイヤモンド(鑽石)"
                ],
                "getitem": [
                    "不可作同伴"
                ],
                "area": [
                    "過去を見る島"
                ]
            },
            {
                "name": "グリモア(格里莫亞)",
                "defattr": [
                    "火+2",
                    "水+2",
                    "風+4",
                    "光+2",
                    "暗+2"
                ],
                "lover": [],
                "dropitem": [
                    "グリモアのうろこ(格里莫亞之鱗)",
                    "ドラゴンの牙(龍之牙)"
                ],
                "getitem": [
                    "不可作同伴"
                ],
                "area": [
                    "過去を見る島"
                ]
            }
        ]
    },
    {
        "category": "夏之迷宮",
        "tab": "summermaze",
        "data": [
            {
                "name": "ダック(鴨子)",
                "defattr": [],
                "lover": [],
                "dropitem": [
                    "毛皮",
                    "上質の毛皮(優質的毛皮)",
                    "鳥の羽(鳥之羽)"
                ],
                "getitem": [
                    "無",
                    "可以騎乘"
                ],
                "area": [
                    "水浴び骨"
                ]
            },
            {
                "name": "ナッピー(菠蘿怪)",
                "defattr": [],
                "lover": [],
                "dropitem": [
                    "パイナップル(菠蘿)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "水浴び骨"
                ]
            },
            {
                "name": "トマトーガイスト(番茄幽靈/番茄鬼)",
                "defattr": [
                    "火+2",
                    "暗+2"
                ],
                "lover": [
                    "トマト(番茄)"
                ],
                "dropitem": [
                    "トマトの種(番茄的種子)",
                    "トマト(番茄)",
                    "浮遊霊の頭巾(浮游靈的頭巾)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "熱読み原",
                    "眠る竜骨"
                ]
            },
            {
                "name": "スライム(史萊姆)",
                "defattr": [
                    "火+1",
                    "水+1",
                    "地+1",
                    "風+1",
                    "光+1",
                    "暗+2",
                    "愛-2"
                ],
                "lover": [],
                "dropitem": [
                    "小さな結晶(小結晶)",
                    "エメラルド(綠寶石)",
                    "ルビー(紅寶石)"
                ],
                "getitem": [
                    "小さな結晶(小結晶)"
                ],
                "area": [
                    "水浴び骨"
                ]
            },
            {
                "name": "モンスターボックス(怪物箱)",
                "defattr": [
                    "光-1",
                    "暗+1"
                ],
                "lover": [],
                "dropitem": [
                    "失敗作",
                    "超失敗作",
                    "壊れた柄(壞掉的柄)",
                    "壊れた木箱(壞掉的木箱)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "眠る竜骨"
                ]
            },
            {
                "name": "スコーピオン(蝎子)",
                "defattr": [
                    "光-1",
                    "暗+1"
                ],
                "lover": [],
                "dropitem": [
                    "サソリの尻尾(蝎子的尾巴)",
                    "サソリのはさみ(蝎子的鉗)",
                    "蟲の皮(蟲皮)",
                    "キレイな蟲の皮(漂亮蟲皮)"
                ],
                "getitem": [
                    "サソリの尻尾(蝎子的尾巴)"
                ],
                "area": [
                    "別砂巖",
                    "熱読み原"
                ]
            },
            {
                "name": "デスストーカー(死亡之蝎)",
                "defattr": [
                    "光-1",
                    "暗+2"
                ],
                "lover": [],
                "dropitem": [
                    "サソリの尻尾(蝎子的尾巴)",
                    "サソリのはさみ(蝎子的鉗子)",
                    "蟲の皮(蟲皮)",
                    "キレイな蟲の皮(漂亮蟲皮)"
                ],
                "getitem": [
                    "サソリの尻尾(蝎子的尾巴)"
                ],
                "area": [
                    "砂の陽炎",
                    "緑育つ巖間"
                ]
            },
            {
                "name": "チンピラゴブリン(流氓哥布林)",
                "defattr": [
                    "火+1",
                    "風--1"
                ],
                "lover": [],
                "dropitem": [
                    "油",
                    "海賊ゴブリンの布(海賊哥布林的布)",
                    "ゴブリンの包帯(哥布林的繃帶)",
                    "ドクロ(骷髏)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "砂呼び原"
                ]
            },
            {
                "name": "ゴブリンパイレーツ(哥布林海盜)",
                "defattr": [
                    "火+1",
                    "風-1"
                ],
                "lover": [],
                "dropitem": [
                    "油",
                    "海賊ゴブリンの布(海賊哥布林的布)",
                    "シルクの布(絲綢)",
                    "ドクロ(骷髏)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "別砂巖",
                    "砂呼び原"
                ]
            },
            {
                "name": "キャプテンゴブリン(船長哥布林)",
                "defattr": [
                    "火+2",
                    "風-1"
                ],
                "lover": [],
                "dropitem": [
                    "海賊ゴブリンの布(海賊哥布林的布)",
                    "シルクの布(絲綢)",
                    "ドクロ(骷髏)",
                    "ワイン(紅酒)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "泳ぐ砂原",
                    "緑育つ巖間"
                ]
            },
            {
                "name": "ゴブリンドン(哥布林頓)",
                "defattr": [
                    "火+2",
                    "風-1"
                ],
                "lover": [],
                "dropitem": [
                    "海賊ゴブリンの布(海賊哥布林的布)",
                    "ゴブリンの包帯(哥布林的繃帶)",
                    "ドクロ(骷髏)",
                    "ワイン(紅酒)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "泳ぐ砂原"
                ]
            },
            {
                "name": "シャドウパンサー(影豹)",
                "defattr": [
                    "光-1",
                    "暗+1"
                ],
                "lover": [],
                "dropitem": [
                    "毛皮",
                    "上質の毛皮",
                    "豹の爪(豹爪)"
                ],
                "getitem": [
                    "豹の爪(豹爪)",
                    "可以騎乘"
                ],
                "area": [
                    "泳ぐ砂原",
                    "眠る竜骨"
                ]
            },
            {
                "name": "ウィーグル(風鳥)",
                "defattr": [
                    "地-1",
                    "風+1"
                ],
                "lover": [],
                "dropitem": [
                    "枝(樹枝)",
                    "鳥の羽(鳥之羽)"
                ],
                "getitem": [
                    "鳥の羽(鳥之羽)"
                ],
                "area": [
                    "砂の陽炎"
                ]
            },
            {
                "name": "イグニス(伊格尼斯/火精靈)",
                "defattr": [
                    "火+4",
                    "水-2",
                    "地+1",
                    "風+1",
                    "光+1",
                    "暗+1"
                ],
                "lover": [],
                "dropitem": [
                    "火の結晶(火之結晶)",
                    "魔力の結晶(魔力結晶)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "緑育つ巖間",
                    "砂の陽炎"
                ]
            },
            {
                "name": "フラワーライオン(獅子花)",
                "defattr": [
                    "火+1",
                    "水-1"
                ],
                "lover": [],
                "dropitem": [
                    "植物の莖(植物的莖)",
                    "植物の根(植物的根)",
                    "丈夫なツル(結實的藤)"
                ],
                "getitem": [
                    "植物の根(植物的根)"
                ],
                "area": [
                    "熱読み原"
                ]
            },
            {
                "name": "トリッキーマッシュ(狡猾毒蘑菇)",
                "defattr": [
                    "地+1",
                    "風-1"
                ],
                "lover": [],
                "dropitem": [
                    "キノコの胞子(蘑菇的孢子)",
                    "毒の粉(毒粉)",
                    "植物の莖(植物的莖)"
                ],
                "getitem": [
                    "キノコの胞子(蘑菇的孢子)",
                    "可以騎乘"
                ],
                "area": [
                    "泳ぐ砂原"
                ]
            },
            {
                "name": "トロル(食人魔)",
                "defattr": [],
                "lover": [],
                "dropitem": [
                    "巨人の爪(巨人之爪)",
                    "巨人の手袋(巨人的手套)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "別砂巖"
                ]
            },
            {
                "name": "タイタン(泰坦)",
                "defattr": [
                    "地+1",
                    "風-1"
                ],
                "lover": [],
                "dropitem": [
                    "巨人の爪(巨人之爪)",
                    "巨人の手袋(巨人的手套)"
                ],
                "getitem": [
                    "無",
                    "可以騎乘"
                ],
                "area": [
                    "熱読み原"
                ]
            },
            {
                "name": "ハンマートロル(巨錘食人魔)",
                "defattr": [],
                "lover": [],
                "dropitem": [
                    "巨人の爪(巨人之爪)",
                    "巨人の手袋(巨人的手套)",
                    "ハンマーの破片(錘子的碎片)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "緑育つ巖間"
                ]
            },
            {
                "name": "マスタートロル(終極食人魔)",
                "defattr": [],
                "lover": [],
                "dropitem": [
                    "巨人の爪(巨人之爪)",
                    "巨人の手袋(巨人的手套)",
                    "ハンマーの破片(錘子的碎片)",
                    "超栄水(超營養水)"
                ],
                "getitem": [],
                "area": [
                    "泳ぐ砂原"
                ]
            },
            {
                "name": "ビッグダック(大鴨/巨鴨)",
                "defattr": [
                    "火+1",
                    "水+1",
                    "地+1",
                    "風+1",
                    "暗+1",
                    "愛+2"
                ],
                "lover": [],
                "dropitem": [
                    "毛皮",
                    "上質の毛皮(優質的毛皮)",
                    "鳥の羽(鳥質羽)",
                    "超栄水(超營養水)"
                ],
                "getitem": [],
                "area": [
                    "眠る竜骨"
                ]
            },
            {
                "name": "エンシェントボーン(遠古之骨/古代龍骨)",
                "defattr": [
                    "火-1",
                    "水+1",
                    "地+2",
                    "風+1",
                    "光-1",
                    "暗+4",
                    "愛-1"
                ],
                "lover": [],
                "dropitem": [
                    "竜の骨(龍骨)",
                    "古代魚の骨(古代魚之骨)",
                    "ドクロ(骷髏)"
                ],
                "getitem": [
                    "不可作同伴"
                ],
                "area": [
                    "風止まり竜骨舞う砂原"
                ]
            }
        ]
    },
    {
        "category": "秋之迷宮",
        "tab": "autumnmaze",
        "data": [
            {
                "name": "ゴブリン(哥布林)",
                "defattr": [
                    "地-1",
                    "風+1"
                ],
                "lover": [],
                "dropitem": [
                    "戦士の証(戰士之證)",
                    "にかわ(骨膠)",
                    "おにぎり(飯糰)",
                    "ゴブリンの包帯(哥布林的繃帶)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "風飛びの谷",
                    "風流れの谷"
                ]
            },
            {
                "name": "ホブゴブリン(快刀哥布林)",
                "defattr": [
                    "地-1",
                    "風+2"
                ],
                "lover": [],
                "dropitem": [
                    "戦士の証(戰士之證)",
                    "にかわ(骨膠)",
                    "おにぎり(飯糰)",
                    "ゴブリンの包帯(哥布林的繃帶)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "風呼びの谷",
                    "木々の道"
                ]
            },
            {
                "name": "バッファロー(野牛)",
                "defattr": [],
                "lover": [],
                "dropitem": [
                    "闘牛の角(鬥牛之角)"
                ],
                "getitem": [
                    "狼の牙(狼牙)",
                    "可以騎乘"
                ],
                "area": [
                    "風紋の洞",
                    "風流れの谷"
                ]
            },
            {
                "name": "ミーノ(米諾)",
                "defattr": [],
                "lover": [],
                "dropitem": [
                    "ブドウ(葡萄)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "風紋の洞"
                ]
            },
            {
                "name": "コケホッホー(打鳴雞)",
                "defattr": [],
                "lover": [
                    "卵(蛋)"
                ],
                "dropitem": [
                    "卵(蛋)",
                    "良い卵(優質蛋)",
                    "鳥の羽(鳥之羽)"
                ],
                "getitem": [
                    "卵(蛋)",
                    "良い卵(優質蛋)",
                    "毎日ケンコー卵(每天健康蛋)"
                ],
                "area": [
                    "風紋の洞"
                ]
            },
            {
                "name": "トータス(陸龜)",
                "defattr": [
                    "火-1",
                    "水+1"
                ],
                "lover": [],
                "dropitem": [
                    "カメのこうら(龜殼)",
                    "鉄",
                    "銅"
                ],
                "getitem": [
                    "無",
                    "可以騎乘"
                ],
                "area": [
                    "風紋の洞",
                    "風流れの谷",
                    "空映す水"
                ]
            },
            {
                "name": "ゴブリンスナイパー(哥布林狙擊手)",
                "defattr": [
                    "地-1",
                    "風+2"
                ],
                "lover": [],
                "dropitem": [
                    "ゴブリンの包帯(哥布林的繃帶)",
                    "さびた矢尻(生鏽的箭頭)",
                    "射手の発火薬(射手的火藥)",
                    "回復のポット(回復瓶)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "木々の道"
                ]
            },
            {
                "name": "ゴブリンアーチャー(哥布林弓箭手)",
                "defattr": [
                    "地-1",
                    "風+1"
                ],
                "lover": [],
                "dropitem": [
                    "ゴブリンの包帯(哥布林的繃帶)",
                    "さびた矢尻(生鏽的箭頭)",
                    "射手の発火薬(射手的火藥)",
                    "回復のポット(回復瓶)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "風飛びの谷"
                ]
            },
            {
                "name": "ブラックバード(黑鳥)",
                "defattr": [
                    "地-1",
                    "風+2"
                ],
                "lover": [],
                "dropitem": [
                    "鳥の羽(鳥之羽)",
                    "枝(樹枝)"
                ],
                "getitem": [
                    "鳥の羽(鳥之羽)"
                ],
                "area": [
                    "風飛びの谷"
                ]
            },
            {
                "name": "スカイフィッシュ(空魚)",
                "defattr": [
                    "火-1",
                    "水+2"
                ],
                "lover": [],
                "dropitem": [
                    "古代魚の骨(古代魚之骨)",
                    "あきかん(空罐子)",
                    "レアなあきかん(稀有的空罐子)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "風流れの谷",
                    "空映す水"
                ]
            },
            {
                "name": "ホーネット(大黃蜂)",
                "defattr": [
                    "火-1",
                    "風+1"
                ],
                "lover": [
                    "ハチミツ(蜂蜜)"
                ],
                "dropitem": [
                    "ハチミツ(蜂蜜)",
                    "蟲の皮(蟲皮)",
                    "キレイな蟲の皮(漂亮蟲皮)",
                    "昆蟲のアゴ(昆蟲的下顎)"
                ],
                "getitem": [
                    "ハチミツ(蜂蜜)"
                ],
                "area": [
                    "風飛びの谷"
                ]
            },
            {
                "name": "ヘラクレス(巨鉗蟲)",
                "defattr": [
                    "風+2"
                ],
                "lover": [],
                "dropitem": [
                    "強固な角(堅固的角)",
                    "蟲の皮(蟲皮)",
                    "キレイな蟲の皮(漂亮蟲皮)"
                ],
                "getitem": [
                    "強固な角(堅固的角)",
                    "可以騎乘"
                ],
                "area": [
                    "風よけの丘"
                ]
            },
            {
                "name": "ヘルスパイダー(地獄蜘蛛)",
                "defattr": [
                    "地+1",
                    "風+2"
                ],
                "lover": [],
                "dropitem": [
                    "丈夫なクモ糸(結實的蜘蛛絲)",
                    "キレイなクモ糸(漂亮的蜘蛛絲)",
                    "昆蟲のアゴ(昆蟲的下顎)"
                ],
                "getitem": [
                    "丈夫なクモ糸(結實的蜘蛛絲)"
                ],
                "area": [
                    "風よけの丘"
                ]
            },
            {
                "name": "フラワーリリウム(百合花)",
                "defattr": [
                    "水-1",
                    "風+1"
                ],
                "lover": [],
                "dropitem": [
                    "植物の莖(植物的莖)",
                    "植物の根(植物的根)",
                    "丈夫なツル(結實的藤)"
                ],
                "getitem": [
                    "植物の根(植物的根)"
                ],
                "area": [
                    "風よけの丘"
                ]
            },
            {
                "name": "フェアリー(小精靈/小仙女)",
                "defattr": [
                    "火+1",
                    "水+1",
                    "地-1",
                    "風+3",
                    "光+1",
                    "暗+1"
                ],
                "lover": [],
                "dropitem": [
                    "妖精の粉(妖精之粉)",
                    "戀の予感(戀愛預感)",
                    "ラブ飲みドリンク(愛情飲料)"
                ],
                "getitem": [
                    "妖精の粉(妖精之粉)"
                ],
                "area": [
                    "遠望峠"
                ]
            },
            {
                "name": "フワリ(芙瓦利)",
                "defattr": [
                    "地+1",
                    "風-1"
                ],
                "lover": [],
                "dropitem": [
                    "枝",
                    "毛皮",
                    "上質の毛皮"
                ],
                "getitem": [
                    "毛皮"
                ],
                "area": [
                    "風よけの丘"
                ]
            },
            {
                "name": "ミノタウロス(牛頭怪/米諾陶洛斯)",
                "defattr": [
                    "光-1",
                    "暗+1"
                ],
                "lover": [],
                "dropitem": [
                    "ザ・プロテイン(蛋白質)",
                    "魔人の角(魔人之角)",
                    "ハンマーの破片(錘子的碎片)"
                ],
                "getitem": [
                    "無",
                    "可以騎乘"
                ],
                "area": [
                    "遠望峠",
                    "頂の鳥居"
                ]
            },
            {
                "name": "ギガンテス(終極巨人/基岡提斯)",
                "defattr": [
                    "火+1",
                    "水-1"
                ],
                "lover": [],
                "dropitem": [
                    "巨人の爪(巨人之爪)",
                    "巨人の手袋(巨人的手套)",
                    "ハンマーの破片(錘子的碎片)"
                ],
                "getitem": [
                    "無",
                    "可以騎乘"
                ],
                "area": [
                    "遠望峠",
                    "頂の鳥居"
                ]
            },
            {
                "name": "プランコア(植物核心/普蘭之核)",
                "defattr": [
                    "風+1"
                ],
                "lover": [],
                "dropitem": [
                    "植物の莖(植物的莖)",
                    "植物の根(植物的根)",
                    "丈夫なツル(結實的藤)"
                ],
                "getitem": [
                    "植物の莖(植物的莖)"
                ],
                "area": [
                    "風よけの丘"
                ]
            },
            {
                "name": "ビックリピーマン(青椒幽靈/嚇人青椒)",
                "defattr": [
                    "火+1",
                    "水+1",
                    "風+2",
                    "光+1",
                    "暗+2"
                ],
                "lover": [],
                "dropitem": [
                    "ピーマンの種(青椒的種子)",
                    "ピーマン(青椒)",
                    "浮遊霊の頭巾(浮游靈的頭巾)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "遠望峠"
                ]
            },
            {
                "name": "デスファンガス(死亡真菌)",
                "defattr": [
                    "火+1",
                    "水+1",
                    "地+4",
                    "光+1",
                    "暗+1"
                ],
                "lover": [],
                "dropitem": [
                    "キノコの胞子(蘑菇孢子)",
                    "毒の粉(毒粉)"
                ],
                "getitem": [],
                "area": [
                    "遠望峠"
                ]
            },
            {
                "name": "ひのえ(紅獅子)",
                "defattr": [
                    "火+3",
                    "愛-1"
                ],
                "lover": [],
                "dropitem": [
                    "獅子の赤毛(獅子的紅毛)",
                    "毛皮",
                    "上質の毛皮"
                ],
                "getitem": [
                    "不可作同伴"
                ],
                "area": [
                    "時を重ねる庭"
                ]
            },
            {
                "name": "きのと(藍獅子)",
                "defattr": [
                    "火+1",
                    "水+1",
                    "風+3",
                    "光+1",
                    "暗+1",
                    "愛-1"
                ],
                "lover": [],
                "dropitem": [
                    "獅子の青毛(獅子的藍毛)",
                    "毛皮",
                    "上質の毛皮"
                ],
                "getitem": [
                    "不可作同伴"
                ],
                "area": [
                    "時を重ねる庭"
                ]
            }
        ]
    },
    {
        "category": "冬之迷宮",
        "tab": "eastmaze",
        "data": [
            {
                "name": "フラワークリスタル(水晶花)",
                "defattr": [
                    "火-1",
                    "水+1"
                ],
                "lover": [],
                "dropitem": [
                    "植物の根(植物的根)",
                    "植物の莖(植物的莖)",
                    "丈夫なツル(結實的藤)"
                ],
                "getitem": [
                    "植物の根(植物的根)"
                ],
                "area": [
                    "風凍る岸辺",
                    "歩み凍る道"
                ]
            },
            {
                "name": "シーラ(希拉魚)",
                "defattr": [
                    "火-1",
                    "水+3",
                    "地+1",
                    "風+1",
                    "光+1",
                    "暗+1"
                ],
                "lover": [],
                "dropitem": [
                    "古代魚の骨(古代魚之骨)",
                    "あきかん(空罐子)",
                    "レアなあきかん(稀有的空罐子)"
                ],
                "getitem": [
                    "無",
                    "可以騎乘"
                ],
                "area": [
                    "大地覗く氷"
                ]
            },
            {
                "name": "ユッキー(雪人/由奇)",
                "defattr": [],
                "lover": [],
                "dropitem": [
                    "オレンジ(橘子)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "風凍る岸辺"
                ]
            },
            {
                "name": "シルバーウルフ(銀狼)",
                "defattr": [
                    "火-1",
                    "水+1"
                ],
                "lover": [],
                "dropitem": [
                    "毛皮",
                    "上質の毛皮",
                    "狼の牙(狼牙)"
                ],
                "getitem": [
                    "狼の牙(狼牙)",
                    "可以騎乘"
                ],
                "area": [
                    "氷沈む川",
                    "白かぶる樹"
                ]
            },
            {
                "name": "ハンターウルフ(獵狼)",
                "defattr": [],
                "lover": [
                    "狼の牙(狼牙)"
                ],
                "dropitem": [
                    "毛皮",
                    "上質の毛皮",
                    "狼の牙(狼牙)"
                ],
                "getitem": [
                    "狼の牙(狼牙)",
                    "可以騎乘"
                ],
                "area": [
                    "風止み洞窟",
                    "銀の水源"
                ]
            },
            {
                "name": "カブカブリ(蕪菁幽靈/蕪菁鬼)",
                "defattr": [
                    "水+2",
                    "地+1",
                    "風+1",
                    "光+1",
                    "暗+2"
                ],
                "lover": [],
                "dropitem": [
                    "カブ(蕪菁)",
                    "カブの種(蕪菁的種子)",
                    "浮遊霊の頭巾(浮游靈的頭巾)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "冷たき結晶",
                    "氷沈む川"
                ]
            },
            {
                "name": "マンモス(猛犸/毛象)",
                "defattr": [
                    "火-1",
                    "水+2"
                ],
                "lover": [],
                "dropitem": [
                    "毛皮",
                    "上質の毛皮",
                    "ボロのじょうろ(破灑水壺)"
                ],
                "getitem": [
                    "無",
                    "可以騎乘"
                ],
                "area": [
                    "大地覗く氷",
                    "風止み洞窟",
                    "銀の水源"
                ]
            },
            {
                "name": "リトルウィザード(小巫師)",
                "defattr": [
                    "火-1",
                    "水+2",
                    "地+2",
                    "風+1",
                    "光+1",
                    "暗+1"
                ],
                "lover": [],
                "dropitem": [
                    "魔力の結晶(魔力之結晶)",
                    "魔法使いの粉(魔法師之粉)",
                    "小さな結晶(小結晶)",
                    "薬學上級レシピパン(藥學上級配方面包)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "氷沈む川"
                ]
            },
            {
                "name": "ツンドラ(冰精靈/凍晶)",
                "defattr": [
                    "火-2",
                    "水+4",
                    "地+2",
                    "風+2",
                    "光+2",
                    "暗+2"
                ],
                "lover": [],
                "dropitem": [
                    "水の結晶(水之結晶)",
                    "魔力の結晶(魔力之結晶)"
                ],
                "getitem": [
                    "無",
                    "可以騎乘"
                ],
                "area": [
                    "白かぶる樹",
                    "インヴァエル空洞"
                ]
            },
            {
                "name": "ゴースト(鬼魂)",
                "defattr": [
                    "光-1",
                    "暗+1"
                ],
                "lover": [],
                "dropitem": [
                    "ドクロ(骷髏)",
                    "浮遊霊の頭巾(浮游靈的頭巾)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "白かぶる樹",
                    "インヴァエル空洞"
                ]
            },
            {
                "name": "ネクロ(內克羅)",
                "defattr": [
                    "光-1",
                    "暗+1"
                ],
                "lover": [],
                "dropitem": [
                    "ドクロ(骷髏)",
                    "浮遊霊の頭巾(浮游靈的頭巾)"
                ],
                "getitem": [
                    "無",
                    "可以騎乘"
                ],
                "area": [
                    "風止み洞窟",
                    "銀の水源"
                ]
            },
            {
                "name": "ダークスライム(黑暗史萊姆)",
                "defattr": [
                    "火+2",
                    "水+2",
                    "地+2",
                    "風+2",
                    "光+2",
                    "暗+4",
                    "愛-2"
                ],
                "lover": [],
                "dropitem": [
                    "ワイン(紅酒)",
                    "アクアマリン(海藍寶石)",
                    "サファイア(藍寶石)",
                    "小さな結晶(小結晶)"
                ],
                "getitem": [
                    "小さな結晶(小結晶)"
                ],
                "area": [
                    "冷たき結晶",
                    "氷沈む川"
                ]
            },
            {
                "name": "ペンギン(企鵝)",
                "defattr": [
                    "火-1",
                    "水+1"
                ],
                "lover": [],
                "dropitem": [
                    "鳥の羽(鳥之羽)",
                    "毛皮",
                    "上質な毛皮"
                ],
                "getitem": [
                    "無",
                    "可以騎乘"
                ],
                "area": [
                    "風凍る岸辺",
                    "歩み凍る道"
                ]
            },
            {
                "name": "オークバイキング(維京獸人)",
                "defattr": [
                    "火-1",
                    "水+1"
                ],
                "lover": [],
                "dropitem": [
                    "バイキングの肩當て(維京護肩)",
                    "にかわ(骨膠)",
                    "ワイン(紅酒)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "風凍る岸辺",
                    "歩み凍る道",
                    "冷たき結晶",
                    "氷沈む川"
                ]
            },
            {
                "name": "ハイオークバイキング(高等維京獸人)",
                "defattr": [
                    "火-1",
                    "水+2"
                ],
                "lover": [],
                "dropitem": [
                    "バイキングの肩當て(維京護肩)",
                    "にかわ(骨膠)",
                    "ワイン(紅酒)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "白かぶる樹",
                    "大地覗く氷"
                ]
            },
            {
                "name": "オーガバイキング(維京食人魔)",
                "defattr": [
                    "火-1",
                    "水+1"
                ],
                "lover": [],
                "dropitem": [
                    "バイキングの肩當て(維京護肩)",
                    "にかわ(骨膠)",
                    "ワイン(紅酒)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "風凍る岸辺",
                    "歩み凍る道"
                ]
            },
            {
                "name": "ハイオーガバイキング(高等維京食人魔)",
                "defattr": [
                    "火-1",
                    "水+2"
                ],
                "lover": [],
                "dropitem": [
                    "バイキングの肩當て(維京護肩)",
                    "にかわ(骨膠)",
                    "ワイン(紅酒)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "大地覗く氷",
                    "風止み洞窟",
                    "銀の水源"
                ]
            },
            {
                "name": "デスウォール(死亡之墻)",
                "defattr": [
                    "水+4",
                    "地+2",
                    "風+2",
                    "光+1",
                    "暗+2",
                    "愛-1"
                ],
                "lover": [],
                "dropitem": [
                    "氷壁のかけら(冰壁的碎片)",
                    "水の結晶(水之結晶)"
                ],
                "getitem": [
                    "不可作同伴"
                ],
                "area": [
                    "歩み止まり天仰ぐ道"
                ]
            }
        ]
    },
    {
        "category": "龍玄洞",
        "tab": "dramaze",
        "data": [
            {
                "name": "ファウスト(浮士德)",
                "defattr": [
                    "火+1",
                    "水+1",
                    "地+1",
                    "風+1",
                    "光-1",
                    "暗+4"
                ],
                "lover": [],
                "dropitem": [
                    "浮遊霊の頭巾(浮游靈的頭巾)",
                    "ドクロ(骷髏)"
                ],
                "getitem": [
                    "無",
                    "可以騎乘"
                ],
                "area": [
                    "水面ゆらめく道",
                    "石渡り水巡る道",
                    "記憶凍りし結晶の洞",
                    "水の守り人立つ道"
                ]
            },
            {
                "name": "ミノタウロスキング(米諾陶洛斯王/牛頭王)",
                "defattr": [
                    "光-1",
                    "暗+2"
                ],
                "lover": [],
                "dropitem": [
                    "ハンマーの破片(錘子的碎片)",
                    "魔人の角(魔人之角)",
                    "ザ・プロテイン(蛋白質)"
                ],
                "getitem": [
                    "無",
                    "可以騎乘"
                ],
                "area": [
                    "歴史刻む水流",
                    "せせらぎ響く石の道"
                ]
            },
            {
                "name": "デーモン(惡魔)",
                "defattr": [
                    "光-1",
                    "暗+2"
                ],
                "lover": [],
                "dropitem": [
                    "悪魔の血(惡魔之血)",
                    "魔人の角(魔人之角)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "陽光集う春の間",
                    "古の始まる坂"
                ]
            },
            {
                "name": "アークデーモン(大惡魔)",
                "defattr": [
                    "光-1",
                    "暗+4"
                ],
                "lover": [],
                "dropitem": [
                    "悪魔の血(惡魔之血)",
                    "魔人の角(魔人之角)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "水の守り人立つ道",
                    "天を突く冷気の針",
                    "時を重ねる秋の間",
                    "歴史刻む水流"
                ]
            },
            {
                "name": "ハーデス(哈迪斯)",
                "defattr": [
                    "火+2",
                    "水+2",
                    "風+4",
                    "光+2",
                    "暗+2"
                ],
                "lover": [],
                "dropitem": [
                    "妖精の粉(妖精之粉)",
                    "戀の予感(戀愛預感)",
                    "ラブ飲みドリンク(愛情飲料)"
                ],
                "getitem": [
                    "妖精の粉(妖精之粉)"
                ],
                "area": [
                    "歴史刻む水流",
                    "意識支えし雙柱"
                ]
            },
            {
                "name": "リトルメイジ(小法師)",
                "defattr": [
                    "火+2",
                    "水-1",
                    "地+1",
                    "風+1",
                    "光+1",
                    "暗+1"
                ],
                "lover": [],
                "dropitem": [
                    "小さな結晶(小結晶)",
                    "魔法使いの粉(魔法師之粉)",
                    "魔力の結晶(魔力之結晶)",
                    "薬學上級レシピパン(藥學上級配方面包)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "水面ゆらめく道",
                    "陽光集う春の間",
                    "石渡り水巡る道",
                    "古の始まる坂"
                ]
            },
            {
                "name": "リトルエンペラー(小皇帝)",
                "defattr": [
                    "火+1",
                    "水+1",
                    "地+1",
                    "風+1",
                    "光+2",
                    "暗+2"
                ],
                "lover": [],
                "dropitem": [
                    "小さな結晶(小結晶)",
                    "魔法使いの粉(魔法師之粉)",
                    "魔力の結晶(魔力之結晶)",
                    "薬學上級レシピパン(藥學上級配方面包)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "天を突く冷気の針",
                    "時を重ねる秋の間",
                    "歴史刻む水流",
                    "せせらぎ響く石の道"
                ]
            },
            {
                "name": "クイーンビー(女王蜂)",
                "defattr": [
                    "火-1",
                    "風+2"
                ],
                "lover": [
                    "ハチミツ(蜂蜜)"
                ],
                "dropitem": [
                    "蟲の皮(蟲皮)",
                    "キレイな蟲の皮(漂亮的蟲皮)",
                    "昆蟲のアゴ(昆蟲的下顎)",
                    "ハチミツ(蜂蜜)"
                ],
                "getitem": [
                    "ハチミツ(蜂蜜)"
                ],
                "area": [
                    "石渡り水巡る道",
                    "大地貫く巖壁"
                ]
            },
            {
                "name": "ブラッドパンサー(血豹)",
                "defattr": [
                    "光-1",
                    "暗+2"
                ],
                "lover": [],
                "dropitem": [
                    "毛皮",
                    "上質の毛皮",
                    "豹の爪(豹爪)"
                ],
                "getitem": [
                    "豹の爪(豹爪)",
                    "可以騎乘"
                ],
                "area": [
                    "石渡り水巡る道",
                    "記憶凍りし結晶の洞",
                    "竜骨舞う夏の間",
                    "水の守り人立つ道",
                    "光探す水の迴廊"
                ]
            },
            {
                "name": "パックンボックス(貪吃箱)",
                "defattr": [
                    "光-1",
                    "暗+2"
                ],
                "lover": [],
                "dropitem": [
                    "失敗作",
                    "超失敗作",
                    "壊れた柄(壞掉的柄)",
                    "壊れた木箱(壞掉的木箱)"
                ],
                "getitem": [
                    "無"
                ],
                "area": [
                    "大地貫く巖壁",
                    "記憶凍りし結晶の洞",
                    "竜骨舞う夏の間"
                ]
            },
            {
                "name": "ミニゴーレム(迷你格勒姆/小怪力)",
                "defattr": [],
                "lover": [],
                "dropitem": [
                    "銀",
                    "金",
                    "プラチナ(白金)",
                    "ダイアモンド(鑽石)"
                ],
                "getitem": [
                    "無",
                    "可以騎乘"
                ],
                "area": [
                    "天を突く冷気の針",
                    "時を重ねる秋の間"
                ]
            },
            {
                "name": "エアラー(風精靈)",
                "defattr": [
                    "火+2",
                    "水+2",
                    "地-2",
                    "風+4",
                    "光+2",
                    "暗+2"
                ],
                "lover": [],
                "dropitem": [
                    "風の結晶(風之結晶)",
                    "魔力の結晶(魔力之結晶)"
                ],
                "getitem": [
                    "無",
                    "可以騎乘"
                ],
                "area": [
                    "せせらぎ響く石の道",
                    "歩み止まる冬の間"
                ]
            },
            {
                "name": "ミニドラゴン(迷你龍/小龍)",
                "defattr": [
                    "火+4",
                    "地+1",
                    "風+1",
                    "光+1",
                    "暗-1"
                ],
                "lover": [
                    "ドラゴンの牙",
                    "(龍牙)"
                ],
                "dropitem": [
                    "ドラゴンの牙(龍牙)"
                ],
                "getitem": [
                    "無",
                    "可以騎乘"
                ],
                "area": [
                    "せせらぎ響く石の道",
                    "意識支えし雙柱",
                    "歩み止まる冬の間"
                ]
            },
            {
                "name": "アクナビート(阿庫納位元)",
                "defattr": [
                    "水+4",
                    "地+2",
                    "風+2",
                    "光+1",
                    "暗+2"
                ],
                "lover": [],
                "dropitem": [
                    "水竜の羽ビレ(水龍的羽鰭)",
                    "ヌッシーのうろこ(魚主之鱗/努西之鱗)"
                ],
                "getitem": [
                    "不可作同伴"
                ],
                "area": [
                    "玄泳的龍之巢"
                ]
            }
        ]
    },
    {
        "category": "西亞廉斯迷宮",
        "tab": "finmaze",
        "data": [
            {
                "name": "モコモコキング(莫可莫可王王)",
                "defattr": [
                    "地+4",
                    "光+1",
                    "水+4",
                    "暗+1"
                ],
                "lover": [],
                "dropitem": [
                    "莫可棉"
                ],
                "getitem": [
                    "不可作同伴"
                ],
                "area": [
                    "西亞廉斯迷宮"
                ]
            },
            {
                "name": "ガードオーク(獸人守衛)",
                "defattr": [
                    "火+1",
                    "地+4",
                    "光+1",
                    "愛+1",
                    "水+1",
                    "風+1"
                ],
                "lover": [],
                "dropitem": [],
                "getitem": [
                    "不可作同伴"
                ],
                "area": [
                    "西亞廉斯迷宮"
                ]
            },
            {
                "name": "ガードゴーレム(怪力守衛)",
                "defattr": [],
                "lover": [],
                "dropitem": [],
                "getitem": [
                    "不可作同伴"
                ],
                "area": [
                    "西亞廉斯迷宮"
                ]
            },
            {
                "name": "ガードミノタウロス(牛頭守衛)",
                "defattr": [
                    "火+1",
                    "地+1",
                    "愛+1",
                    "水+1",
                    "風+4"
                ],
                "lover": [],
                "dropitem": [],
                "getitem": [
                    "不可作同伴"
                ],
                "area": [
                    "西亞廉斯迷宮"
                ]
            },
            {
                "name": "ガードドラゴン(龍守衛)",
                "defattr": [
                    "火+4",
                    "地+2",
                    "光+1",
                    "水+2",
                    "風+4"
                ],
                "lover": [],
                "dropitem": [
                    "龍牙"
                ],
                "getitem": [
                    "不可作同伴"
                ],
                "area": [
                    "西亞廉斯迷宮"
                ]
            }
        ]
    }
];

Vue.component('weapon-cap', {
    data() {
        return {
            dataList: weaponCap,
        }
    },
    template: ` 
    <div class="ts-content">
        <div class="ts-tab is-pilled" style="justify-content: center;">
            <button class="item is-accent" v-for="(lists, i) in dataList" :data-tab="lists.tab" :class="[lists.active?'is-active':'']">
                {{ lists.category }}
            </button>
        </div>
        <div class="ts-space"></div>
        <div class="ts-segment" :data-name="lists.tab" v-for="(lists, i) in dataList">
            <table class="ts-table">
                <thead>
                    <tr>
                        <th>名稱</th>
                        <th>屬性</th>
                        <th>攻擊</th>
                        <th>特殊能力</th>
                        <th>特殊效果</th>
                        <th>買價</th>
                        <th>賣價</th>
                    </tr>
                </thead>
                <tbody>
                    <tr v-for="(item, index) in lists.list" :key="index">
                        <td>{{ item.name }}</td>
                        <td>{{ item.attr }}</td>
                        <td>{{ item.atk }}</td>
                        <td>{{ item.sp }}</td>
                        <td>{{ item.se }}</td>
                        <td>{{ item.buy }}</td>
                        <td>{{ item.sell }}</td>
                    </tr>
                </tbody>
            </table>
        </div>
    </div>
    `
});

Vue.component('weapon-rec', {
    data() {
        return {
            dataList: weaponRec,
        }
    },
    template: ` 
    <div class="ts-content">
        <div class="ts-tab is-pilled" style="justify-content: center;">
            <button class="item is-accent" v-for="(lists, i) in dataList" :data-tab="lists.tab" :class="[lists.active?'is-active':'']">
                {{ lists.category }}
            </button>
        </div>
        <div class="ts-space"></div>
        <div class="ts-segment" :data-name="lists.tab" v-for="(lists, i) in dataList">
            <table class="ts-table">
                <thead>
                    <tr>
                        <th>名稱</th>
                        <th>等級</th>
                        <th>材料1</th>
                        <th>材料2</th>
                        <th>材料3</th>
                        <th>材料4</th>
                        <th>材料5</th>
                        <th>材料6</th>
                    </tr>
                </thead>
                <tbody>
                    <tr v-for="(item, index) in lists.list" :key="index">
                        <td>{{ item.name }}</td>
                        <td>{{ item.skillLv }}</td>
                        <td>{{ item.item1 }}</td>
                        <td>{{ item.item2 }}</td>
                        <td>{{ item.item3 }}</td>
                        <td>{{ item.item4 }}</td>
                        <td>{{ item.item5 }}</td>
                        <td>{{ item.item6 }}</td>
                    </tr>
                </tbody>
            </table>
        </div>
    </div>
    `
});

Vue.component('staff-mater', {
    data() {
        return {
            dataList: staffMater,
        }
    },
    template: ` 
    <div class="ts-content">
        <div class="ts-tab is-pilled" style="justify-content: center;">
            <button class="item is-accent" v-for="(lists, i) in dataList" :data-tab="lists.tab" :class="[lists.active?'is-active':'']">
                {{ lists.category }}
            </button>
        </div>
        <div class="ts-space"></div>
        <div class="ts-segment" :data-name="lists.tab" v-for="(lists, i) in dataList">
            <table class="ts-table">
                <thead>
                    <tr>
                        <th>名稱</th>
                        <th>Lv1屬性</th>
                        <th>Lv1</th>
                        <th>Lv2屬性</th>
                        <th>Lv2</th>
                        <th>Lv3屬性</th>
                        <th>Lv3</th>
                        <th>速度</th>
                        <th>參考</th>
                    </tr>
                </thead>
                <tbody>
                    <tr v-for="(item, index) in lists.list" :key="index">
                        <td>{{ item.name }}</td>
                        <td v-for="(data , index) in item.data" :kry="index">
                        {{data}}</td>
                    </tr>
                </tbody>
            </table>
        </div>
    </div>
    `
});

Vue.component('farm-rec', {
    data() {
        return {
            dataList: farmRec,
        }
    },
    template: ` 
    <div class="ts-content">
        <div class="ts-tab is-pilled" style="justify-content: center;">
            <button class="item is-accent" v-for="(lists, i) in dataList" :data-tab="lists.tab" :class="[lists.active?'is-active':'']">
                {{ lists.category }}
            </button>
        </div>
        <div class="ts-space"></div>
        <div class="ts-segment" :data-name="lists.tab" v-for="(lists, i) in dataList">
            <table class="ts-table">
                <thead>
                    <tr>
                        <th>名稱</th>
                        <th>等級</th>
                        <th>材料1</th>
                        <th>材料2</th>
                        <th>材料3</th>
                        <th>材料4</th>
                        <th>材料5</th>
                        <th>材料6</th>
                    </tr>
                </thead>
                <tbody>
                <tr v-for="(item, index) in lists.list" :key="index">
                    <td>{{ item.name }}</td>
                    <td>{{ item.skillLv }}</td>
                    <td>{{ item.item1 }}</td>
                    <td>{{ item.item2 }}</td>
                    <td>{{ item.item3 }}</td>
                    <td>{{ item.item4 }}</td>
                    <td>{{ item.item5 }}</td>
                    <td>{{ item.item6 }}</td>
                </tr>
                </tbody>
            </table>
        </div>
    </div>
    `
});

Vue.component('equi-mater', {
    data() {
        return {
            dataList: equiMater,
        }
    },
    template: ` 
    <div class="ts-content">
        <div class="ts-segment">
            <table class="ts-table">
                <thead>
                    <tr>
                        <th>名稱</th>
                        <th>取得</th>
                        <th>難度</th>
                        <th>屬性</th>
                        <th>攻擊</th>
                        <th>防禦</th>
                        <th>魔攻</th>
                        <th>魔防</th>
                        <th>力量</th>
                        <th>體力</th>
                        <th>智力</th>
                        <th>特殊能力</th>
                    </tr>
                </thead>
                <tbody>
                    <tr v-for="(item, index) in dataList" :key="index">
                        <td>{{ item.name }}</td>
                        <td>
                        <td class="ts-wrap" style="width:13rem;">
                            <div class="ts-chip is-spaced is-outlined" v-for="spantag in item.get">
                                {{spantag}}
                            </div>
                        </td>
                        <td>{{ item.difficulty }}</td>
                        <td>{{ item.attr }}</td>
                        <td>{{ item.atk }}</td>
                        <td>{{ item.def }}</td>
                        <td>{{ item.matk }}</td>
                        <td>{{ item.mdef }}</td>
                        <td>{{ item.str }}</td>
                        <td>{{ item.vit }}</td>
                        <td>{{ item.int }}</td>
                        <td>{{ item.sp }}</td>
                    </tr>
                </tbody>
            </table>
        </div>
    </div>
    `
});

Vue.component('decor-rec', {
    data() {
        return {
            dataList: decorRec,
        }
    },
    template: ` 
    <div class="ts-content">
        <div class="ts-tab is-pilled" style="justify-content: center;">
            <button class="item is-accent" v-for="(lists, i) in dataList" :data-tab="lists.tab" :class="[lists.active?'is-active':'']">
                {{ lists.category }}
            </button>
        </div>
        <div class="ts-space"></div>
        <div class="ts-segment" :data-name="lists.tab" v-for="(lists, i) in dataList">
            <table class="ts-table">
                <thead>
                    <tr>
                        <th>名稱</th>
                        <th>等級</th>
                        <th>材料1</th>
                        <th>材料2</th>
                        <th>材料3</th>
                        <th>材料4</th>
                        <th>材料5</th>
                        <th>材料6</th>
                    </tr>
                </thead>
                <tbody>
                    <tr v-for="(item, index) in lists.list" :key="index">
                        <td>{{ item.name }}</td>
                        <td>{{ item.skillLv }}</td>
                        <td>{{ item.item1 }}</td>
                        <td>{{ item.item2 }}</td>
                        <td>{{ item.item3 }}</td>
                        <td>{{ item.item4 }}</td>
                        <td>{{ item.item5 }}</td>
                        <td>{{ item.item6 }}</td>
                    </tr>
                </tbody>
            </table>
        </div>
    </div>
    `
});

Vue.component('acce-cap', {
    data() {
        return {
            dataList: acceCap,
        }
    },
    template: ` 
    <div class="ts-content">
        <div class="ts-segment">
            <table class="ts-table" style=" white-space: initial;">
                <thead>
                    <tr>
                        <th>名稱</th>
                        <th>屬性</th>
                        <th>特殊能力</th>
                        <th>特殊效果</th>
                        <th>買價</th>
                        <th>賣價</th>
                        <th>資訊</th>
                    </tr>
                </thead>
                <tbody>
                    <tr v-for="(item, index) in dataList" :key="index">
                        <td>{{ item.name }}</td>
                        <td>{{ item.attr }}</td>
                        <td class="ts-wrap" style="width:13rem;">
                            <div class="ts-chip is-spaced is-outlined" v-for="sp in item.sp">
                                {{ sp }}
                            </div>
                        </td>
                        <td>{{ item.se }}</td>
                        <td>{{ item.buy }}</td>
                        <td>{{ item.sell }}</td>
                        <td>{{ item.notion }}</td>
                    </tr>
                </tbody>
            </table>
        </div>
    </div>
    `
});

Vue.component('shoe-cap', {
    data() {
        return {
            dataList: shoeCap,
        }
    },
    template: ` 
    <div class="ts-content">
        <div class="ts-segment">
            <table class="ts-table" style=" white-space: initial;">
                <thead>
                    <tr>
                        <th>名稱</th>
                        <th>防禦</th>
                        <th>魔防</th>
                        <th>特殊能力</th>
                        <th>特殊效果</th>
                        <th>買價</th>
                        <th>賣價</th>
                    </tr>
                </thead>
                <tbody>
                    <tr v-for="(item, index) in dataList" :key="index">
                        <td>{{ item.name }}</td>
                        <td>{{ item.def }}</td>
                        <td>{{ item.mdef }}</td>
                        <td class="ts-wrap" style="width:13rem;">
                            <div class="ts-chip is-spaced is-outlined" v-for="sp in item.sp">
                                {{ sp }}
                            </div>
                        </td>
                        <td>{{ item.se }}</td>
                        <td>{{ item.buy }}</td>
                        <td>{{ item.sell }}</td>
                    </tr>
                </tbody>
            </table>
        </div>
    </div>
    `
});

Vue.component('het-cap', {
    data() {
        return {
            dataList: hetCap,
        }
    },
    template: ` 
    <div class="ts-content">
        <div class="ts-segment">
            <table class="ts-table" style=" white-space: initial;">
                <thead>
                    <tr>
                        <th>名稱</th>
                        <th>防禦</th>
                        <th>魔防</th>
                        <th>特殊能力</th>
                        <th>特殊效果</th>
                        <th>買價</th>
                        <th>賣價</th>
                    </tr>
                </thead>
                <tbody>
                    <tr v-for="(item, index) in dataList" :key="index">
                        <td>{{ item.name }}</td>
                        <td>{{ item.def }}</td>
                        <td>{{ item.mdef }}</td>
                        <td class="ts-wrap" style="width:13rem;">
                            <div class="ts-chip is-spaced is-outlined" v-for="sp in item.sp">
                                {{ sp }}
                            </div>
                        </td>
                        <td>{{ item.se }}</td>
                        <td>{{ item.buy }}</td>
                        <td>{{ item.sell }}</td>
                    </tr>
                </tbody>
            </table>
        </div>
    </div>
    `
});

Vue.component('shield-cap', {
    data() {
        return {
            dataList: shieldCap,
        }
    },
    template: ` 
    <div class="ts-content">
        <div class="ts-segment">
            <table class="ts-table" style=" white-space: initial;">
                <thead>
                    <tr>
                        <th>名稱</th>
                        <th>防禦</th>
                        <th>屬性</th>
                        <th>特殊能力</th>
                        <th>特殊效果</th>
                        <th>買價</th>
                        <th>賣價</th>
                    </tr>
                </thead>
                <tbody>
                    <tr v-for="(item, index) in dataList" :key="index">
                        <td>{{ item.name }}</td>
                        <td>{{ item.def }}</td>
                        <td>{{ item.attr }}</td>
                        <td class="ts-wrap" style="width:13rem;">
                            <div class="ts-chip is-spaced is-outlined" v-for="sp in item.sp">
                                {{ sp }}
                            </div>
                        </td>
                        <td>{{ item.se }}</td>
                        <td>{{ item.buy }}</td>
                        <td>{{ item.sell }}</td>
                    </tr>
                </tbody>
            </table>
        </div>
    </div>
    `
});

Vue.component('crop-info', {
    data() {
        return {
            dataList: cropInfo,
        }
    },
    template: ` 
    <div class="ts-content">
        <div class="ts-tab is-pilled" style="justify-content: center;">
            <button class="item is-accent" v-for="(lists, i) in dataList" :data-tab="lists.tab" :class="[lists.active?'is-active':'']">
                {{ lists.category }}
            </button>
        </div>
        <div class="ts-space"></div>
        <div class="ts-segment" :data-name="lists.tab" v-for="(lists, i) in dataList">
            <table class="ts-table">
                <thead>
                    <tr>
                        <th>名稱</th>
                        <th>種子買價</th>
                        <th>種子賣價</th>
                        <th>成長天數</th>
                        <th>連作</th>
                        <th>作物買價</th>
                        <th>作物賣價</th>
                        <th>Lv10賣價</th>
                        <th>特殊能力</th>
                        <th>時間</th>
                    </tr>
                </thead>
                <tbody>
                    <tr v-for="(item, index) in lists.list" :key="index">
                        <td>{{ item.name }}</td>
                        <td>{{ item.seedBuy }}</td>
                        <td>{{ item.seedSell }}</td>
                        <td>{{ item.matureDay }}</td>
                        <td>{{ item.crop }}</td>
                        <td>{{ item.cropBuy }}</td>
                        <td>{{ item.cropSell }}</td>
                        <td>{{ item.Lv10Sell }}</td>
                        <td class="ts-wrap" style="width:13rem;">
                            <div class="ts-chip is-spaced is-outlined" v-for="sp in item.sp">
                                {{sp}}
                            </div>
                        </td>
                        <td>{{ item.time }}</td>
                    </tr>
                </tbody>
            </table>
        </div>
    </div>
    `
});

Vue.component('cooking-rec', {
    data() {
        return {
            dataList: cookingRec,
        }
    },
    template: ` 
    <div class="ts-content">
        <div class="ts-tab is-pilled" style="justify-content: center;">
            <button class="item is-accent" v-for="(lists, i) in dataList" :data-tab="lists.tab" :class="[lists.active?'is-active':'']">
                {{ lists.category }}
            </button>
        </div>
        <div class="ts-space"></div>
        <div class="ts-segment" :data-name="lists.tab" v-for="(lists, i) in dataList">
            <table class="ts-table">
                <thead>
                    <tr>
                        <th style="max-width:10rem;">名稱</th>
                        <th>等級</th>
                        <th style="max-width:15rem;">材料</th>
                        <th>特殊能力</th>
                        <th>時間</th>
                    </tr>
                </thead>
                <tbody>
                    <tr v-for="(item, index) in lists.list" :key="index">
                        <td>{{ item.name }}</td>
                        <td>{{ item.skillLv }}</td>
                        <td>
                            <div class="ts-wrap" style="max-width:15rem;">
                                <div class="ts-chip is-spaced is-outlined" v-for="it in item.item">
                                    {{it}}
                                </div>
                            </div>
                        </td>
                        <td>
                            <div class="ts-wrap" style="max-width: 20rem;">
                                <div class="ts-chip is-spaced is-outlined" v-for="sp in item.sp">
                                    {{sp}}
                                </div>
                            </div>
                        </td>
                        <td>{{ item.time }}</td>
                    </tr>
                </tbody>
            </table>
        </div>
    </div>
    `
});

Vue.component('drug-rec', {
    data() {
        return {
            dataList: drugRec,
        }
    },
    template: ` 
    <div class="ts-content">
        <div class="ts-segment">
            <table class="ts-table" style=" white-space: initial;">
                <thead>
                    <tr>
                        <th style="width:10rem;">名稱</th>
                        <th style="width: 5rem;">等級</th>
                        <th>材料1</th>
                        <th>材料2</th>
                        <th>材料3</th>
                        <th>材料4</th>
                        <th>材料5</th>
                        <th>材料6</th>
                        <th>效果</th>
                    </tr>
                </thead>
                <tbody>
                    <tr v-for="(item, index) in dataList" :key="index">
                        <td>{{ item.name }}</td>
                        <td>{{ item.skillLv }}</td>
                        <td>{{ item.item1 }}</td>
                        <td>{{ item.item2 }}</td>
                        <td>{{ item.item3 }}</td>
                        <td>{{ item.item4 }}</td>
                        <td>{{ item.item5 }}</td>
                        <td>{{ item.item6 }}</td>
                        <td class="ts-wrap">
                            <div class="ts-chip is-spaced is-outlined" v-for="sp in item.sp">
                            {{ sp }}
                        </div>
                        </td>
                    </tr>
                </tbody>
            </table>
        </div>
    </div>
    `
});

Vue.component('fish-town', {
    data() {
        return {
            dataList: fishTown,
        }
    },
    template: ` 
    <div class="ts-content">
        <div class="ts-tab is-pilled" style="justify-content: center;">
            <button class="item is-accent" v-for="(lists, i) in dataList" :data-tab="lists.tab" :class="[lists.active?'is-active':'']">
                {{ lists.category }}
            </button>
        </div>
        <div class="ts-space"></div>
        <div class="ts-segment" :data-name="lists.tab" v-for="(lists, i) in dataList">
            <table class="ts-table"> 
                <thead>
                    <tr>
                        <th style="width:25%;">春天</th>
                        <th style="width:25%;">夏天</th>
                        <th style="width:25%;">秋天</th>
                        <th style="width:25%;">冬天</th>
                    </tr>
                </thead>
                <tbody>
                    <tr>
                        <td>
                            <div class="ts-list is-unordered">
                                <div class="item" v-for="item in lists.data.spring">{{item}}</div>
                            </div>
                        </td>
                        <td>
                            <div class="ts-list is-unordered">
                                <div class="item" v-for="item in lists.data.summer">{{item}}</div>
                            </div>
                        </td>
                        <td>
                            <div class="ts-list is-unordered">
                                <div class="item" v-for="item in lists.data.autumn">{{item}}</div>
                            </div>
                        </td>
                        <td>
                            <div class="ts-list is-unordered">
                                <div class="item" v-for="item in lists.data.east">{{item}}</div>
                            </div>
                        </td>

                    </tr>
                </tbody>
            </table>
        </div>
    </div>
    `
});

Vue.component('fish-maze', {
    data() {
        return {
            dataList: fishMaze,
        }
    },
    template: ` 
    <div class="ts-content">
        <div class="ts-tab is-pilled" style="justify-content: center;">
            <button class="item is-accent" v-for="(lists, i) in dataList" :data-tab="lists.tab" :class="[lists.active?'is-active':'']">
                {{ lists.category }}
            </button>
        </div>
        <div class="ts-space"></div>
        <div class="ts-segment" :data-name="lists.tab" v-for="(lists, i) in dataList">
            <table class="ts-table">
                <thead>
                    <tr>
                        <th style="max-width:10rem;">名稱</th>
                        <th style="max-width:15rem;">可釣的魚</th>
                    </tr>
                </thead>
                <tbody>
                    <tr v-for="(item, index) in lists.list" :key="index">
                        <td>{{ item.name }}</td>
                        <td>
                            <div class="ts-wrap">
                                <div class="ts-chip is-spaced is-outlined" v-for="it in item.data">
                                    {{it}}
                                </div>
                            </div>
                        </td>
                    </tr>
                </tbody>
            </table>
        </div>
    </div>
    `
});

Vue.component('maze-data', {
    data() {
        return {
            dataList: mazeData,
        }
    },
    template: ` 
    <div class="ts-content">
        <div class="ts-tab is-pilled" style="justify-content: center;">
            <button class="item is-accent" v-for="(lists, i) in dataList" :data-tab="lists.tab" :class="[lists.active?'is-active':'']">
                {{ lists.category }}
            </button>
        </div>
        <div class="ts-space"></div>
        <div class="ts-segment" :data-name="lists.tab" v-for="(lists, i) in dataList">
            <table class="ts-table">
                <thead>
                    <tr>
                        <th>名字</th>
                        <th>抗性</th>
                        <th>喜好</th>
                        <th>採集</th>
                        <th>掉落</th>
                        <th>地區</th>
                    </tr>
                </thead>
                <tbody>
                    <tr v-for="(item, index) in lists.data" :key="index">
                        <td>{{ item.name }}</td>
                        <td>
                            <div class="ts-wrap">
                                <div class="ts-chip is-spaced is-outlined" v-for="de in item.defattr">
                                    {{de}}
                                </div>
                            </div>
                        </td>
                        <td>
                            <div class="ts-wrap">
                                <div class="ts-chip is-spaced is-outlined" v-for="lo in item.lover">
                                    {{lo}}
                                </div>
                            </div>
                        </td>
                        <td>
                            <div class="ts-wrap">
                                <div class="ts-chip is-spaced is-outlined" v-for="dr in item.dropitem">
                                    {{dr}}
                                </div>
                            </div>
                        </td>
                        <td>
                            <div class="ts-wrap">
                                <div class="ts-chip is-spaced is-outlined" v-for="ge in item.getitem">
                                    {{ge}}
                                </div>
                            </div>
                        </td>
                        <td>
                            <div class="ts-wrap">
                                <div class="ts-chip is-spaced is-outlined" v-for="ar in item.area">
                                    {{ar}}
                                </div>
                            </div>
                        </td>
                    </tr>
                </tbody>
            </table>
        </div>
    </div>
    `
});

